{
  "id": "7",
  "title": "Plumbing",
  "sections": [
    {
      "id": "7.1",
      "title": "General",
      "subsections": [
        {
          "id": "7.1.0",
          "title": "Scope",
          "content": "[ARTICLE:7.1.0.1:Scope]\n\n(1) The scope of this Part shall be as described in Subsection 1.3.3. of Division A."
        },
        {
          "id": "7.1.1",
          "title": "Application",
          "content": "[ARTICLE:7.1.1.1:Application]\n(1) Except as provided in Sentence (2), this Part applies to the design and construction of plumbing.\n(2) This Part does not apply to industrial process systems unless the industrial process system is interconnected with the plumbing system, in which case the interconnection shall be so designed and installed so that the plumbing system is protected against contamination or malfunction that may be caused by the industrial system."
        },
        {
          "id": "7.1.1A",
          "title": "Definitions",
          "content": "[ARTICLE:7.1.1A.1:Definitions]\n(1) Except as provided in Sentence (2), words that appear in italics are defined in Article 1.4.1.2. of Division A and in the Building Code Act, 1992.\n(2) In this Part,\n\nStorey means the interval between two successive floor levels including mezzanine floors that contain plumbing fixtures or between a floor level and roof."
        },
        {
          "id": "7.1.1B",
          "title": "Plumbing Facilities",
          "content": "[ARTICLE:7.1.1B.1:Facilities Required]\n\n(1) Plumbing facilities shall be provided in accordance with Subsection 3.7.4. and Section 9.31.\n\n[ARTICLE:7.1.1B.2:Floor Drains]\n(1) Where gravity drainage to a sanitary drainage system is possible, a floor drain shall be installed in a basement forming part of a dwelling unit.\n(2) Where gravity drainage to a sanitary drainage system is not possible, the floor drain required by Sentence (1) may be connected to a storm drainage system, dry well or drainage ditch provided it is located where it can receive only clear water waste or storm sewage.\n(3) A floor drain shall be provided in a public laundry room, garbage room, incinerator room, boiler or heating room that is not located within a dwelling unit."
        },
        {
          "id": "7.1.2",
          "title": "Service Connections",
          "content": "[ARTICLE:7.1.2.1:Sanitary Drainage Systems]\n(1) Except as provided in Section 7.7., sanitary drainage systems shall be connected to a public sanitary sewer, a public combined sewer or a private sewage disposal system.\n(2) A combined building drain or a combined building sewer shall not be installed. (See Note A-7.1.2.1.(2))\n\n[ARTICLE:7.1.2.2:Storm Drainage Systems]\n\n(1) Except as provided in Section 7.7., storm drainage systems and private sewers conveying storm sewage shall be connected to a public storm sewer, a public combined sewer or a designated storm water disposal location.\n\n[ARTICLE:7.1.2.3:Water Distribution Systems]\n(1) Except as provided in Section 7.7. and Sentences (2) and (3), water distribution systems shall be connected to a public water main, drinking water system or a potable private water supply system.\n(2) Storm sewage or greywater that is free of solids and treated to conform to Article 7.7.4.1. is permitted to be used as a water supply for\n(a) water closets,\n(b) urinals,\n(c) sub-surface irrigation, or\n(d) the priming of traps.\n(3) Rainwater that is free of solids and treated to conform to Article 7.7.4.1. is permitted to be used as a water supply for\n(a) clothes washers,\n(b) laundry trays,\n(c) mop sinks,\n(d) bedpan washers,\n(e) water closets,\n(f) urinals,\n(g) hose bibbs,\n(h) sub-surface irrigation, or\n(i) the priming of traps.\n(4) Piping conveying the non-potable water described in Sentence (2) shall be installed in conformance with Section 7.7.\n\n[ARTICLE:7.1.2.4:Separate Services]\n(1) Except as provided in Sentences (2) and (3), piping in any building connected to the public services shall be connected separately from piping of any other building, except that an ancillary building on the same property may be served by the same service. (See Note A-7.1.2.4.(1))\n(2) No plumbing serving a dwelling unit shall be installed in or under another unit of the building unless the piping is located in a tunnel, pipe corridor, common basement or parking garage, so that the piping is accessible for servicing and maintenance throughout its length without encroachment on any private living space, but this Sentence does not prevent plumbing serving a unit located above another unit from being installed in or under the lower unit.\n(3) Water service pipes or building sewers serving buildings located on the same property may connect into a private water supply or a private sewer conforming to Article 7.1.2.5.\n\n[ARTICLE:7.1.2.5:Private Sewers and Private Water Supply]\n(1) Private water supply pipes shall be designed and installed according to MOE PIBS 6881e, \"Design Guidelines for Drinking-Water Systems\".\n(2) Private sewers shall be designed and installed according to MOE PIBS 6879, \"Design Guidelines for Sewage Works\"."
        },
        {
          "id": "7.1.3",
          "title": "Location of Fixtures",
          "content": "[ARTICLE:7.1.3.1:Lighting and Ventilation Requirements]\n\n(1) Plumbing fixtures shall not be installed in a room that is not lighted and ventilated in accordance with the appropriate requirements in Parts 3, 6 and 9.\n\n[ARTICLE:7.1.3.2:Accessibility]\n\n(1) Every fixture, plumbing appliance, interceptor, cleanout, valve, device or piece of equipment shall be located so that it is readily accessible for use, cleaning and maintenance."
        },
        {
          "id": "7.1.3A",
          "title": "Accommodating Movement",
          "content": "[ARTICLE:7.1.3A.1:Structural Movement]\n\n(1) Plumbing shall be designed and installed to accommodate the maximum relative structural movement provided for in the construction of the building."
        },
        {
          "id": "7.1.4",
          "title": "Seismic Design",
          "content": "[ARTICLE:7.1.4.1:Seismic Restraints and Design]\n\n(1) Plumbing systems in buildings constructed in accordance with Part 3 shall be designed and installed to accommodate the seismic forces addressed in Subsection 4.1.8. (See Note A-7.1.4.1.(1))"
        }
      ]
    },
    {
      "id": "7.2",
      "title": "Materials and Equipment",
      "subsections": [
        {
          "id": "7.2.1",
          "title": "General",
          "content": "[ARTICLE:7.2.1.1:Exposure of Materials]\n(1) Where unusual conditions exist such as excessively corrosive soil or water, only materials suited for use in such locations shall be used.\n(2) Materials and equipment used in a drainage system where excessively corrosive wastes are present shall be suitable for the purpose.\n\n[ARTICLE:7.2.1.2:Restrictions on Re-Use]\n(1) Materials and equipment that have been used for a purpose other than the distribution of potable water shall not be subsequently used in a potable water system.\n(2) Used materials and equipment, including fixtures, shall not be reused unless they meet the requirements of this Part for new materials and equipment and are otherwise satisfactory for their intended use.\n\n[ARTICLE:7.2.1.3:Identification]\n(1) Every length of pipe and every fitting shall\n(a) have cast, stamped or indelibly marked on it the maker's name or mark and the weight or class or quality of the product, or\n(b) be marked in accordance with the relevant standard.\n(2) Markings required in Sentence (1) shall be visible after installation.\n(3) The lack of certification markings on a product or plumbing component shall be regarded as proof, in the absence of evidence to the contrary, that no certification exists.\n(4) If a component of a plumbing system is required to be certified to a standard, the certification shall be made by a testing agency accredited for that purpose by the Standards Council of Canada.\n\n[ARTICLE:7.2.1.4:Pipe or Piping]\n\n(1) Where the term pipe or piping and fittings is used, it shall also apply to tube or tubing and fittings unless otherwise stated.\n\n[ARTICLE:7.2.1.5:Withstanding Pressure]\n\n(1) Piping, fittings and joints used in pressure sewer, forcemain or sump pump discharge applications shall be capable of withstanding at least one and one-half times the maximum potential pressure.\n\n[ARTICLE:7.2.1.6:Working Pressure of a Water Service Pipe]\n\n(1) The working pressure rating of a water service pipe shall not be less than the maximum water main pressure at their point of connection as established by the water supply authority."
        },
        {
          "id": "7.2.2",
          "title": "Fixtures",
          "content": "[ARTICLE:7.2.2.1:Surface Requirements]\n\n(1) Every fixture shall have a smooth, hard, corrosion-resistant surface free of flaws and blemishes that may interfere with cleaning.\n\n[ARTICLE:7.2.2.2:Conformance to Standards]\n(0.1) Water closets and urinals shall conform to the requirements in Article 7.6.1.6.\n(1) Except as provided in Article [7.2.2.3.,](#page-604-0)\n(a) reserved,\n(b) vitreous china fixtures shall conform to ASME A112.19.2 / CSA B45.1, \"Ceramic Plumbing Fixtures,\"\n(c) enamelled cast-iron fixtures shall conform to ASME A112.19.1 / CSA B45.2, \"Enamelled Cast Iron and Enamelled Steel Plumbing Fixtures,\"\n(d) porcelain-enamelled steel fixtures shall conform to ASME A112.19.1 / CSA B45.2, \"Enamelled Cast Iron and Enamelled Steel Plumbing Fixtures,\"\n(e) stainless steel fixtures shall conform to ASME A112.19.3 / CSA B45.4, \"Stainless Steel Plumbing Fixtures,\"\n(f) plastic fixtures shall conform to CSA B45.5 / IAPMO Z124, \"Plastic plumbing fixtures,\"\n(g) hydromassage bathtubs shall conform to ASME A112.19.7 / CSA B45.10, \"Hydromassage Bathtub Systems,\"\n(h) macerating toilet systems shall conform to ASME A112.3.4 / CSA B45.9, \"Macerating Toilet Systems and Waste-Pumping Systems for Plumbing Fixtures,\" and\n(i) personal hygiene devices for water closets shall conform to ASME A112.4.2 / CSA B45.16, \"Personal hygiene devices for water closets.\"\n\n[ARTICLE:7.2.2.3:Showers]\n(1) Shower receptors shall be constructed and arranged so that water cannot leak through the walls or floor. (See Note A-7.2.2.3.(1))\n(2) Not more than 6 shower heads shall be served by a single shower drain.\n(3) Where 2 or more shower heads are served by a shower drain, the floor shall be sloped and the drain located so that water from one head cannot flow over the area that serves another head.\n(4) Except for column showers, when a battery of shower heads is installed, the horizontal distance between 2 adjacent shower heads shall be not less than 750 mm.\n\n[ARTICLE:7.2.2.4:Concealed Overflows]\n\n(1) A dishwashing sink and a food preparation sink shall not have concealed overflows. (See Note A-7.2.2.4.(1))\n\n[ARTICLE:7.2.2.5:Water Closets in Public Washrooms]\n\n(1) Except for Eastern-Style toilets, where a water closet is installed in a washroom for public use it shall be of the elongated type and provided with a seat of the open front type.\n\n[ARTICLE:7.2.2.6:Lavatories]\n\n(1) A lavatory that does not have an overflow shall be equipped with a centre outlet waste fitting. (See Note A-7.2.2.6.(1))\n\n[ARTICLE:7.2.2.7:Trough Urinals]\n\n(1) No trough urinal shall be used as part of a plumbing system."
        },
        {
          "id": "7.2.3",
          "title": "Traps and Interceptors",
          "content": "[ARTICLE:7.2.3.1:Traps]\n(1) Except as provided for in Sentence (2), traps shall\n(a) have a trap seal depth of not less than 38 mm,\n(b) be so designed that failure of the seal walls will cause exterior leakage, and\n(c) have a water seal that does not depend on the action of moving parts.\n(See Note A-7.2.3.1.(1) and (3))\n(2) The trap seal depth on fixtures draining to an acid waste system shall be a minimum of 50 mm.\n(3) Except for a floor-mounted service sink, every trap that serves a lavatory, a sink or a laundry tray shall\n(a) be provided with a cleanout plug located at the lowest point of the trap and of the same material as the trap, except that a cast iron trap shall be provided with a brass cleanout plug, or\n(b) be designed so that part of the trap can be removed for cleaning purposes.\n(See Note A-7.2.3.1.(1) and (3))\n(4) A bell trap shall not be installed in a drainage system.\n(5) A drum trap shall not be installed in a drainage system.\n(6) Except as permitted in Sentence (7), no bottle trap shall be used in a plumbing system.\n(7) A bottle trap may be used on a laboratory sink or other fixture equipped with corrosion resistant fittings.\n(8) No running trap shall be installed in a plumbing system unless an accessible handhole is provided for cleaning of the trap, and where the trap is too small to accommodate a handhole, a cleanout shall be provided.\n\n[ARTICLE:7.2.3.2:Interceptors]\n(1) Interceptors shall be designed so that they can be readily cleaned.\n(2) Grease interceptors shall be designed so that they do not become air bound.\n(3) Grease interceptors shall be selected and installed in conformance with\n(a) CSA B481.0, \"Material, design, and construction requirements for grease interceptors,\" and\n(b) CSA B481.3, \"Sizing, selection, location, and installation of grease interceptors.\"\n(See Note A-7.2.3.2.(3))\n(4) Where a grease interceptor is required by Sentence 7.4.4.3.(1), the interceptor shall conform to\n(a) CSA B481.1, \"Testing and rating of grease interceptors using lard,\" or\n(b) CSA B481.2, \"Testing and rating of grease interceptors using oil.\"\n\n[ARTICLE:7.2.3.3:Tubular Traps]\n\n(1) Tubular metal or plastic traps that conform to ASME A112.18.2 / CSA B125.2, \"Plumbing Waste Fittings\" shall be used only in accessible locations."
        },
        {
          "id": "7.2.4",
          "title": "Pipe Fittings",
          "content": "[ARTICLE:7.2.4.1:T and Cross Fittings]\n(1) A T fitting shall not be used in a drainage system except to connect a vent pipe.\n(2) A cross fitting shall not be used in a drainage system.\n\n[ARTICLE:7.2.4.2:Sanitary T Fittings]\n(1) A double sanitary T fitting shall not be used to connect the fixture drains of two urinals where no cleanout fitting is provided above the connection.\n(2) No pipe fitting, joint or connection that would tend to intercept solids or reduce the flow through a pipe by more than 10 percent shall be used in a plumbing system.\n\n[ARTICLE:7.2.4.3:90° Elbows]\n(1) Except as permitted in Sentences (2) and (3), 90° elbows of NPS 4 or less whose centre-line radius that is less than the NPS of the pipe shall not be used to join 2 sanitary drainage pipes.\n(2) For sanitary drainage systems of NPS 4 or less, 90° elbows described in Sentence (1) shall only be permitted\n(a) to change the direction of piping from horizontal to vertical, in the direction of flow,\n(b) where a trap arm enters a wall, or\n(c) to connect trap arms as permitted by Sentence 7.5.6.3.(2).\n(3) A 90° elbow that is part of the pre-engineered wastewater heat recovery system is permitted to have a centre-line radius that is less than the size of the pipe.\n\n[ARTICLE:7.2.4.4:Fittings Restricted in Use]\n\n(1) No double Y, double TY, double T or double waste fitting shall be installed in a nominally horizontal soil or waste pipe.\n\n[ARTICLE:7.2.4.5:Assembled Pipe or Tubing]\n\n(1) Pipe or tubing assembled to comprise a standard drain waste and venting system shall be connected with drain, waste and vent fittings in conformance with Table 7.2.4.5.\n\n#### Table 7.2.4.5. Pipe Arrangement for DWV Fittings Forming Part of Sentence 7.2.4.5.(1)\n\n<table class=\"obc-table\"><thead><tr><th></th><th></th><th>Fittings</th><th></th></tr></thead><tbody><tr><td>Pipe Arrangement</td><td></td><td>Acceptable</td><td>Type</td></tr><tr><td></td><td></td><td></td><td></td></tr><tr><td></td><td></td><td></td><td></td></tr><tr><td></td><td></td><td></td><td></td></tr><tr><td></td><td></td><td></td><td></td></tr><tr><td></td><td></td><td></td><td></td></tr><tr><td></td><td></td><td></td><td></td></tr><tr><td>Vent pipe<br>–<br>Drainage pipe<br>*<br>branches are of 11<br>size</td><td></td><td>LEGEND (DWV BRANCH FITTINGS)<br>–<br>–<br>–<br>–<br>–<br>–<br>–<br>–<br>–<br>–<br>——————————<br>Acceptable only if vertical run is of<br>3 inches size or larger and horizontal<br>/4, 11<br>/2, or 2 inches</td><td></td></tr><tr><td>1. Straight T<br>2. Double T or Cross<br>3. Sanitary T or Short Turn TY<br>4. Double Sanitary T or Short<br>Turn Double TY<br>5. Combination Y & 1<br>/8<br>Bend or Long Turn TY</td><td></td><td>6. Double Combination Y & 1<br>7. Y<br>8. Double Y<br>9. Double Waste Fitting</td><td>/8<br>Bend or Double Long Turn TY</td></tr></tbody></table>"
        },
        {
          "id": "7.2.5",
          "title": "Non-Metallic Pipe and Fittings",
          "content": "[ARTICLE:7.2.5.1:Fibrocement Pipe and Fittings]\n\n(1) Fibrocement pipe and fittings for use in a drain, waste or vent system shall conform to CAN/CSA-B127.3, \"Fibrocement drain, waste, and vent pipe and pipe fittings.\"\n\n[ARTICLE:7.2.5.2:Concrete Pipe and Fittings]\n(1) Concrete pipe shall conform to\n(a) CSA A257.1, \"Non-reinforced circular concrete culvert, storm drain, sewer pipe, and fittings,\" or\n(b) CSA A257.2, \"Reinforced circular concrete culvert, storm drain, sewer pipe, and fittings.\"\n(2) Joints with internal elastomeric gaskets shall conform to CSA A257.3, \"Joints for circular concrete sewer and culvert pipe, manhole sections, and fittings using rubber gaskets.\"\n(3) Concrete fittings fabricated on the site from lengths of pipe shall not be used. (See Note A-7.2.5.2.(3))\n(4) Concrete pipe shall not be used above ground inside a building.\n(5) Precast reinforced circular concrete manhole sections, catch basins and fittings shall conform to CSA A257.4, \"Precast reinforced circular concrete manhole sections, catch basins, and fittings.\"\n\n[ARTICLE:7.2.5.3:Vitrified Clay Pipe and Fittings]\n(1) Vitrified clay pipe and fittings shall be certified to CSA A60.1-M, \"Vitrified Clay Pipe.\"\n(2) Couplings and joints for vitrified clay pipe shall be certified to CSA A60.3-M, \"Vitrified Clay Pipe Joints.\"\n(3) Vitrified clay pipe and fittings shall not be used except for an underground part of a drainage system.\n\n[ARTICLE:7.2.5.4:Polyethylene Pipe and Fittings]\n(1) Polyethylene water pipe, tubing and fittings shall conform to, and have a pressure rating meeting the requirements of, Series 160 or a higher series of CSA B137.1, \"Polyethylene (pe) pipe, tubing and fittings for cold water pressure services.\"\n(2) Except as permitted in Sentence 7.2.5.6.(1), polyethylene water pipe shall not be used except for a water service pipe.\n(3) Butt fusion fittings for polyethylene pipe shall conform to ASTM D3261, \"Standard Specification for Butt Heat Fusion Polyethylene (PE) Plastic Fittings for Polyethylene (PE) Plastic Pipe and Tubing.\"\n\n[ARTICLE:7.2.5.5:Polyethylene Pipe Used Underground]\n\n(1) Polyethylene pipe used underground in a drainage system for rehabilitation of existing systems using trenchless technology shall conform to ASTM F714, \"Standard Specification for Polyethylene (PE) Plastic Pipe (DR-PR) Based on Outside Diameter\" and shall be HDPE 3408, SDR 17 or heavier. (See Note A-7.2.5.5.(1))\n\n[ARTICLE:7.2.5.6:Crosslinked Polyethylene Pipe and Fittings]\n\n(1) Crosslinked polyethylene pipe and manufacturer-approved fittings used in hot and cold potable water systems shall conform to CSA B137.5, \"Crosslinked polyethylene (PEX) tubing systems for pressure applications.\" (See Note A-7.2.5.6.(1))\n\n[ARTICLE:7.2.5.7:PVC Pipe and Fittings]\n(1) PVC water pipe, fittings and solvent cement shall\n(a) conform to CSA B137.3, \"Rigid Polyvinylchloride (PVC) pipe and fittings for pressure applications\" or CSA B137.2, \"Polyvinylchloride (PVC) injection-moulded gasketed fittings for pressure applications,\" and\n(b) a pressure rating of not less than 1 100 kPa.\n(2) PVC water pipe fittings shall conform to\n(a) ASTM D2466, \"Standard Specification for Poly(Vinyl Chloride) (PVC) Plastic Pipe Fittings, Schedule 40,\" or\n(b) ASTM D2467, \"Standard Specification for Poly(Vinyl Chloride) (PVC) Plastic Pipe Fittings, Schedule 80.\"\n(3) PVC water pipe and fittings in Sentences (1) and (2) shall not be used in a hot water system.\n\n[ARTICLE:7.2.5.8:CPVC Pipe, Fittings and Solvent Cements]\n(1) CPVC hot and cold water pipe, fittings and solvent cements shall be conform to CSA B137.6, \"Chlorinated polyvinylchloride (CPVC) pipe, tubing and fittings for hot and cold water distribution systems.\"\n(2) The design temperature and design pressure of a CPVC piping system shall conform to Table 7.2.5.8.\n#### Table 7.2.5.8. Maximum Permitted Pressure for CPVC Piping at Various Temperatures Forming Part of Sentence 7.2.5.8.(2)\n\n<table class=\"obc-table\"><thead><tr><th>Maximum Temperature of Water, °C</th><th>Maximum Permitted Pressures, kPa</th></tr></thead><tbody><tr><td>10</td><td>3150</td></tr><tr><td>20</td><td>2900</td></tr><tr><td>30</td><td>2500</td></tr><tr><td>40</td><td>2100</td></tr><tr><td>50</td><td>1700</td></tr><tr><td>60</td><td>1300</td></tr><tr><td>70</td><td>1000</td></tr><tr><td>82</td><td>690</td></tr></tbody></table>\n\n[ARTICLE:7.2.5.9:Plastic Pipe, Fittings and Solvent Cement Used Underground]\n\n(See Note A-7.2.5.9. to 7.2.5.11.)\n(1) Plastic pipe, fittings and solvent cement used underground outside a building or under a building in a drainage system shall conform to\n(a) ASTM F628, \"Standard Specification for Acrylonitrile-Butadiene-Styrene (ABS) Schedule 40 Plastic Drain, Waste, and Vent Pipe With a Cellular Core,\"\n(b) CSA B181.1, \"Acrylonitrile-butadiene-styrene (ABS) drain, waste, and vent pipe and pipe fittings,\"\n(c) CSA B181.2, \"Polyvinylchloride (PVC) and chlorinated polyvinylchloride (CPVC) drain, waste, and vent pipe and pipe fittings,\"\n(d) CSA B182.1, \"Plastic drain and sewer pipe and pipe fittings,\"\n(e) CSA B182.2, \"PSM type polyvinylchloride (PVC) sewer pipe and fittings,\"\n(f) CSA B182.4, \"Profile polyvinylchloride (PVC) sewer pipe and fittings,\"\n(g) CSA B182.6, \"Profile polyethylene (PE) sewer pipe and fittingsfor leak-proof sewer applications,\" or\n(h) CSA B182.8, \"Profile polyethylene (PE) storm sewer and drainage pipe and fittings,\" for Type 1 joints and nonperforated pipes,\"\n(i) CSA B137.2, \"Polyvinylchloride (PVC) injection-moulded gasketed fittings for pressure applications\", or\n(j) CSA B137.3, \"Rigid polyvinylchloride (PVC) pipe and fittings for pressure applications\".\n(2) Except as permitted in Clauses (i) and (j), plastic pipe used as described in Sentence (1) shall have a stiffness equal or greater than 320 kPa.\n\n[ARTICLE:7.2.5.10:Transition Solvent Cement]\n(1) Solvent cement for transition joints shall conform to\n(a) CSA B181.1, \"Acrylonitrile-butadiene-styrene (ABS) drain, waste, and vent pipe and pipe fittings,\" or\n(b) CSA B181.2, \"Polyvinylchloride (PVC) and chlorinated polyvinylchloride (CPVC) drain, waste, and vent pipe and pipe fittings.\"\n(2) Transition solvent cement shall only be used for joining an ABS drainage system to a PVC drainage system.\n\n[ARTICLE:7.2.5.11:Plastic Pipe, Fittings and Solvent Cement Used in Buildings]\n\n(See Note A-7.2.5.9. to 7.2.5.11)\n(1) Plastic pipe, fittings and solvent cement used inside or under a building in a sanitary drainage system or venting system shall conform to\n(a) ASTM F628, \"Standard Specification for Acrylonitrile-Butadiene-Styrene (ABS) Schedule 40 Plastic Drain, Waste, and Vent Pipe With a Cellular Core,\"\n(b) CSA B181.1, \"Acrylonitrile-butadiene-styrene (ABS) drain, waste, and vent pipe and pipe fittings,\" or\n(c) CSA B181.2, \"Polyvinylchloride (PVC) and chlorinated polyvinylchloride (CPVC) drain, waste, and vent pipe and pipe fittings.\"\n(1.1) Plastic pipe, fittings and solvent cement used inside a building in a storm drainage system shall conform to\n(a) ASTM F628, \"Standard Specification for Acrylonitrile-Butadiene-Styrene (ABS) Schedule 40 Plastic Drain, Waste, and Vent Pipe With a Cellular Core,\"\n(b) CSA B181.1, \"Acrylonitrile-butadiene-styrene (ABS) drain, waste, and vent pipe and pipe fittings,\"\n(c) CSA B181.2, \"Polyvinylchloride (PVC) and chlorinated polyvinylchloride (CPVC) drain, waste, and vent pipe and pipe fittings,\"\n(d) CSA B182.1, \"Plastic drain and sewer pipe and pipe fittings,\" or\n(e) CSA B182.2, \"PSM type polyvinylchloride (PVC) sewer pipe and fittings.\"\n(1.2) Plastic pipe used as described in Sentence (2) shall have a pipe stiffness equal or greater than 320 kPa.\n(2) Requirements for combustible piping in relation to fire safety shall conform to Sentences 3.1.5.19.(1) and 9.10.9.8.(3), (5) and (6), and Articles 3.1.9.4., 9.10.9.7. and 9.10.9.9.\n(3) Where noncombustible piping pierces a fire separation or a fire block, the requirements for fire stopping of Subsection 3.1.9., Sentence 9.10.9.6.(1) and Article 9.10.16.4. shall apply.\n\n[ARTICLE:7.2.5.12:Polyethylene/Aluminum/Polyethylene Composite Pipe and Fittings]\n(1) PE/AL/PE composite pipe and fittings used for potable water systems shall conform to CSA B137.9, \"Polyethylene/aluminum/polyethylene (PE-AL-PE) composite pressure-pipe systems.\" (See Note A-7.2.5.12.(1))\n(2) Except as provided in Sentences (3) and (4), PE/AL/PE pipe and fittings shall not be used in hot water systems.\n(3) PE/AL/PE pipe with a pressure rating of 690 kPa or greater at 82ºC shall be permitted for hot water systems.\n\n(4) PE/AL/PE pipe with a pressure rating of 690 kPa or greater at 82°C shall be used with fittings that conform to CSA B137.10, \"Crosslinked polyethylene/aluminum/crosslinked polyethylene (PEX-AL-PEX) composite pressure-pipe systems,\" in hot water systems.\n\n[ARTICLE:7.2.5.13:Crosslinked Polyethylene/Aluminum/Crosslinked Polyethylene Composite Pressure Pipe and Fittings]\n\n(1) PEX/AL/PEX composite pipe and fittings used in hot and cold potable water systems shall conform to CSA B137.10, \"Crosslinked polyethylene/aluminum/crosslinked polyethylene (PEX-AL-PEX) composite pressure-pipe systems.\" (See Note A-7.2.5.13.(1))\n\n[ARTICLE:7.2.5.14:Polypropylene Pipe and Fittings]\n\n(1) Polypropylene pipe and fittings used for hot and cold potable water systems shall conform to CSA B137.11, \"Polypropylene (PP-R) pipe and fittings for pressure applications.\" (See Note A-7.2.5.14.(1))\n\n[ARTICLE:7.2.5.15:Polyethylene of Raised Temperature Tube and Fittings]\n(1) Polyethylene of raised temperature (PE-RT) tube and manufacturer-approved fittings used in hot and cold potable water systems shall conform to CSA B137.18, \"Polyethylene of raised temperature resistance (PE-RT) tubing systems for pressure applications.\" (See Note A-7.2.5.15.(1))\n(2) The use of PE-RT tube shall conform to Table 7.2.5.15.\n\n#### Table 7.2.5.15. Permitted Uses of Polyethylene of Raised Temperature (PE-RT) Tube Forming Part of Sentence 7.2.5.15.(2)\n\n<table class=\"obc-table\"><thead><tr><th></th><th></th><th>Plumbing Purposes ⁽¹⁾</th><th></th><th></th><th></th><th></th><th></th><th></th><th></th></tr></thead><tbody><tr><td>Type of</td><td>Drainag</td><td>Drainage System Venting System Potable Water System</td><td></td><td></td><td></td><td>1</td><td></td><td></td><td></td></tr><tr><td>Tube</td><td>Aboveground inside building</td><td>Underground under building</td><td>Building<br>Sewer</td><td>Above-<br>ground</td><td>Under-<br>ground</td><td>Cold</td><td>Hot</td><td>Under<br>building</td><td>Outside building</td></tr><tr><td>PE-RT</td><td>N</td><td>N</td><td>N</td><td>N</td><td>N</td><td>Р</td><td>Р</td><td>Р</td><td>Р</td></tr></tbody></table>\n\n<h5 class=\"table-notes-title\">Notes to Table 7.2.5.15.:</h5>\n- (1) P = permitted and N = not permitted.\n\n[ARTICLE:7.2.5.16:Cellular Core PVC Pipe and Fittings]\n(1) Cellular core PVC pipe shall\n(a) conform to ASTM F3128, \"Standard Specification for Poly(Vinyl Chloride) (PVC) Schedule 40 Drain, Waste, and Vent Pipe with a Cellular Core,\" and\n(b) be light grey, as specified in CSA B181.2, \"Polyvinylchloride (PVC) and chlorinated polyvinylchloride (CPVC) drain, waste, and vent pipe and pipe fittings.\"\n(2) Fittings and solvent cements for cellular core PVC pipe shall conform to CSA B181.2, \"Polyvinylchloride (PVC) and chlorinated polyvinylchloride (CPVC) drain, waste, and vent pipe and pipe fittings.\"\n(3) Cellular core PVC pipe shall only be used in residential buildings containing 1 or 2 dwelling units and in row houses that do not exceed 3 storeys in height."
        },
        {
          "id": "7.2.6",
          "title": "Ferrous Pipe and Fittings",
          "content": "[ARTICLE:7.2.6.1:Cast-Iron Drainage and Vent Pipe and Fittings]\n(1) Drainage piping, vent piping and fittings made of cast iron shall conform to CSA B70, \"Cast iron soil pipe, fittings, and means of joining.\"\n(2) Cast-iron soil pipe and fittings shall not be used in a water system.\n\n[ARTICLE:7.2.6.2:Maintenance Holes and Catch Basins]\n\n(1) Cast-iron frames and covers for maintenance holes and catch basins shall conform to CSA B70.1, \"Frames and Covers for Maintenance Holes and Catchbasins.\"\n\n[ARTICLE:7.2.6.3:Threaded Cast-Iron Drainage Fittings]\n(1) Threaded cast-iron drainage fittings shall conform to ASME B16.12, \"Cast Iron Threaded Drainage Fittings.\"\n(2) Threaded cast-iron drainage fittings shall not be used in a water system.\n\n[ARTICLE:7.2.6.4:Cast-Iron Water Pipes]\n(1) Cast-iron water pipes shall conform to ANSI/AWWA C151 / A21.51, \"Ductile-Iron Pipe, Centrifugally Cast.\"\n(2) Cement mortar lining for cast-iron water pipes shall conform to ANSI/AWWA C104 / A21.4, \"Cement-Mortar Lining for Ductile-Iron Pipe and Fittings.\"\n(3) Cast-iron fittings for cast-iron or ductile-iron water pipes shall conform to ANSI/AWWA C110 / A21.10, \"Ductile-Iron and Gray-Iron Fittings.\"\n(4) Rubber gasket joints for cast-iron and ductile-iron pressure pipe for water shall conform to ANSI/AWWA C111 / A21.11, \"Rubber-Gasket Joints for Ductile-Iron Pressure Pipe and Fittings.\"\n\n[ARTICLE:7.2.6.5:Screwed Cast-Iron Water Fittings]\n(1) Screwed cast-iron water fittings shall conform to ASME B16.4, \"Gray Iron Threaded Fittings: Classes 125 and 250.\"\n(2) Screwed cast-iron water fittings used in a water system shall be cement-mortar lined or galvanized.\n(3) Screwed cast iron water fittings shall not be used in a drainage system.\n\n[ARTICLE:7.2.6.6:Screwed Malleable-Iron Water Fittings]\n(1) Screwed malleable-iron water fittings shall conform to ASME B16.3, \"Malleable Iron Threaded Fittings: Classes 150 and 300.\"\n(2) Screwed malleable-iron water fittings used in a water system shall be cement-mortar lined or galvanized.\n(3) Screwed malleable-iron water fittings shall not be used in a drainage system.\n\n[ARTICLE:7.2.6.7:Steel Pipe]\n(1) Except as provided in Sentences (2) and (3), welded and seamless steel pipe shall not be used in a plumbing system.\n(2) Galvanized steel pipe is permitted to be used in a drainage system or a venting system above ground inside a building.\n(3) Galvanized steel pipe and fittings shall not be used in a water distribution system except\n(a) in buildings of industrial occupancy, or\n(b) for the repair of existing galvanized steel piping systems.\n\n(See Note A-7.2.6.7.(3))\n(4) Galvanized steel pipe and fittings shall conform to ASTM A53 / A53M, \"Standard Specification for Pipe, Steel, Black and Hot Dipped, Zinc-Coated Welded and Seamless.\"\n(5) Where galvanized steel pipe is used in a drainage system, it shall be used with drainage fittings.\n(6) All steel pipe of NPS 4 and smaller shall be Schedule 40 or heavier and fittings of less than NPS 2 shall be galvanized screw fittings.\n\n[ARTICLE:7.2.6.8:Corrugated Steel Pipe and Couplings]\n(1) Corrugated steel pipe and couplings shall conform to CAN/CSA-G401, \"Corrugated steel pipe products\".\n(2) Corrugated steel pipe shall only be used underground outside a building in a storm drainage system.\n(3) Couplings for corrugated steel pipe shall be constructed so that when installed they shall\n(a) maintain the pipe alignment,\n(b) resist the separation of adjoining lengths of pipe,\n(c) prevent root penetration, and\n(d) prevent the infiltration of surrounding material.\n\n[ARTICLE:7.2.6.9:Sheet Metal Leaders]\n\n(1) A sheet metal leader shall not be used except above ground outside a building.\n\n[ARTICLE:7.2.6.10:Stainless Steel Pipe]\n(1) Stainless steel pipe shall conform to\n(a) ASME B36.19M, \"Stainless Steel Pipe,\" and\n(b) ASTM A312 / A312M, \"Standard Specification for Seamless, Welded, and Heavily Cold Worked Stainless Steel Pipes.\"\n(2) Only grade 304/304L or 316/316L stainless steel pipe shall be used.\n\n[ARTICLE:7.2.6.11:Stainless Steel Butt Weld Pipe Fittings]\n(1) Stainless steel butt weld pipe fittings shall conform to\n(a) ASME B16.9, \"Factory-Made Wrought Buttwelding Fittings,\" and\n(b) ASTM A403 / A403M, \"Standard Specification for Wrought Austenitic Stainless Steel Piping Fittings\".\n(2) Stainless steel butt weld pipe fittings shall be made of a material that matches the grade of the pipe material used.\n\n[ARTICLE:7.2.6.12:Stainless Steel Pipe Flanges]\n(1) Stainless steel pipe flanges shall conform to ASME B16.5, \"Pipe Flanges and Flanged Fittings: NPS ½ through NPS 24 Metric/Inch Standard,\" and\n(a) ASTM A182 / A182M, \"Standard Specification for Forged or Rolled Alloy and Stainless Steel Pipe Flanges, Forged Fittings, and Valves and Parts for High-Temperature Service,\" or\n(c) ANSI/AWWA C228, \"Stainless-Steel Pipe Flanges For Water Service Sizes 2 in. through 72 in. (50 mm through 1,800 mm).\"\n(2) Stainless steel pipe flanges shall be made of a material that matches the grade of the pipe material used.\n\n[ARTICLE:7.2.6.13:Stainless Steel Threaded Fittings]\n(1) Stainless steel threaded fittings shall be Schedule 40 or greater conforming to\n(a) ASTM A182 / A182M, \"Standard Specification for Forged or Rolled Alloy and Stainless Steel Pipe Flanges, Forged Fittings, and Valves and Parts for High-Temperature Service,\" or\n(b) ASTM A351 / A351M, \"Standard Specification for Castings, Austenitic, for Pressure-Containing Parts.\"\n(2) Stainless steel threaded fittings shall be made of a material that matches the grade of the pipe material used.\n\n[ARTICLE:7.2.6.14:Stainless Steel Tube]\n(1) Stainless steel tube shall conform to\n(a) ASME B16.9, \"Factory-Made Wrought Buttwelding Fittings,\" and\n(b) ASTM A269, \"Standard Specification for Seamless and Welded Austenitic Stainless Steel Tubing for General Service.\"\n(2) Only grade 304/304L or 316/316L stainless steel tubes shall be used.\n\n[ARTICLE:7.2.6.15:Stainless Steel Pipe and Tube]\n\n(1) The use of stainless steel pipe and tube shall conform to Table 7.2.6.15.\n\n#### Table 7.2.6.15. Permitted Use of Stainless Steel Pipe and Tube Forming Part of Sentence 7.2.6.15.(1)\n\n<table class=\"obc-table\"><thead><tr><th></th><th></th><th>Plumbing Purposes(1)</th><th></th><th></th><th></th><th></th><th></th></tr></thead><tbody><tr><td>Stainless Steel Pipe<br>or Tube</td><td></td><td>Water Distribution System</td><td></td><td></td><td>Drainage System</td><td>Venting System</td><td></td></tr><tr><td></td><td>Underground</td><td>Aboveground</td><td>Building Sewer</td><td>Underground</td><td>Aboveground</td><td>Underground</td><td>Aboveground</td></tr><tr><td>Stainless steel pipe</td><td>P</td><td>P</td><td>P</td><td>P</td><td>P</td><td>P</td><td>P</td></tr><tr><td>Stainless steel tube</td><td>P</td><td>P</td><td>N</td><td>N</td><td>N</td><td>N</td><td>N</td></tr></tbody></table>\n\n<h5 class=\"table-notes-title\">Notes to Table 7.2.6.15.:</h5>\n- (1) P = Permitted and N = Not Permitted"
        },
        {
          "id": "7.2.7",
          "title": "Non-Ferrous Pipe and Fittings",
          "content": "[ARTICLE:7.2.7.1:Copper and Brass Pipe]\n(1) Copper pipe shall conform to\n(a) ASTM B42, \"Standard Specification for Seamless Copper Pipe, Standard Sizes,\" and\n(b) Table 7.2.7.4.\n(2) Brass pipe shall conform to ASTM B43, \"Standard Specification for Seamless Red Brass Pipe, Standard Sizes.\"\n\n[ARTICLE:7.2.7.2:Brass or Bronze Pipe Flanges and Flanged Fittings]\n\n(1) Brass or bronze pipe flanges and flanged fittings shall conform to ASME B16.24, \"Cast Copper Alloy Pipe Flanges, Flanged Fittings, and Valves: Classes 150, 300, 600, 900, 1500, and 2500.\"\n\n[ARTICLE:7.2.7.3:Brass or Bronze Threaded Water Fittings]\n(1) Brass or bronze threaded water fittings shall conform to ASME B16.15, \"Cast Copper Alloy Threaded Fittings: Classes 125 and 250.\"\n(2) Brass or bronze threaded water fittings shall not be used in a drainage system.\n\n[ARTICLE:7.2.7.4:Copper Tube]\n(1) Copper tube shall conform to,\n(a) ASTM B88, \"Standard Specification for Seamless Copper Water Tube,\" or\n(b) ASTM B306, \"Standard Specification for Copper Drainage Tube (DWV).\"\n(2) Except as provided in Sentence (3), the use of copper tube shall conform to Table 2.2.7.4.\n\n#### Table 7.2.7.4. Permitted Use of Copper Tube and Pipe Forming Part of Sentences 7.2.7.1.(1) and 7.2.7.4.(2)\n\n<table class=\"obc-table\"><thead><tr><th>Type of Copper Tube</th><th></th><th>Water Distribution System</th><th>Building</th><th></th><th>Drainage System</th><th></th><th>Venting System</th></tr></thead><tbody><tr><td>or Pipe</td><td>Underground</td><td>Above-ground</td><td>Sewer</td><td>Underground</td><td>Above-ground</td><td>Underground</td><td>Above-ground</td></tr><tr><td>K & L hard<br>temper</td><td>N</td><td>P</td><td>P</td><td>P</td><td>P</td><td>P</td><td>P</td></tr><tr><td>K & L soft<br>temper</td><td>P</td><td>P</td><td>N</td><td>N</td><td>N</td><td>N</td><td>N</td></tr><tr><td>M hard<br>temper</td><td>N</td><td>P</td><td>N</td><td>N</td><td>P</td><td>N</td><td>P</td></tr><tr><td>M soft<br>temper</td><td>N</td><td>N</td><td>N</td><td>N</td><td>N</td><td>N</td><td>N</td></tr><tr><td>DWV</td><td>N</td><td>N</td><td>N</td><td>N</td><td>P</td><td>N</td><td>P</td></tr></tbody></table>\n\n<h5 class=\"table-notes-title\">Notes to Table 7.2.7.4.:</h5>\n- (1) P = Permitted and N = Not Permitted.\n- (3) Copper tube shall not be used for the fixture drain or the portion of the vent pipe below the flood level rim of a urinal.\n- (4) Copper tube used in a plumbing appliance shall conform to\n(a) ASTM B88, \"Standard Specification for Seamless Copper Water Tube,\" or\n(b) ASTM B68 / B68M, \"Standard Specification for Seamless Copper Tube, Bright Annealed.\"\n- (5) Type K or L copper tube shall be used for the potable water side of a heat exchanger in a pre-engineered wastewater 5eat recovery system.\n\n[ARTICLE:7.2.7.5:Solder-Joint Drainage Fittings]\n(1) Solder-joint fittings for drainage systems shall conform to\n(a) ASME B16.23, \"Cast Copper Alloy Solder Joint Drainage Fittings: DWV,\" or\n(b) ASME B16.29, \"Wrought Copper and Wrought Copper Alloy Solder Joint Drainage Fittings DWV.\"\n(2) Solder-joint fittings for drainage systems shall not be used in a water system.\n\n[ARTICLE:7.2.7.6:Solder-Joint Water Fittings]\n(1) Except as provided in Sentence (2), solder-joint fittings for water systems shall conform to\n(a) ASME B16.18, \"Cast Copper Alloy Solder Joint Pressure Fittings,\" or\n(b) ASME B16.22, \"Wrought Copper and Copper Alloy Solder Joint Pressure Fittings\".\n(2) Solder-joint fittings for water systems not made by casting or the wrought process shall conform to the applicable requirements of ASME B16.18, \"Cast Copper Alloy Solder Joint Pressure Fittings.\"\n\n[ARTICLE:7.2.7.7:Flared-Joint Fittings for Copper Tube Water Systems]\n(1) Flared-joint fittings for copper tube water systems shall conform to ASME B16.26, \"Cast Copper Alloy Fittings for Flared Copper Tubes.\"\n(2) Flared-joint fittings for copper tube water systems not made by casting shall conform to the applicable requirements of ASME B16.26, \"Cast Copper Alloy Fittings for Flared Copper Tubes.\"\n\n[ARTICLE:7.2.7.8:Lead Waste Pipe and Fittings]\n(1) Lead waste pipe and fittings shall not be used in a water system or as a building sewer.\n(2) When there is a change in nominal pipe size (NPS) of a lead water closet bend, the change shall be in the vertical section of the bend or made in a manner that prevents the retention of liquid in the bend."
        },
        {
          "id": "7.2.8",
          "title": "Corrosion Resistant Materials",
          "content": "[ARTICLE:7.2.8.1:Pipe and Fittings]\n(1) Pipes and fittings to be used for drainage and venting of acid and corrosive wastes shall conform to\n(a) ASTM A518 / A518M, \"Standard Specification for Corrosion-Resistant High-Silicon Iron Castings,\"\n(b) ASTM C1053, \"Standard Specification for Borosilicate Glass Pipe and Fittings for Drain, Waste, and Vent (DWV) Applications,\" or\n(c) CSA B181.3, \"Polyolefin and polyvinylidene fluoride (PVDF) laboratory drainage systems.\""
        },
        {
          "id": "7.2.9",
          "title": "Jointing Materials",
          "content": "[ARTICLE:7.2.9.1:Cement Mortar]\n\n(1) Cement mortar shall not be used for jointing.\n\n[ARTICLE:7.2.9.2:Solder and Fluxes]\n(1) Solders for solder joint fittings shall conform to ASTM B32, \"Standard Specification for Solder Metal.\"\n(2) Solders and fluxes having a lead content in excess of 0.2% shall not be used in a potable water system.\n(3) Fluxes for soldered joints shall conform to ASTM B813, \"Standard Specification for Liquid and Paste Fluxes for Soldering of Copper and Copper Alloy Tube.\"\n(4) Brazing alloys shall conform to ANSI/AWS A5.8M / A5.8, \"Specification for Filler Metals for Brazing and Brazed Welding,\" BCuP range."
        },
        {
          "id": "7.2.10",
          "title": "Miscellaneous Materials",
          "content": "[ARTICLE:7.2.10.1:Floor Flanges]\n(1) Brass floor flanges shall conform to CSA B158.1, \"Cast Brass Solder Joint Drainage, Waste and Vent Fittings.\"\n(2) ABS floor flanges shall conform to CSA B181.1, \"Acrylonitrile-butadiene-styrene (ABS) drain, waste, and vent pipe and pipe fittings.\"\n(3) PVC floor flanges shall conform to CSA B181.2, \"Polyvinylchloride (PVC) and chlorinated polyvinylchloride (CPVC) drain, waste, and vent pipe and pipe fittings.\"\n(4) Cast iron, copper and aluminum floor flanges shall be suitable for the purpose.\n\n[ARTICLE:7.2.10.2:Screws, Bolts, Nuts and Washers]\n(1) Every screw, bolt, nut and washer shall be of corrosion-resistant materials when used\n(a) to connect a water closet to a floor flange,\n(b) to anchor the floor flange to the floor,\n(c) to anchor the water closet to the floor, or\n(d) to hold cleanout covers or floor drain grates.\n\n[ARTICLE:7.2.10.3:Cleanout Fittings]\n(1) Every plug, cap, nut or bolt that is intended to be removable from a ferrous fitting shall be of a non-ferrous material.\n(2) A cleanout fitting that as a result of normal maintenance operations cannot withstand the physical stresses of removal and reinstallation or cannot ensure a gas-tight seal shall not be installed.\n(3) A screw cap or test cap shall not be used as a cleanout plug or cover.\n\n[ARTICLE:7.2.10.4:Mechanical Couplings]\n(1) Groove- and shoulder-type mechanical pipe couplings shall conform to CSA B242, \"Groove- and Shoulder-Type Mechanical Pipe Couplings.\"\n(2) Mechanical couplings for DWV and Sewer Pipe shall conform to CSA B602, \"Mechanical Couplings for Drain, Waste, and Vent Pipe and Sewer Pipe.\"\n\n[ARTICLE:7.2.10.5:Saddle Hubs]\n(1) Except as provided in Sentence (2), a saddle hub or fitting shall not be installed in drainage, venting or water systems. (See Note A-7.2.10.5.(1))\n(2) A saddle hub or saddle clamp may be installed in a building drain or building sewer of nominal diameter not less than 8 in. and that is in service provided that the connecting branch is at least two pipe sizes smaller than the run of the building drain or building sewer to which it is connected.\n\n[ARTICLE:7.2.10.6:Valves, Supply and Waste Fittings]\n(1) Supply fittings shall conform to\n(a) ASME A112.18.1 / CSA B125.1, \"Plumbing Supply Fittings,\" or\n(b) CSA B125.3, \"Plumbing Fittings.\"\n(2) Except for lavatories in healthcare facilities, emergency eye washes, and emergency showers, supply fittings and individual shower heads shall have an integral means of limiting the maximum water flow rate to that specified in Table 7 .2.10.6. (See Note A-7.2.10.6.(2))\n#### Table 7.2.10.6. Water Flow Rates from Supply Fittings Forming Part of Sentence 2.2.10.6.(2)\n\n<table class=\"obc-table\"><thead><tr><th>Supply Fittings</th><th>Maximum Water Flow Rate, LPM</th></tr></thead><tbody><tr><td>Lavatory supply fittings</td><td></td></tr><tr><td>private</td><td>5.7</td></tr><tr><td>public</td><td>1.9</td></tr><tr><td>Kitchen supply fittings (except those in industrial, commercial or institutional<br>kitchens)</td><td>8.3</td></tr><tr><td>Shower heads</td><td>7.6</td></tr></tbody></table>\n(2.1) Sentence (2) does not apply to a fixture located in a heritage building.\n(3) Reserved.\n(4) Reserved.\n(5) Reserved.\n(6) Waste fittings shall conform to ASME A112.18.2 / CSA B125.2, \"Plumbing Waste Fittings.\"\n\n(7) Manually operated valves of NPS 4 or less for use in plumbing systems shall conform to ASME A112.4.14 / CSA B125.14, \"Manually Operated Valves for Use in Plumbing Systems.\" (See Note A-7.2.10.6.(7))\n\n[ARTICLE:7.2.10.7:Water Temperature Control]\n(1) Except as provided in Sentences [\\(2\\)](#page-619-0) and [\\(3\\),](#page-619-1) water supplied to shower heads or bathtubs shall be controlled by an automatic compensating valve conforming to\n(a) ASME A112.18.1 / CSA B125.1, \"Plumbing Supply Fittings,\" or\n(b) ASSE 1016 / ASME A112.1016 / CSA B125.16, \"Performance Requirements for Automatic Compensating Valves for Individual Showers and Tub/Shower Combinations.\"\n(2) The requirement in [Sentence \\(1\\)](#page-619-2) is permitted to be waived where hot water supplied only to bathtubs is controlled by\n(a) an automatic compensating valve conforming to CSA B125.3, \"Plumbing fittings,\" or\n(b) a temperature-limiting device conforming to ASSE 1070 / ASME A112.1070 / CSA B125.70, \"Performance requirements for water temperature limiting devices.\"\n(3) The requirement in [Sentence \\(1\\)](#page-619-2) is permitted to be waived where the water is supplied by a single tempered water line controlled by an automatic compensating valve conforming to CSA B125.3, \"Plumbing fittings.\"\n(4) Except as provided in [Sentences \\(5\\) and \\(6\\) and](#page-619-3) 7.2.10.7A.(1), the temperature of water discharging from a shower head or into a bathtub shall not exceed 49°C.\n(5) In healthcare facilities and retirement homes, the temperature of water discharging from a shower head or into a bathtub shall\n(a) not exceed 43°C, and\n(b) be adjusted at the shower or bathtub controls.\n(6) Sentence (4) does not apply to hot water supplied to installed dishwashers or clothes washers.\n\n[ARTICLE:7.2.10.7A:Temperature Control Devices]\n(1) A water distribution system supplying hot water to any bathtub, shower or hand basin that is accessible to a patient or resident in a Group B, Division 2 or 3 occupancy or a resident of a group home, home for special care or residence for adults with developmental disabilities, or children within child care facilities shall have one or more temperature gauges and control devices that are\n(a) accessible only to supervisory staff, and\n(b) capable of being adjusted to ensure that the temperature of the water supplied to the fixtures does not exceed 43°C.\n\n[ARTICLE:7.2.10.7B:Showers]\n(1) Except as provided for in Sentences (2) and (3), all valves supplying fixed location shower heads, shall be individually pressure-balanced or thermostatic-mixing valves, conforming to ASME A112.18.1 / CSA B125.1, \"Plumbing Supply Fittings.\"\n(2) An individually pressure-balanced or thermostatic-mixing valve is not required for shower heads having a single tempered water supply that is controlled by an automatic compensating valve conforming to CSA B125.3, \"Plumbing fittings.\"\n(3) Deck-mounted, hand-held, flexible-hose spray attachments are exempt from the thermal shock requirements of Sentences (1) and (4).\n(4) Pressure-balanced, thermostatic-mixing or combination pressure-balanced and thermostatic-mixing type valves shall be\n(a) capable of limiting thermal shock, and\n(b) designed so that the outlet temperature does not exceed 49°C or equipped with high-limit stops which shall be adjusted to a maximum hot water setting of 49°C.\n\n[ARTICLE:7.2.10.7C:Linings and Coatings of Water Storage Tanks]\n\n(1)  Linings and coatings of water storage tanks that come into contact with potable water and are not within a secondary suite or an individual dwelling unit shall conform to NSF/ANSI 61, \"Drinking Water System Components - Health Effects.\"\n\n[ARTICLE:7.2.10.8:Direct Flush Valves]\n(1) Every direct flush valve shall\n(a) open fully and close positively under service pressure,\n(b) complete their cycle of operation automatically,\n(c) be provided with a means of regulating the volume of water that they discharge, and\n(d) be provided with a vacuum breaker unless the fixture is designed so that back-siphonage cannot occur, and\n(e) conform to ASSE 1037 / ASME A112.1037 / CSA B125.37, \"Performance requirements for pressurized flushing devices for plumbing fixtures.\"\n\n[ARTICLE:7.2.10.9:Drinking Fountain Bubblers]\n(1) The orifice of drinking fountain bubblers shall\n(a) be of the shielded type, and\n(b) direct the water upward to an angle of approximately 45°.\n(2) Drinking fountain bubblers shall include a means of regulating the flow to the orifice.\n\n[ARTICLE:7.2.10.10:Back-Siphonage Preventers and Backflow Preventers]\n(1) Except as provided in Sentence (2), back-siphonage preventers and backflow preventers shall conform to\n(a) CSA B64.0, \"Definitions, general requirements and test methods for vacuum breakers and backflow preventers,\"\n(b) CSA B64.1.1, \"Atmospheric vacuum breakers (AVB),\"\n(c) CSA B64.1.2, \"Pressure vacuum breakers (PVB),\"\n(d) CSA B64.1.3, \"Spill-resistant pressure vacuum breakers (SRPVB),\"\n- (d.1) CSA B64.1.4, \"Vacuum breaker, air space type (ASVB),\"\n(e) CSA B64.2, \"Hose connection vacuum breakers (HCVB),\"\n(f) CSA B64.2.1, \"Hose connection vacuum breakers (HCVB) with manual draining feature,\"\n- (f.1) CSA B64.2.1.1, \"Hose connection dual check vacuum breakers (HCDVB),\"\n(g) CSA B64.2.2, \"Hose connection vacuum breakers (HCVB) with automatic draining feature,\"\n(h) CSA B64.3, \"Dual check valve backflow preventers with atmospheric port (DCAP),\"\n- (h.1) CSA B64.3.1, \"Dual check valve backflow preventers with atmospheric port for carbonators (DCAPC),\"\n(i) CSA B64.4, \"Reduced pressure principle (RP) backflow preventers,\"\n(j) CSA B64.5, \"Double check valve (DCVA) backflow preventers,\"\n(k) CSA B64.5.1, \"Double check valve backflow preventers for fire protection systems (DCVAF),\"\n(l) CSA B64.6, \"Dual check valve (DuC) backflow preventers,\"\n(m) CSA B64.6.1, \"Dual check valve backflow preventers for fire protection systems (DuCF),\"\n(n) CSA B64.7, \"Laboratory faucet vacuum breakers (LFVB),\"\n(o) CSA B64.8, \"Dual check valve backflow preventers with intermediate vent (DuCV),\"\n(p) CSA B64.9, \"Single check valve backflow preventers for fire protection systems (SCVAF),\" or\n(q) CSA B64.10, \"Selection and installation of backflow preventers.\"\n\n(2) Back-Back-siphonage preventers for tank-type water closets (anti-siphon fill valves) shall conform to ASSE 1002 / ASME A112.1002 / CSA B125.12, \"Anti-siphon fill valves for water closet tanks.\"\n\n[ARTICLE:7.2.10.11:Relief Valves]\n\n(1) Temperature-relief, pressure-relief, combined temperature- and pressure-relief and vacuum-relief valves shall conform to ANSI Z21.22 / CSA 4.4, \"Relief Valves for Hot Water Supply Systems.\"\n\n[ARTICLE:7.2.10.12:Reducing Valves]\n\n(1) Direct-acting water-pressure-reducing valves for domestic water supply systems shall conform to CAN/CSA-B356, \"Water pressure reducing valves for domestic water supply systems.\"\n\n[ARTICLE:7.2.10.13:Solar Domestic Hot Water]\n\n(1) Equipment for solar heating of potable water shall conform to CAN/CSA-F379 SERIES, \"Packaged solar domestic hot water systems (liquid-to-liquid heat transfer).\"\n\n[ARTICLE:7.2.10.14:Vent Pipe Flashing]\n(1) Flashing fabricated on-site for vent pipes shall be fabricated from\n(a) copper sheet not less than 0.33 mm thick,\n(b) aluminum sheet not less than 0.48 mm thick,\n(c) alloyed zinc sheet not less than 0.35 mm thick,\n(d) lead sheet not less than 1.73 mm thick,\n(e) galvanized steel sheet not less than 0.33 mm thick, or\n(f) polychloroprene (neoprene) not less than 2.89 mm thick.\n(2) Prefabricated flashing for vent pipes shall conform to CSA B272, \"Prefabricated Self-Sealing Roof Vent Flashings.\" (See Article 7.5.6.5. for location of vent pipe terminals.)\n\n[ARTICLE:7.2.10.15:Water Hammer Arresters]\n\n(1) Factory built water hammer arresters shall conform to ANSI/ASSE 1010, \"Water Hammer Arresters.\"\n\n[ARTICLE:7.2.10.16:Air Admittance Valves]\n\n(1) Air admittance valves shall conform to ASSE 1051, \"Individual and Branch Type Air Admittance Valves for Sanitary Drainage Systems.\" (See Note A-7.2.10.16.(1))\n\n[ARTICLE:7.2.10.17:Drinking Water Treatment Systems]\n\n(1) A drinking water treatment system or device shall conform to CAN/CSA-B483.1, \"Drinking Water Treatment Systems.\"\n\n[ARTICLE:7.2.10.18:Flexible Water Connectors]\n\n(1) Flexible water connectors exposed to continuous pressure shall conform to ASME A112.18.6 / CSA B125.6, \"Flexible water connectors.\""
        },
        {
          "id": "7.2.11",
          "title": "Water Service Pipes and Fire Service Mains",
          "content": "[ARTICLE:7.2.11.1:Design, Construction, Installation and Testing]\n\n(1) Except as provided in Articles 7.2.11.2. to 7.2.11.4., and 7.3.7.2, the design, construction, installation and testing of fire service mains and water service pipe combined with fire service mains shall be in conformance with NFPA 24, \"Installation of Private Fire Service Mains and Their Appurtenances.\"\n\n[ARTICLE:7.2.11.2:Certification or Conformance]\n\n(1) Water service pipes and fire service mains shall conform to the standards for the materials listed in Table 7.2.11.2.\n\n#### Table 7.2.11.2. Water Service Pipe and Fire Service Main Materials Forming Part of Sentence 7.2.11.2.(1)\n\n<table class=\"obc-table\"><thead><tr><th>Material</th><th>Standard</th><th>Limitations</th></tr></thead><tbody><tr><td>Polyethylene pipe and<br>fittings</td><td>Conform to Series 160 or a higher series of CSA<br>B137.1, \"Polyethylene (PE) Pipe, tubing and fittings for<br>cold water pressure services\"</td><td></td></tr><tr><td>Crosslinked polyethylene<br>pressure pipe or tube and<br>fittings</td><td>Conform to CSA<br>B137.5, \"Crosslinked polyethylene<br>(PEX) tubing systems for pressure applications\"</td><td></td></tr><tr><td>PVC pipe and fittings</td><td>Conform to CSA<br>B137.3, \"Rigid polyvinylchloride (PVC)<br>pipe and fittings for pressure applications\", or certified to<br>CSA<br>B137.2, \"Polyvinylchloride (PVC) injection-moulded<br>gasketed fittings for pressure applications\"</td><td>Pipe and fittings must have a rated working<br>pressure of 1 100 kPa or more</td></tr><tr><td>CPVC pipe and fittings</td><td>Conform to CSA<br>B137.6, \"Chlorinated polyvinylchloride<br>(CPVC) pipe, tubing and fittings for hot and cold water<br>distribution systems\"</td><td>The design temperature and pressure shall<br>conform to the requirements of the CSA<br>B137.6,<br>\"Chlorinated polyvinylchloride (CPVC) pipe,<br>tubing and fittings for hot and cold water<br>distribution systems\"</td></tr><tr><td>Cast-iron water pipe</td><td>Conform to ANSI/AWWA C151<br>/<br>A21.51, \"Ductile-Iron<br>Pipe, Centrifugally Cast\"</td><td>Pipe shall have a cement-mortar lining<br>conforming to ANSI/AWWA C104<br>/<br>A21.4,<br>\"Cement-Mortar Lining for Ductile-Iron Pipe and<br>Fittings\"</td></tr><tr><td>Iron fittings for cast-iron or<br>ductile-iron water pipes</td><td>Conform to ANSI/AWWA C110<br>/<br>A21.10, \"Ductile-Iron<br>and Gray-Iron Fittings\"</td><td>Pipe shall have a cement-mortar lining<br>conforming to ANSI/AWWA C104<br>/<br>A21.4,<br>\"Cement-Mortar Lining for Ductile-Iron Pipe and<br>Fittings\"</td></tr><tr><td>Rubber gasket joints for<br>cast-iron and ductile-iron<br>water pipes</td><td>Conform to ANSI/AWWA C111<br>/<br>A21.11, \"Rubber<br>Gasket Joints for Ductile-Iron Pressure Pipe and<br>Fittings\"</td><td></td></tr><tr><td>Screwed cast-iron water<br>fittings</td><td>Conform to ASME B16.4, \"Gray Iron Threaded Fittings:<br>Classes 125 and 250\"</td><td>Screwed cast-iron water fittings shall be<br>cement-mortar lined or galvanized</td></tr><tr><td>Type K soft copper tube</td><td>Certified to ASTM B88, \"Standard Specification for<br>Seamless Copper Water Tube\"</td><td></td></tr><tr><td>Solder-joint fittings for<br>copper water systems</td><td>Conform to ASME B16.18, \"Cast Copper Alloy Solder<br>Joint Pressure Fittings\", or conform to ASME B16.22,<br>\"Wrought Copper and Copper Alloy Solder-Joint<br>Pressure Fittings\"</td><td>Solder-joint fittings not made by casting or the<br>wrought process shall conform to the applicable<br>requirements of ASME B16.18, \"Cast Copper<br>Alloy Solder-Joint Pressure Fittings\"</td></tr><tr><td>Flared-joint fittings for<br>copper water systems</td><td>Conform to ASME B16.26, \"Cast Copper Alloy Fittings<br>for Flared Copper Tubes\"</td><td>Flared-joint fittings not made by casting shall<br>conform to ASME B16.26, \"Cast Copper Alloy<br>Fittings for Flared Copper Tubes\"</td></tr><tr><td>PE/AL/PE pipe and fittings</td><td>Conform to CSA<br>B137.9, \"Polyethylene/aluminum/<br>polyethylene (PE-AL-PE) composite pressure-pipe<br>systems\"</td><td></td></tr><tr><td>PEX/AL/PEX pipe and<br>fittings</td><td>Conform to CSA<br>B137.10, \"Crosslinked polyethylene/<br>aluminum/crosslinked polyethylene (PEX-AL-PEX)<br>composite pressure-pipe systems\"</td><td></td></tr></tbody></table>\n\n[ARTICLE:7.2.11.3:Tracer Wire]\n(1) Except as provided in Sentence (2), every non-metallic water service pipe or fire service main shall have attached to it\n(a) a 14 gauge TW solid copper light coloured plastic coated tracer wire, or\n(b) a 12 gauge copper clad steel light coloured plastic coated tracer wire.\n(2) Where a water service pipe or fire service main is detectable without the tracer wire referenced in Sentence (1), the tracer wire may be omitted.\n\n[ARTICLE:7.2.11.4:Required Check Valve]\n(1) Where a water service pipe is supplied with water by more than one drinking water system, a check valve shall be installed at each connection with a drinking water system.\n(2) Where a fire service main is supplied with water by more than one source, a check valve shall be installed at each connection with a source of water."
        }
      ]
    },
    {
      "id": "7.3",
      "title": "Piping",
      "subsections": [
        {
          "id": "7.3.1",
          "title": "Application",
          "content": "[ARTICLE:7.3.1.1:General]\n\n(1) This Section applies to the construction and use of joints and connections, and the arrangement, protection, support and testing of piping."
        },
        {
          "id": "7.3.2",
          "title": "Construction and Use of Joints",
          "content": "[ARTICLE:7.3.2.1:Caulked Lead Drainage Joints]\n(1) Caulked lead drainage joints shall not be used except for cast-iron pipe in a drainage system or venting system, or between such pipe and\n(a) other ferrous pipe,\n(b) brass and copper pipe,\n(c) a caulking ferrule, or\n(d) a trap standard.\n(2) Every caulked lead drainage joint shall be firmly packed with oakum and tightly caulked with lead to a depth of not less than 25 mm.\n(3) No paint, varnish or other coating shall be applied on the lead until after the joint has been tested.\n(4) A length of hub and spigot pipe and pipe fittings in a drainage system shall be installed with the hub at the upstream end.\n\n[ARTICLE:7.3.2.2:Wiped Joints]\n(1) Wiped joints shall not be used except for sheet lead or lead pipe, or between such pipe and copper pipe or a ferrule.\n(2) Every wiped joint in straight pipe shall\n(a) be made of solder,\n(b) have an exposed surface on each side of the joint at least 19 mm wide, and\n(c) be not less than 10 mm thick at the thickest part.\n(3) Every wiped flanged joint shall be reinforced with a lead flange that is not less than 19 mm wide.\n\n[ARTICLE:7.3.2.3:Screwed Joints]\n(1) In making a screwed joint, the ends of the pipe shall be reamed or filed out to the size of the bore and all chips and cuttings shall be removed.\n(2) No pipe-joint cement or paint shall be applied to the internal threads.\n\n[ARTICLE:7.3.2.4:Solder Joints]\n\n(1) Soldered joints shall be made in accordance with ASTM B828, \"Standard Specification for Making Capillary Joints by Soldering of Copper and Copper Alloy Tube and Fittings.\"\n\n[ARTICLE:7.3.2.5:Flared Joints]\n(1) In making a flared joint, the pipe shall be expanded with a proper flaring tool.\n(2) Flared joints shall not be used for hard (drawn) copper tube.\n\n[ARTICLE:7.3.2.6:Mechanical Joints]\n(1) Mechanical joints shall be made with compounded elastomeric couplings or rings that are held in compression by\n(a) stainless steel or cast-iron clamps, or\n(b) contained within a compression connection or groove- and shoulder-type mechanical couplings.\n(See Note A-7.3.2.6.(1))\n\n[ARTICLE:7.3.2.7:Cold-Caulked Joints]\n(1) Cold-caulked joints shall not be used except for bell and spigot pipe in a water system, a drainage system or a venting system.\n(2) The caulking compound used in cold-caulked joints shall be applied according to the manufacturer's directions.\n(3) Every cold-caulked joint in a drainage system shall be firmly packed with oakum and tightly caulked with cold caulking compound to a depth of not less than 25 mm.\n\n[ARTICLE:7.3.2.8:Stainless Steel Welded Joints]\n(1) Stainless steel welded joints shall conform to ASME B31.9, \"Building Services Piping.\"\n(2) Butt weld pipe fittings shall be at least as thick as the wall of the pipe used."
        },
        {
          "id": "7.3.3",
          "title": "Joints and Connections",
          "content": "[ARTICLE:7.3.3.1:Drilled and Tapped Joints]\n(1) Drilled and tapped joints shall not be made in a sanitary drainage pipe or vent pipe and fittings unless suitable provision has been made for drilling and tapping.\n(2) A copper water distributing pipe of NPS 1 or larger may be mechanically swaged to permit the joining of other copper pipe of equal size.\n(3) A drainage pipe or fitting may be drilled or tapped\n(a) to provide for the connection of a trap seal primer line,\n(b) to connect a device designed to dispense germicidal or odour control chemicals or trap seal water to a floor drain downstream of a vacuum breaker or flush valve in a flush tube connected to a sanitary unit,\n(c) to provide a hole for a branch connection to a drainage pipe, where the branch connection is made with a saddle hub as permitted by Article 7.2.10.5. and where the hole is drilled to provide a smooth clean hole of the required size and orientation, or\n(d) to provide for the connection of pipe or fittings to metal or rigid plastic pipe and fittings where the pipe or fittings are thick enough to be threaded or are bossed for tapping.\n(4) No pipe adaption shall be made by the use of a bushing that leaves a square edge or shoulder on the inside of the pipe or fitting.\n\n[ARTICLE:7.3.3.2:Extracted Tees]\n(1) Tees may be extracted from the wall thickness of Types K and L copper tube used in a water distribution system, provided that\n(a) a tool specifically designed for the purpose is used,\n(b) the branch is at least one NPS smaller than the tube in which the tee is formed,\n(c) the end of the branch incorporates a means to prevent it from penetrating into the run and thereby obstructing flow, and\n(d) the joint at the tee is brazed with a filler metal having a melting point not below 540°C.\n\n[ARTICLE:7.3.3.3:Prohibition of Welding of Pipes and Fittings]\n(1) Cast-iron soil pipe and fittings shall not be welded.\n(2) Galvanized steel pipe and fittings shall not be welded.\n\n[ARTICLE:7.3.3.4:Unions and Slip Joints and (3))]\n(1) Except as provided in Sentence 7.4.6.3.(6), running thread and packing nut connections and unions with a gasket seal shall not be used downstream of a trap weir in a drainage system or in a venting system.\n(2) Slip joints shall not be used\n(a) in a venting system, or\n(b) in a drainage system, except to connect a fixture trap to a fixture drain in an accessible location.\n\n[ARTICLE:7.3.3.5:Increaser or Reducer]\n\n(1) Connections between 2 pipes of different nominal pipe sizes shall be made with an increaser or a reducer fitting installed so that it permits the system to be completely drained.\n\n[ARTICLE:7.3.3.6:Dissimilar Materials]\n\n(1) Adapters, connectors or mechanical joints used to join dissimilar materials shall be designed to accommodate the required transition.\n\n[ARTICLE:7.3.3.7:Connection of Roof Drain to Leader]\n\n(1) Roof drains shall be securely connected to a leader and provision shall be made for expansion.\n\n[ARTICLE:7.3.3.8:Connection of Floor or Wall Outlet Fixtures]\n(1) Pedestal urinals, floor-mounted water closets or S-trap standards shall be connected to a fixture drain by a floor flange or other means of connection, except that a cast-iron trap standard may be caulked to a cast-iron pipe.\n(2) Except as provided in Sentence (3), floor flanges shall be brass.\n(3) Where cast-iron or plastic pipe is used, a floor flange of the same material is permitted to be used.\n(4) Floor flanges and fixtures shall be securely set on a firm base and fastened to the floor or trap flange of the fixture.\n(5) Water-closet bowls shall be securely attached to the floor flange, floor or wall carrier.\n(6) Joints in a floor flange or between a fixture and the drainage system shall be sealed with a resilient, watertight and gas-tight seal.\n(7) Where a lead water-closet stub is used, the length of the stub below the floor flange shall be not less than 75 mm.\n\n[ARTICLE:7.3.3.9:Expansion and Contraction]\n\n(1) The design and installation of every piping system shall, where necessary, include means to accommodate expansion and contraction of the piping system caused by temperature change or building shrinkage. (See Note A-7.3.3.9.(1))\n\n[ARTICLE:7.3.3.10:Copper Tube]\n(1) Types M and DWV copper tube shall not be bent.\n(2) Bends in copper tubing of soft or bending temper shall be made with tools manufactured and sized for the purpose.\n\n[ARTICLE:7.3.3.11:Indirect Connections]\n(1) Where a fixture or device is indirectly connected, the connections shall be made by terminating the fixture drain above the flood level rim of a directly connected fixture to form an air break.\n(2) The size of the air break shall be not less than 25 mm.\n\n[ARTICLE:7.3.3.12:Copper Joints Used Underground]\n(1) Except as provided in Sentence (2), jointsin copper tubes installed underground shall be made with either flared or compression fittings, or be brazed using a brazing alloy within the American Welding Society's AWS-BCuP range.\n(2) Compression fittings shall not be used underground under a building."
        },
        {
          "id": "7.3.4",
          "title": "Support of Piping",
          "content": "[ARTICLE:7.3.4.1:Capability of Support]\n(1) Piping shall be provided with support that is capable of keeping the pipe in alignment and bearing the weight of the pipe and its contents.\n(2) Wall mounted fixtures shall be supported so that no strain is transmitted to the piping.\n(3) Every floor or wall mounted water closet bowl shall be securely attached to the floor or wall by means of a flange and shall be stable.\n\n[ARTICLE:7.3.4.2:Independence of Support]\n\n(1) Piping, fixtures, tanks or devices shall be supported independently of each other.\n\n[ARTICLE:7.3.4.3:Insulation of Support]\n(1) Where a hanger or support for copper tube or brass or copper pipe is of a material other than brass or copper, it shall be suitably separated and electrically insulated from the pipe or tube to prevent galvanic action.\n(2) Where a hanger or support for stainless steel pipe or tube is of a material other than stainless steel, it shall be suitably separated and electrically insulated from the pipe or tube.\n\n[ARTICLE:7.3.4.4:Support for Vertical Piping]\n(1) Except as provided in Sentence (2), vertical piping shall be supported at its base and at the floor level of alternate storeys by rests, each of which can bear the weight of pipe that is between it and the rest above it.\n(2) The maximum spacing of supports shall be 7.5 m.\n\n[ARTICLE:7.3.4.5:Support for Horizontal Piping]\n(1) Nominally horizontal piping that is inside a building shall be braced to prevent swaying and buckling and to control the effects of thrust.\n(2) Nominally horizontal piping shall be supported as stated in Table 2.3.4.5.\n(3) Where PVC, CPVC or ABS plastic pipe is installed,\n(a) the pipe shall be aligned without added strain on the piping,\n(b) the pipe shall not be bent or pulled into position after being welded or joined, and\n(c) hangers shall not compress, cut or abrade the pipe.\n(4) Where PEX, PE-RT, PP-R, PE/AL/PE or PEX/AL/PEX plastic pipe or tube is installed, hangers shall not compress, cut or abrade the pipe.\n(5) Where hangers are used to support nominally horizontal piping, the hangers shall be\n(a) supported by metal rods of not less than\n(i) 6 mm diam to support piping of NPS 2 or less,\n(ii) 8 mm diam to support piping of NPS 4 or less, and\n(iii) 13 mm diam to support piping over NPS 4, or\n(b) solid or perforated metal straps not less than\n(i) 0.6 mm thick and 12 mm wide to support piping of NPS 2 or less, and\n(ii) 0.8 mm thick and 18 mm wide to support piping of NPS 4 or less.\n(6) Where a hanger is attached to concrete or masonry, it shall be fastened by metal or expansion-type plugs that are inserted or built into the concrete or masonry.\n#### Table 7.3.4.5. Support for Nominally Horizontal Piping Forming Part of Sentence 7.3.4.5.(2)\n\n<table class=\"obc-table\"><thead><tr><th>Piping Material</th><th>Maximum Horizontal Spacing<br>of Supports, m</th><th>Additional Support Conditions</th></tr></thead><tbody><tr><td>ABS or PVC plastic pipe</td><td>1.2</td><td>At the end of branches<br>or fixture drains<br>and<br>at changes in direction and elevation</td></tr><tr><td>ABS or PVC plastic trap arm or fixture drain pipe > 1 m<br>long</td><td>n/a</td><td>As close as possible to the<br>trap</td></tr><tr><td>Cast-iron pipe</td><td>3.0</td><td>At or adjacent to each hub or joint</td></tr><tr><td>Cast-iron pipe with mechanical joints that is ≤ 300 mm<br>long between adjacent fittings</td><td>1.0</td><td>None</td></tr><tr><td>Copper tube or copper and brass pipe, hard temper</td><td></td><td></td></tr><tr><td>> NPS<br>• diameter<br>1<br>• diameter<br>≤ NPS<br>1</td><td>3.0<br>2.5</td><td>None</td></tr><tr><td>Copper tube, soft temper</td><td>2.5</td><td>None</td></tr><tr><td>CPVC pipe</td><td>1.0</td><td>None</td></tr><tr><td>Galvanized iron or steel pipe</td><td></td><td></td></tr><tr><td>• diameter ≥ NPS<br>6<br>• diameter<br>< NPS 6</td><td>3.75<br>2.5</td><td>None</td></tr><tr><td>Lead pipe</td><td>Throughout length of pipe</td><td>None</td></tr><tr><td>PE/AL/PE composite pipe</td><td>1.0</td><td>None</td></tr><tr><td>PEX/AL/PEX composite pipe</td><td>1.0</td><td>None</td></tr><tr><td>PEX plastic pipe</td><td>0.8</td><td>None</td></tr><tr><td>PE-RT tube</td><td>0.8</td><td>None</td></tr><tr><td>PP-R plastic pipe</td><td>1.0</td><td>At the end of branches<br>and at changes<br>in direction and elevation</td></tr><tr><td>Stainless steel pipe</td><td></td><td></td></tr><tr><td>• diameter<br>≥ NPS<br>1<br>• diameter < NPS<br>1</td><td>3.0<br>2.5</td><td>None</td></tr><tr><td>Stainless steel tube</td><td></td><td></td></tr><tr><td>• diameter<br>≥ NPS<br>1<br>• diameter < NPS<br>1</td><td>3.0<br>2.5</td><td>None</td></tr></tbody></table>\n\n[ARTICLE:7.3.4.6:Support for Underground Horizontal Piping]\n(1) Except as provided in Sentence (2), nominally horizontal piping that is underground shall be supported on a base that is firm and continuous under the whole of the pipe. (See Note A-7.3.4.6.(1))\n(2) Nominally horizontal piping installed underground that is not supported as described in Sentence (1) may be installed using hangers fixed to a foundation or structural slab provided that the hangers are capable of\n(a) keeping the pipe in alignment, and\n(b) supporting the weight of\n(i) the pipe,\n(ii) its contents, and\n(iii) the fill over the pipe.\n\n[ARTICLE:7.3.4.7:Support for Vent Pipe Above a Roof]\n\n(1) Where a vent pipe that may be subject to misalignment terminates above the surface of a roof, it shall be supported or braced. (See Article 7.5.6.5. for location of vent pipe terminals.)\n\n[ARTICLE:7.3.4.8:Compression Fittings]\n\n(1) No compression fitting connecting to plain end pipe or tube shall be used in a plumbing system unless the pipe or tube and fittings are sufficiently stayed, clamped, anchored or buttressed so as to prevent separation during normal service of the system allowing for surge pressures.\n\n[ARTICLE:7.3.4.9:Thrust Restraint of Water Service Pipes]\n(1) Pipe clamps and tie-rods, thrust blocks, locked mechanical or push-on joints, mechanical joints utilizing set screw retainer glands, or other suitable means of thrust restraint shall be provided at each change of direction of a water service pipe NPS 4 or more and at all tees, plugs, caps and bends.\n(2) Backing for underground water service pipes shall be placed\n(a) between undisturbed earth and the fitting to be restrained and shall be of sufficient bearing area to provide adequate resistance to the thrust to be encountered, and\n(b) so that the joints will be accessible for inspection and repair.\n(3) Concrete thrust blocks shall have a minimum compressive strength of not less than 10 MPa after 28 days.\n(4) Thrust blocks shall not be used to restrain vertical pipe."
        },
        {
          "id": "7.3.5",
          "title": "Protection of Piping",
          "content": "[ARTICLE:7.3.5.1:Protection of Piping]\n\n(1) Where piping is installed underground, the backfill shall be carefully placed and tamped to a height of 300 mm over the top of the pipe and shall be free of stones, boulders, cinders and frozen earth. (See Note A-7.3.5.1.(1))\n\n[ARTICLE:7.3.5.1A:Protection of Non-Metallic Pipe]\n\n(1) Where vitrified clay is located less than 600 mm below a basement floor and the floor is constructed of other than 75 mm or more of concrete, the pipe shall be protected by a 75 mm layer of concrete installed above the pipe.\n\n[ARTICLE:7.3.5.2:Isolation from Loads]\n\n(1) Where piping passes through or under a wall, it shall be installed so that the wall does not bear on the pipe.\n\n[ARTICLE:7.3.5.3:Protection Against Freezing]\n\n(1) Where piping may be exposed to freezing conditions, it shall be protected from the effects of freezing. (See Note A-7.3.5.3.(1))\n\n[ARTICLE:7.3.5.4:Protection from Mechanical Damage]\n\n(1) Plumbing, piping and equipment exposed to mechanical damage shall be protected.\n\n[ARTICLE:7.3.5.5:Protection from Condensation]\n\n(1) Piping used as an internal leader, which may be subject to condensation, shall be installed in a manner that limits the risk of damage to the building due to condensation.\n\n[ARTICLE:7.3.5.6:Spatial Separation]\n(1) Except as permitted in Sentences (2) and (3), a buried water service pipe shall be separated from the building drain, building sewer and a private sewage disposal system, by not less than 2 440 mm measured horizontally, of undisturbed or compacted earth.\n(2) The water service pipe may be closer than 2 440 mm or be placed in the same trench with the building drain or building sewer if,\n(a) the following conditions are met:\n(i) the bottom of the water service pipe at all points is at least 500 mm above the top of the building drain or building sewer, and\n(ii) when in a common trench with the building drain or building sewer, the water service pipe is placed on a shelf at one side of the common trench,\n(b) the water service pipe is constructed of a single run of pipe with no joints or fittings between the street line or source of supply on the property and the inside face of the building, or\n(c) the building drain or building sewer is constructed of piping which is pressure tested in accordance with Subsection 7.3.7. at 345 kPa.\n(3) A buried water service pipe may pass under a building drain or building sewer if,\n(a) a vertical separation of not less than 500 mm is provided between the invert of the building drain or building sewer and the crown of the water service pipe,\n(b) adequate structural support is provided for the building drain or building sewer to prevent excessive deflection of joints and settling, and\n(c) the length of the water service pipe is located so that there are no joints within 2 440 mm measured horizontally from the intersection with the building drain or building sewer.\n(4) A buried water service pipe shall be constructed of a single run of pipe with no joints or fittings between the street line or source of supply on the property and the inside face of the building if the water service pipe is less than 15 m from,\n(a) a private sewage disposal system, or\n(b) a source of pollution other than a private sewage disposal system."
        },
        {
          "id": "7.3.6",
          "title": "Testing of Drainage and Venting Systems",
          "content": "[ARTICLE:7.3.6.1:Tests and Inspection of Drainage or Venting Systems]\n(1) Except in the case of an external leader, after a section of drainage system or a venting system has been roughed in, and before any fixture is installed or piping is covered, a water or an air test shall be conducted.\n(2) After every fixture is installed and before any part of the drainage system or venting system is placed in operation, a final test shall be carried out when requested by the chief building official.\n(3) Where a prefabricated system is assembled off the building site in such a manner that it cannot be inspected and tested on site, off-site inspections and tests shall be conducted.\n(4) Where a prefabricated system is installed as part of a drainage system or venting system, all other plumbing work shall be tested and inspected and a final test shall be carried out on the complete system when requested.\n(5) A ball test shall be carried out on a sanitary building drain, sanitary building sewer, storm building drain and a storm building sewer buried underground.\n(6) A sewer lateral extension need not be tested and inspected if the sewer lateral extension was constructed, tested and inspected at the time of the installation of the public sewer.\n\n[ARTICLE:7.3.6.2:Tests of Pipes in Drainage Systems]\n\n(1) Pipes in a drainage system, except an external leader or fixture outlet pipe, shall be capable of withstanding without leakage a water pressure test, air pressure test and final test\n\n[ARTICLE:7.3.6.3:Tests of Venting Systems]\n\n(1) Venting systems shall be capable of withstanding without leakage a water pressure test, air test and final test.\n\n[ARTICLE:7.3.6.4:Water Pressure Tests]\n(1) A water pressure test shall consist in applying a water column of at least 3 m to all joints.\n(2) In making a water pressure test,\n(a) every opening except the highest shall be tightly closed with a testing plug or a screw cap, and\n(b) the system or the section shall be kept filled with water for 15 min.\n\n[ARTICLE:7.3.6.5:Air Pressure Tests]\n(1) Air pressure tests shall be conducted in accordance with the manufacturer's instructions for the piping materials, and,\n(a) air shall be forced into the system until a gauge pressure of 35 kPa is created, and\n(b) this pressure shall be maintained for at least 15 min without a drop in pressure.\n\n(See Note A-7.3.6.5.(1))\n\n[ARTICLE:7.3.6.6:Final Tests]\n(1) Where a final test is made,\n(a) every trap shall be filled with water,\n(b) the bottom of the system being tested shall terminate at the building trap, test plug or cap,\n(c) except as provided in Sentence (2), smoke from smoke-generating machines shall be forced into the system,\n(d) when the smoke appears from all roof terminals they shall be closed, and\n(e) a pressure equivalent to a 25 mm water column shall be maintained for 15 min without the addition of more smoke.\n(2) The smoke referred to in Clauses (1)(c) and (d) is permitted to be omitted provided the roof terminals are closed and the system is subjected to an air pressure equivalent to a 25 mm water column maintained for 15 min without the addition of more air.\n\n[ARTICLE:7.3.6.7:Ball Tests]\n(1) Where a ball test is made, a hard ball dense enough not to float shall be rolled through the pipe.\n(2) The diameter of the ball shall be not less than\n(a) 50 mm where the size of the pipe is NPS 3 or more, or\n(b) 25 mm where the size of the pipe is less than NPS 3."
        },
        {
          "id": "7.3.7",
          "title": "Testing of Potable Water Systems",
          "content": "[ARTICLE:7.3.7.1:Application of Tests]\n(1) After a section of a potable water system has been completed, and before it is placed in operation, a water pressure test or an air pressure test shall be conducted.\n(2) A pressure test may be applied to each section of the system or to the system as a whole.\n(3) Where a prefabricated system is assembled off the building site in such a manner that it cannot be inspected and tested on site, off-site inspections and pressure tests shall be conducted.\n(4) Where a prefabricated system is installed as part of a water system,\n(a) all other plumbing work shall be tested and inspected, and\n(b) the complete system shall be pressure tested when requested.\n\n[ARTICLE:7.3.7.2:Pressure Tests of Potable Water Systems]\n(1) Every potable water system shall be capable of\n(a) withstanding without leakage a water pressure that is at least 1 000 kPa for at least 1 h, or\n(b) withstanding for at least 2 h without a drop in pressure an air pressure that is at least 700 kPa.\n\n[ARTICLE:7.3.7.3:Water Pressure Tests]\n(1) Where a water pressure test is made, all air shall be expelled from the system before fixture control valves or faucets are closed.\n(2) Potable water shall be used to test a potable water system."
        }
      ]
    },
    {
      "id": "7.4",
      "title": "Drainage Systems",
      "subsections": [
        {
          "id": "7.4.1",
          "title": "Application",
          "content": "[ARTICLE:7.4.1.1:General]\n\n(1) This Section applies to sanitary drainage systems and storm drainage systems."
        },
        {
          "id": "7.4.2",
          "title": "Connections to Drainage Systems",
          "content": "[ARTICLE:7.4.2.1:Connections to Sanitary Drainage Systems]\n(1) Fixtures shall be directly connected to a sanitary drainage system, except that\n(a) drinking fountains are permitted to be\n(i) indirectly connected to a sanitary drainage system, or\n(ii) connected to a storm drainage system, provided that where the system is subject to backflow, a backwater valve is installed in the fountain fixture drain,\n(b) drainage pans on heating/cooling units are permitted to be connected to a storm drainage system, provided that where the system is subject to backflow, a backwater valve is installed,\n(c) a floor drain is permitted to be connected to a storm drainage system, provided it is located where it can receive only clear-water waste or storm water,\n(d) fixtures or appliances that discharge only clear water waste are permitted to be connected to a storm drainage system or be drained onto a roof, and,\n(e) the following devices shall be indirectly connected to a drainage system:\n(i) a device for the display, storage, preparation or processing of food or drink,\n(ii) a sterilizer,\n(iii) a device that uses water as a cooling or heating medium,\n(iv) a water operated device,\n(v) a water treatment device,\n(vi) a drain or overflow from a water system or a heating system.\n(2) The connection of a soil or waste pipe to a nominally horizontal soil or waste pipe or to a nominally horizontal offset in a soil or waste stack shall be respectively at least 1.5 m measured horizontally from the bottom of a soil or waste stack or from the bottom of the upper vertical section of the soil or waste stack that,\n(a) receives a discharge of 30 or more fixture units, or\n(b) receives a discharge from fixtures located on 2 or more storeys.\n(3) No other fixture shall be connected to a lead bend or stub that serves a water closet.\n(4) Where a change in direction of more than 45° occurs in a soil or waste pipe that serves more than one clothes washer, and in which pressure zones are created by detergent suds, no other soil or waste pipe shall be connected to it within a length less than\n(a) 40 times the nominal pipe size of the soil or waste pipe or 2.44 m maximum vertical, whichever is less, before changing direction, and\n(b) 10 times the nominal pipe size of the nominally horizontal soil or waste pipe after changing direction. (See Note A-7.4.2.1.(4))\n(5) Where a vent pipe is connected into a suds pressure zone referred to in Sentence (4), no other vent pipe shall be connected to that vent pipe within the height of the suds pressure zone. (See Note A-7.4.2.1.(4))\n\n[ARTICLE:7.4.2.2:Connection of Overflows from Rainwater Tanks]\n(1) Where an overflow from a rainwater tank is connected to a storm drainage system, it shall be connected by\n(a) an air break, or\n(b) a backwater valve installed on the storm drainage pipe before the connection to the storm building drain.\n\n[ARTICLE:7.4.2.3:Direct Connections]\n(1) Two or more fixture outlet pipes that serve outlets from a single fixture that is listed in Clause 7.4.2.1.(1)(d) may be directly connected to a branch that\n(a) has a nominal pipe size of not less than NPS 1¼, and\n(b) is terminated above the flood level rim of a directly connected fixture with a minimum diameter waste of 1½ in. to form an air break.\n(2) Fixture drains from fixtures that are listed in Subclauses 7.4.2.1.(1)(e)(i) and (ii) may be directly connected to a pipe that\n(a) is terminated to form an air break above the flood level rim of a fixture that is directly connected to a sanitary drainage system, and\n(b) is extended through the roof when fixtures that are on 3 or more storeys are connected to it.\n(3) Fixture drains from fixtures that are listed in Subclauses 7.4.2.1.(1)(d)(iii) to (vi) may be directly connected to a pipe that,\n(a) is terminated to form an air break above the flood level rim of a fixture that is directly connected to a storm drainage system, and\n(b) is extended through the roof when fixtures that are on 3 or more storeys are connected to it.\n(4) Every waste pipe carrying waste from a device for the display, storage, preparation or processing of food or drink shall be trapped and have a minimum diameter equal to the diameter of the drain outlet from the device."
        },
        {
          "id": "7.4.3",
          "title": "Location of Fixtures",
          "content": "[ARTICLE:7.4.3.1:Plumbing Fixtures]\n\n(1) Sanitary units, bathtubs and shower baths shall not be installed adjacent to wall and floor surfaces that are pervious to water.\n\n[ARTICLE:7.4.3.2:Restricted Locations of Indirect Connections and Traps]\n\n(1) Indirect connections or any trap that may overflow shall not be located in a crawl space or any other unfrequented area.\n\n[ARTICLE:7.4.3.3:Equipment Restrictions Upstream of Grease Interceptors]\n(1) Except as provided in Sentence (2), equipment discharging waste with organic solids shall not be located upstream of an interceptor. (See Note A-7.4.3.3.(1))\n(2) If a food scrap interceptor has been installed upstream of the grease interceptor, equipment discharging waste with organic solids may discharge through a grease interceptor.\n\n[ARTICLE:7.4.3.4:Fixtures Located in Chemical Storage Locations]\n\n(1) A floor drain or other fixture located in an oil transformer vault, a high voltage room or any room where flammable, dangerous or toxic chemicals are stored or handled shall not be connected to a drainage system.\n\n[ARTICLE:7.4.3.5:Macerating Toilet System]\n(1) A maceration toilet system shall only be installed\n(a) where no connection to a gravity sanitary drainage system is available, and\n(b) in accordance with the manufacturer's instructions.\n\n[ARTICLE:7.4.3.6:Drains Serving Elevator Pits]\n\n(1) If a floor drain is provided in an elevator pit, it shall be installed in accordance with Section 2.2. of ASME A17.1 / CSA B44, \"Safety Code for Elevators and Escalators.\""
        },
        {
          "id": "7.4.4",
          "title": "Treatment of Sewage and Wastes",
          "content": "[ARTICLE:7.4.4.1:Sewage Treatment]\n\n(1) Where a fixture or equipment discharges sewage or waste that may damage or impair the sanitary drainage system or the functioning of a sanitary sewage works or sanitary sewage system, provision shall be made for treatment of the sewage or waste before it is discharged to the sanitary drainage system.\n\n[ARTICLE:7.4.4.2:Cooling of Hot Water or Sewage]\n\n(1) Where a fixture discharges sewage or clear-water waste that has been heated, the drainage system shall be suitable for the temperature of the sewage or clear-water waste being discharged. (See Note A-7.4.4.2.(1))\n\n[ARTICLE:7.4.4.3:Interceptors]\n(1) Except for suites of residential occupancy, where a fixture discharges sewage that includes fats, oils or grease and is located in an area where food is cooked, processed or prepared, it shall discharge through a grease interceptor. (See Note A-7.4.4.3.(1))\n(2) Except as provided in Sentence (3), oil interceptors shall be provided as follows:\n(a) service stations, repair shops and garages or any establishment where motor vehicles are repaired, lubricated or maintained shall be provided with an oil interceptor, and\n(b) establishments which use oily or flammable liquids or have such wastes as a result of an industrial process shall be provided with an engineered oil interceptor.\n(2.1) Oil interceptors are not required for a drain in a hydraulic elevator pit, parking lot, car wash or a garage used exclusively as a motor vehicle parking area.\n(3) Where a fixture discharges sand, grit or similar materials, an interceptor designed for the purpose of trapping such discharges shall be installed.\n(4) Interceptors shall have sufficient capacity to perform the service for which it is provided.\n(5) An on-site constructed interceptor shall be constructed to the requirements of a manufactured interceptor.\n(6) A grease interceptor shall be located as close as possible to the fixture or fixtures it serves.\n\n(7) The flow rate through a grease interceptor shall not exceed its rated capacity and the flow rate shall be determined using the following:\n\n$$Q = \\left(\\sum_{1}^{N} \\left(0.75 \\frac{V}{DDT}\\right)\\right) + PD$$\n\nwhere,\n- Q = the flow rate to a grease interceptor in L/s.\n\n- V = the volume of the fixture in L.\n\n- DDT = the drain down time, 60 or 120 seconds.\n\n- PD = any pump discharge in L/s.\n\n- N = the number of fixtures to go through the interceptor.\n(8) All grease and oil interceptors shall have an internal flow control and, where the head will exceed five feet, a secondary flow control shall be required.\n(9) Floor drains that conform to Sentence 7.4.5.1.(3) are not required to be separately trapped and vented, and may be gang trapped when discharging through an oil interceptor.\n\n[ARTICLE:7.4.4.4:Neutralizing and Dilution Tanks]\n(1) Where a fixture or equipment discharges corrosive or acid waste, it shall discharge into a neutralizing or dilution tank that is connected to the sanitary drainage system through\n(a) a trap, or\n(b) an indirect connection.\n\n(See Note A-7.4.4.(1))\n\n(2) Neutralizing or dilution tanks shall have a method for neutralizing the liquid."
        },
        {
          "id": "7.4.5",
          "title": "Traps",
          "content": "[ARTICLE:7.4.5.1:Traps for Sanitary Drainage Systems]\n(1) Except as provided in Sentences (2) to (5) and Article 7.4.5.2., fixtures shall be protected by a separate trap.\n(2) One trap is permitted to protect\n(a) all the trays or compartments of a 2- or 3- compartment sink,\n(b) a 2- or 3- compartment laundry tray, or\n(c) 2 similar type single compartment fixtures located in the same room.\n(3) One trap is permitted to serve a group of floor drains and hub drains, a group of shower drains, a group of washing machines or a group of laboratory sinks if the fixtures\n(a) are in the same room, and\n(b) are not located where they can receive food or other organic matter.\n(4) Reserved.\n(5) An interceptor with an effective water seal of not less than 38 mm is permitted to serve as a trap. (See Note A-7.4.5.1.(5))\n(6) Where a domestic dishwashing machine equipped with a drainage pump discharges through a direct connection into the fixture outlet pipe of an adjacent kitchen sink or disposal unit, the pump discharge line shall rise as high as possible to just under the counter and connect\n(a) on the inlet side of the sink trap by means of a Y fitting, or\n(b) to the disposal unit.\n\n[ARTICLE:7.4.5.2:Traps for Storm Drainage Systems]\n(1) Where a storm drainage system is connected to a combined building sewer or a public combined sewer, a trap shall be installed between any opening in the system and the drain or sewer, except that no trap is required if the opening is the upper end of a leader that terminates\n(a) at a roof that is used only for weather protection,\n(b) not less than 1 m above or not less than 3.5 m in any other direction from any air inlet, openable window or door, and\n(c) not less than 1.8 m from a property line.\n\n(See Note A-7.4.5.2.(1))\n(2) A floor drain that drains to a storm drainage system shall be protected by a trap that\n(a) is located between the floor drain and a leader, storm building drain or storm building sewer,\n(b) may serve all floor drains located in the same room, and\n(c) need not be protected by a vent pipe.\n\n[ARTICLE:7.4.5.3:Connection of Subsoil Drainage Pipe to a Sanitary Drainage System]\n(1) Where a subsoil drainage pipe is connected to a sanitary drainage system, the connection shall be made on the upstream side of a trap with a cleanout or a trapped sump.\n(2) Except as permitted in Sentence (3), no foundation drain or subsoil drainage pipe shall connect to a sanitary drainage system.\n(3) Where a storm drainage system is not available or soil conditions prevent drainage to a culvert or dry well, a foundation drain or subsoil drainage pipe may connect to a sanitary drainage system.\n\n[ARTICLE:7.4.5.4:Location and Cleanout for Building Traps]\n(1) Where a building trap is installed, it shall\n(a) be provided with a cleanout fitting on the upstream side of and directly over the trap,\n(b) be located upstream of the building cleanout, and\n(c) be located\n(i) inside the building as close as practical to the place where the building drain leaves the building, or\n(ii) outside the building in a manhole.\n\n[ARTICLE:7.4.5.5:Trap Seals]\n(1) Provision shall be made for maintaining the trap seal of a floor drain or a hub drain by\n(a) the use of a trap seal primer,\n(b) using the drain as a receptacle for an indirectly connected drinking fountain, or\n(c) other equally effective means.\n(2) Where a mechanical device is installed to furnish water to a trap, the pipe or tube conveying water from the device to the trap shall be at least ⅜ in. inside diameter."
        },
        {
          "id": "7.4.6",
          "title": "Arrangement of Drainage Piping",
          "content": "[ARTICLE:7.4.6.1:Separate Systems]\n(1) No vertical sanitary drainage pipe shall conduct both sanitary sewage and storm sewage.\n(2) Reserved.\n(3) There shall be no unused open ends in a drainage system and dead ends shall be so graded that water will not collect in them.\n\n[ARTICLE:7.4.6.2:Location of Sanitary Drainage Pipes]\n(1) A sanitary drainage pipe shall not be located directly above,\n(a) non-pressure potable water storage tanks,\n(b) manholes in pressure potable water storage tanks, or\n(c) food-handling or food-processing equipment.\n\n[ARTICLE:7.4.6.3:Sumps or Tanks]\n(1) Only piping that is too low to drain into a building sewer by gravity shall be drained to a sump or receiving tank.\n(2) Where the sump or tank receives sanitary sewage, it shall be water- and air-tight and shall be vented.\n(3) Where the sump or tank receives subsurface water from a subsoil drainage pipe, it shall be provided with a waterand air-tight cover.\n(4) Equipment such as a pump or ejector that can lift the contents of the sump or tank and discharge it into the sanitary building drain or sanitary building sewer shall be installed.\n(5) Where the equipment does not operate automatically, the capacity of the sump shall be sufficient to hold at least a 24 hour accumulation of liquid.\n(6) Where there is a building trap, the discharge pipe from the equipment shall be connected to the sanitary building drain downstream of the trap.\n(7) The discharge pipe from every pumped sump shall be equipped with a union, a backwater valve and a shut-off valve installed in that sequence in the direction of discharge.\n(8) The discharge piping from a pump or ejector shall be sized for optimum flow velocities at pump design conditions.\n(9) The discharge pipe from every pumped storm sewage sump shall be equipped with\n(a) a union and a check valve installed in that sequence in the direction of discharge and pumped to above grade level, or\n(b) a union, a check valve and a shut-off valve installed in that sequence in the direction of discharge.\n\n[ARTICLE:7.4.6.4:Protection from Backflow]\n\n(1) Except as permitted in Sentence (2), a backwater valve that would prevent free circulation of air shall not be installed in a building drain or in a building sewer.\n(2) A backwater valvemay be installed in a building drainprovided that,\n(a) it is a \"normally open\" design conforming to,\n(i) CAN/CSA-B70, \"Cast Iron Soil Pipe, Fittings, and Means of Joining\",\n(ii) CAN/CSA-B181.1, \"Acrylonitrile-Butadiene-Styrene (ABS) Drain, Waste, and Vent Pipe and Pipe Fittings\",\n(iii) CAN/CSA-B181.2, \"Polyvinylchloride (PVC) and Chlorinated Polyvinylchloride (CPVC) Drain, Waste, and Vent Pipe and Pipe Fittings\", or\n(iv) CAN/CSA-B182.1, \"Plastic Drain and Sewer Pipe and Pipe Fittings\", and\n(b) it does not serve more than one dwelling unit.\n(3) Except as provided in Sentences (4) and (5), where a building drain or a branch may be subject to backflow,\n(a) a backwater valve shall be installed on every fixture drain connected to it when the fixture is located below the level of the adjoining street, or\n(b) a backwater valve shall be installed to protect fixtures which are below the upstream sanitary manhole cover when a residential building is served by a public sanitary sewer.\n(4) Where more than one fixture is located on a storey and all are connected to the same branch, the backwater valve may be installed on the branch.\n(5) A subsoil drainage pipe that drains into a sanitary drainage system that is subject to surcharge shall be connected in such a manner that sewage cannot back up into the subsoil drainage pipe.\n\n[ARTICLE:7.4.6.5:Mobile Home Sewer Service]\n(1) A building sewer intended to serve a mobile home shall be\n(a) not less than NPS 4,\n(b) terminated above ground,\n(c) provided with\n(i) a tamperproof terminal connection that is capable of being repeatedly connected, disconnected and sealed,\n(ii) a protective concrete pad, and\n(iii) a means to protect it from frost heave, and\n(d) designed and constructed in accordance with good engineering practice.\n\n[ARTICLE:7.4.6.6:Building Drain Ends]\n\n(1) Where a building drain enters a building above the elevation of the bottom of the wall of a building, the building drain may be deemed to terminate at the first point that the drainage pipe changes direction from the horizontal to the vertical."
        },
        {
          "id": "7.4.7",
          "title": "Cleanouts",
          "content": "[ARTICLE:7.4.7.1:Cleanouts for Drainage Systems]\n(1) Sanitary drainage systems and storm drainage systems shall be provided with cleanouts that will permit cleaning of the entire system. (See Note A-7.4.7.1.(1))\n(2) A cleanout fitting shall be provided on the upstream side and directly over every running trap.\n(3) Interior leaders shall be provided with a cleanout fitting at the bottom of the leader or not more than 1 m upstream from the bottom of the leader.\n(4) Where a cleanout is required on a building sewer of NPS 8 or larger, it shall be a manhole.\n(5) A building sewer shall not change direction or slope between the building and public sewer or between cleanouts, except that pipes not more than NPS 6 may change direction\n(a) by not more than 5° every 3 m, or\n(b) by the use of fittings with a cumulative change in direction of not more than 45°.\n(6) Building drains shall be provided with a cleanout fitting of NPS 4 or larger that is located as close as practical to the place where the building drain leaves the building. (See Note A-7.4.7.1.(6))\n(7) Stacks shall be provided with a cleanout fitting\n(a) at the bottom of the stack,\n(b) not more than 3 m upstream of the bottom of the stack, or\n(c) on a Y fitting connecting the stack to the building drain or branch.\n(8) A cleanout shall be provided to permit the cleaning of the piping immediately downstream of an interceptor.\n(9) Every indirect drainage pipe carrying waste from a food receptacle shall have a cleanout access at every change of direction of more than 45°.\n(10) A cleanout shall be installed on a trap arm serving a kitchen sink as close as practical to the trap outlet and shall be readily accessible.\n\n[ARTICLE:7.4.7.2:Size and Spacing of Cleanouts]\n\n(1) Except as provided in Sentences [\\(2\\),](#page-641-0) (3) and [7.4.7.1.\\(6\\),](#page-641-1) the nominal pipe size and spacing of cleanouts in nominally horizontal pipes of a drainage system shall conform to Table 7.4.7.2.\n#### Table 7.4.7.2. Permitted Size and Spacing of Cleanouts Forming Part of Sentence 7.4.7.2.(1)\n\n<table class=\"obc-table\"><thead><tr><th>Nominal Pipe Size<br>of</th><th>Minimum Nominal Pipe Size<br>of</th><th>Maximum Spacing, m</th><th></th></tr></thead><tbody><tr><td>Drainage Pipe, NPS</td><td>Cleanout, NPS</td><td>One-Way Rodding</td><td>Two-Way Rodding</td></tr><tr><td>less than 3</td><td>Same NPS<br>as drainage pipe</td><td>7.5</td><td>15</td></tr><tr><td>3 and 4</td><td>3</td><td>15</td><td>30</td></tr><tr><td>over 4</td><td>4</td><td>26</td><td>52</td></tr></tbody></table>\n(2) The spacing between manholes serving a building sewer\n(a) of NPS 24 or less shall not exceed 90 m, and\n(b) over NPS 24 shall not exceed 150 m.\n(3) The developed length of a building sewer between the building and the first manhole to which the building sewer connects shall not exceed 75 m.\n(4) Where a building sewer connects to another building sewer other than by a manhole, the developed length between the building and the building sewer to which it connects shall not exceed 30 m.\n(5) Cleanouts that allow rodding in one direction only shall be installed to permit rodding in the direction of flow.\n(6) Manholes shall be located at all junctions and all changes in grade, size or alignment (except for curvilinear alignment) on a sanitary building sewer that is NPS 8 or larger.\n\n(7) Manholes shall be located at changes of grade, size or alignment (except for curvilinear alignment) on a storm building sewer or exterior storm drainage pipe that is NPS 8 or larger.\n\n[ARTICLE:7.4.7.3:Manholes]\n(1) A manhole, including the cover shall be designed to support all loads imposed upon it.\n(2) A manhole shall be provided with\n(a) a cover that provides an airtight seal if located within a building,\n(b) a rigid ladder of a corrosion-resistant material where the depth exceeds 1 m, and\n(c) a vent to the exterior if the manhole is located within a building.\n(3) A manhole shall have a minimum horizontal dimension of 1.2 m, except that the top 1.5 m may be tapered from 1.2 m down to a minimum of 600 mm at the top.\n(4) A manhole in a sanitary drainage system shall be channeled to direct the flow of effluent.\n\n[ARTICLE:7.4.7.4:Location of Cleanouts]\n(1) Cleanouts and access covers shall be located so that their openings are readily accessible for drain cleaning purposes.\n(2) A cleanout shall not be\n(a) located in a floor assembly in a manner that may constitute a hazard, and\n(b) used as a floor drain.\n(3) Reserved.\n(4) Each change of direction of the piping between a cleanout fitting and the drainage piping or vent piping that it serves shall be accomplished by using 45 bends.\n(4.1) A cleanout shall be provided to serve vertical drainage piping from a wall hung urinal and shall extend above the flood level rim of the fixture.\n(5) Cleanouts serving fixture drains in healthcare facilities, mortuaries, laboratories and similar occupancies, where contamination by hazardous waste is likely, shall be located a minimum of 150 mm above the flood level rim of the fixture."
        },
        {
          "id": "7.4.8",
          "title": "Minimum Slope and Length of Drainage Pipes",
          "content": "[ARTICLE:7.4.8.1:Minimum Slope]\n(1) Except as provided in Sentences (2) and (3) and Articles 7.4.10.8. and 7.4.10.9., drainage pipes that are NPS 3 or less shall have a downward slope in the direction of flow of at least 1 in 50. (See Note A-7.4.8.1.(1))\n(2) Sentence (1) does not apply to a force main.\n(3) Where it is not possible to comply with Sentence (1), a lesser slope may be used if it will produce a gravity flow of not less than 0.6 m per second.\n\n[ARTICLE:7.4.8.2:Length of Fixture Outlet Pipes]\n\n(1) Except for fixture outlet pipes installed in conformance with Sentence 7.4.5.1.(3), the developed length of fixture outlet pipes shall not exceed 1 200 mm."
        },
        {
          "id": "7.4.9",
          "title": "Size of Drainage Pipes",
          "content": "[ARTICLE:7.4.9.1:No Reduction in Size]\n(1) Except as permitted in Sentence (3), no drainage pipe that is of minimum size required by this Part for the purpose for which it is installed shall be so connected as to drain to other drainage pipe of lesser size.\n(2) Where a building drain connects to a stack through a wall or floor, the drain shall retain its full size through the wall or floor.\n(3) A sanitary drainage pipe may be connected to a pre-engineered waste water heat recovery system that incorporates piping of a lesser size than required by Sentence (1) provided that it does not convey sewage\n(a) from a sanitary unit, or\n(b) that contains solids.\n\n[ARTICLE:7.4.9.2:Serving Water Closets]\n(1) Drainage pipes that serve a water closet shall be not less than NPS 3.\n(2) Branch and building drains downstream of the third water-closet fixture drain connection shall be not less than NPS 4.\n(3) Stacks that serve more than 6 water closets shall be not less than NPS 4.\n(4) Discharge pipes serving a macerating toilet system shall be not less than NPS ¾.\n(5) No vertical leg of the drainage pipe from a water closet or other fixture that has an integral siphonic flushing action shall exceed 1 000 mm.\n\n[ARTICLE:7.4.9.3:Size of Fixture Outlet Pipes]\n(1) Except as provided in Sentence (2), the nominal pipe size of fixture outlet pipes shall conform to Table 7.4.9.3.\n(2) The part of the fixture outlet pipe that is common to 3 compartments of a sink shall be one NPS larger than the largest fixture outlet pipe of the compartments that it serves. (See Note A-7.4.9.3.(2))\n(3) Where clothes washers do not drain to a laundry tray, the trap inlet shall be not less than NPS 2 and be fitted with a vertical standpipe that is not less than 600 mm long measured from the trap weir and terminates above the flood level rim of the clothes washer. (See Note A-7.4.9.3.)\n(4) In an individual dwelling unit, where multiple shower heads are served by one shower receptacle, the fixture outlet pipe shall be not less than NPS 2.\n#### Table 7.4.9.3. Minimum Permitted Size of Fixture Outlet Pipe and Hydraulic Loads for Fixtures(1) Forming Part of Sentences 7.4.9.3.(1) and 7.4.10.2.(1)\n\n<table class=\"obc-table\"><thead><tr><th>Fixture</th><th>Minimum<br>Nominal Pipe Size<br>of<br>Fixture Outlet Pipe,<br>NPS</th><th>Hydraulic Load, fixture units</th></tr></thead><tbody><tr><td>Autopsy table</td><td>1½</td><td>2</td></tr><tr><td>Bathroom group</td><td></td><td></td></tr><tr><td>(a)<br>with flush tank</td><td>n/a</td><td>6</td></tr><tr><td>(b)<br>with direct flush valve</td><td>n/a</td><td>8</td></tr><tr><td>Bathtub (with or without shower)</td><td>1½</td><td>1½</td></tr><tr><td>Bath: foot, sitz or slab</td><td>1½</td><td>1½</td></tr><tr><td>Beer cabinet</td><td>1½</td><td>1½</td></tr><tr><td>Bidet</td><td>1¼</td><td>1</td></tr><tr><td>Chinese range</td><td>1½</td><td>3</td></tr><tr><td>Clothes washer</td><td></td><td></td></tr><tr><td>(a)<br>domestic(1)</td><td>n/a</td><td>1½ with NPS<br>2 trap</td></tr><tr><td>(b)<br>commercial</td><td>n/a</td><td>2 with NPS<br>2 trap</td></tr><tr><td>Cup Sinks</td><td>1¼</td><td>½</td></tr><tr><td>Dental unit or cuspidor</td><td>1¼</td><td>1</td></tr><tr><td>Dishwasher</td><td></td><td></td></tr><tr><td>(a)<br>domestic<br>type</td><td>1½</td><td>1 (no load when<br>connected to<br>garbage grinder or domestic<br>sink)</td></tr><tr><td>(b)<br>commercial type</td><td>2</td><td>3</td></tr><tr><td>Drinking fountain</td><td>1¼</td><td>½</td></tr><tr><td>Fish tank or tray</td><td>1½</td><td>1½</td></tr><tr><td></td><td></td><td>2 with NPS<br>2 trap</td></tr><tr><td>Floor drain(2)</td><td>2</td><td>3 with NPS<br>3<br>trap</td></tr><tr><td>Garbage grinder, commercial type</td><td>2</td><td>3</td></tr><tr><td>Icebox</td><td>1¼</td><td>1</td></tr><tr><td>Laundry tray</td><td></td><td></td></tr><tr><td>(a)<br>single or double units or 2 single units with common trap</td><td>1½</td><td>1½</td></tr><tr><td>(b)<br>compartments</td><td>1½</td><td>2</td></tr><tr><td>Lavatory</td><td></td><td></td></tr><tr><td>(a)<br>barber or beauty parlor</td><td>1½</td><td>1½</td></tr><tr><td>(b)<br>dental</td><td>1¼</td><td>1</td></tr><tr><td>(c)<br>domestic type single, or 2 single with common trap</td><td>1¼</td><td>1 with<br>NPS<br>1¼<br>trap</td></tr><tr><td></td><td></td><td>1½ with NPS<br>1½ trap</td></tr><tr><td>(d)<br>multiple or industrial type</td><td>1½</td><td>According to Table 7.4.10.2.</td></tr><tr><td>Macerating Toilet System</td><td>¾</td><td>4</td></tr><tr><td>Potato Peeler</td><td>2</td><td>3</td></tr></tbody></table>\n\n#### Table 7.4.9.3. (Cont'd) Minimum Permitted Size of Fixture Outlet Pipe and Hydraulic Loads for Fixtures(1) Forming Part of Sentences 7.4.9.3.(1) and 7.4.10.2.(1)\n\n<table class=\"obc-table\"><thead><tr><th>Fixture</th><th>Minimum<br>Nominal Pipe Size<br>of<br>Fixture Outlet Pipe, NPS</th><th>Hydraulic Load, fixture units</th></tr></thead><tbody><tr><td>Shower drain</td><td></td><td></td></tr><tr><td>Total volume of discharge from all shower heads and body</td><td></td><td></td></tr><tr><td>sprays:</td><td></td><td></td></tr><tr><td>(a) from 1 head</td><td>1½</td><td>1½</td></tr><tr><td>(b) from 2 or 3 heads</td><td>2</td><td>3</td></tr><tr><td>(c) from 4 to 6 heads</td><td>3</td><td>6</td></tr><tr><td>Sink</td><td></td><td></td></tr><tr><td>(a)<br>domestic and other small types<br>with or without garbage<br>grinders, single, double or 2 single with a common trap</td><td>1½</td><td>1½</td></tr><tr><td></td><td></td><td>1½ with NPS<br>1½ trap</td></tr><tr><td>(b)<br>other sinks</td><td>1½</td><td>2 with NPS<br>2 trap</td></tr><tr><td></td><td></td><td>3 with NPS<br>3 trap</td></tr><tr><td>Urinal</td><td></td><td></td></tr><tr><td>(a)<br>pedestal, siphon jet or blowout type</td><td>2</td><td>4</td></tr><tr><td>(b)<br>stall, washout type</td><td>2</td><td>2</td></tr><tr><td>(c)<br>wall</td><td></td><td></td></tr><tr><td>(i)<br>washout type</td><td>1½</td><td>1½</td></tr><tr><td>(ii)<br>other types</td><td>2</td><td>3</td></tr><tr><td>Water closet</td><td></td><td></td></tr><tr><td>(a)<br>with flush tank</td><td>3</td><td>4</td></tr><tr><td>(b) with direct flush<br>valve</td><td>3</td><td>6</td></tr></tbody></table>\n\n<h5 class=\"table-notes-title\">Notes to Table 7.4.9.3.:</h5>\n- (1) See Note A-Table 7.4.9.3.\n- (2) No hydraulic load for emergency floor drains.\n\n[ARTICLE:7.4.9.4:Minimum Size of Building Drain and Sewer]\n(1) Building drains and building sewers connected to the public sewer system downstream of the main cleanout (see [Sentence 7.4.7.1.\\(6](#page-641-1))) shall be not less than NPS 4.\n(2) Storm building drains and storm building sewers shall be not less than NPS 4.\n\n[ARTICLE:7.4.9.5:Offset in Leaders]\n(1) No change in the nominal pipe size of a leader with a nominally horizontal offset is required if the offset\n(a) is located immediately under the roof,\n(b) is not more than 6 m long, and\n(c) has a slope of not less than 1 in 50.\n(2) If the horizontal offset is more than 6 m long, the leader shall conform to Table 7.4.10.9."
        },
        {
          "id": "7.4.10",
          "title": "Hydraulic Loads",
          "content": "[ARTICLE:7.4.10.1:Total Load on a Pipe]\n(1) The hydraulic load on a pipe is the total load from\n(a) every fixture that is connected to the system upstream of the pipe,\n(b) every fixture for which provision is made for future connection upstream of the pipe, and\n(c) all roofs and paved surfaces that drain into the system upstream of the pipe.\n\n[ARTICLE:7.4.10.2:Hydraulic Loads for Fixtures]\n(1) The hydraulic load from a fixture that is listed in Table 7.4.9.3. is the number of fixture units set forth in the Table.\n(2) Except as provided in Sentence (1), the hydraulic load from a fixture that is not listed in Table 7.4.9.3. is the number of fixture units set forth in Table 7.4.10.2. for the nominal pipe size of the trap that serves the fixture.\n#### Table 7.4.10.2. Permitted Hydraulic Load from a Fixture Based on Size of Trap Forming Part of Sentence 7.4.10.2.(2)\n\n<table class=\"obc-table\"><thead><tr><th>Nominal Pipe Size<br>of Trap, NPS</th><th>Hydraulic Load, fixture units</th></tr></thead><tbody><tr><td>1¼</td><td>1</td></tr><tr><td>1½</td><td>2</td></tr><tr><td>2</td><td>3</td></tr><tr><td>2½</td><td>4</td></tr><tr><td>3</td><td>5</td></tr><tr><td>4</td><td>6</td></tr></tbody></table>\n\n[ARTICLE:7.4.10.3:Hydraulic Loads from Fixtures with a Continuous Flow]\n(1) Except as provided in Sentence (2), the hydraulic load from a fixture that produces a continuous flow, such as a pump or an air-conditioning fixture, is 31.7 fixture units for each litre per second of flow.\n(2) Where a [fixture](bookmark://_bookmark64/) or equipment that produces a continuous or semi-continuous flow drains to a [combined sewer](bookmark://_bookmark51/) or to a [storm sewer](bookmark://_bookmark110/), the hydraulic load from the [fixture](bookmark://_bookmark64/) is 900 L for each litre per second of flow.\n\n[ARTICLE:7.4.10.4:Hydraulic Loads from Roofs or Paved Surfaces]\n(1) Except as provided in Sentence (2), the hydraulic load in litres from a roof or paved surface is the maximum 15 min rainfall determined in conformance with MMAH Supplementary Standard SB-1, \"Climatic and Seismic Data,\" multiplied by the sum of\n(a) the area in square metres of the horizontal projection of the surface drained, and\n(b) one-half the area in square metres of the largest adjoining vertical surface.\n\n(See Note A-7.4.10.4.(1))\n(2) Flow control roof drains may be installed, provided\n(a) the maximum drain down time does not exceed 24 h,\n(b) the roof structure is designed to carry the load of the stored water,\n(c) one or more scuppers are installed not more than 30 m apart along the perimeter of the building so that\n(i) up to 200% of the 15-minute rainfall intensity can be handled, and\n(ii) the maximum depth of controlled water is limited to 150 mm,\n(d) they are located not more than 15 m from the edge of the roof and not more than 30 m from adjacent drains, and\n(e) there is at least one drain for each 900 m²\n(3) Reserved.\n(4) Where the height of the parapet is more than 150 mm or exceeds the height of the adjacent wall flashing,\n(a) emergency roof overflows or scuppers described in Clause (2)(c) shall be provided, and\n\n.\n\n(b) there shall be a minimum of 2 roof drains.\n\n[ARTICLE:7.4.10.5:Conversion of Fixture Units to Litres and Gal/min]\n(1) Except as provided in Sentence 7.4.10.3.(2), where the hydraulic load is to be expressed in litres, fixture units shall be converted as follows:\n(a) when the number of fixture units is 260 or fewer, the load is 2 360 L, and\n(b) when the number of fixture units exceeds 260, the load is 9.1 L for each fixture unit.\n(2) Where the hydraulic load is to be expressed in gal/min, fixture units shall be converted in accordance with Table 7.4.10.5.\n#### Table 7.4.10.5. (1) Maximum Probable Drainage Rate, gal/min Forming Part of Sentence 7.4.10.5.(2)\n\n<table class=\"obc-table\"><thead><tr><th></th><th>Fixture Units</th><th>Fixture Units</th><th>Fixture Units</th></tr></thead><tbody><tr><td>Fixture Units<br>in Service</td><td>Col. 1</td><td>Col. 1 × 10</td><td>Col. 1 × 100</td></tr><tr><td>100</td><td>53</td><td>174</td><td>900</td></tr><tr><td>90</td><td>51</td><td>164</td><td>835</td></tr><tr><td>80</td><td>49</td><td>153</td><td>750</td></tr><tr><td>70</td><td>47</td><td>140</td><td>680</td></tr><tr><td>60</td><td>44</td><td>128</td><td>600</td></tr><tr><td>50</td><td>41</td><td>115</td><td>520</td></tr><tr><td>40</td><td>38</td><td>102</td><td>435</td></tr><tr><td>30</td><td>33</td><td>88</td><td>350</td></tr><tr><td>20</td><td>27</td><td>72</td><td>262</td></tr><tr><td>10</td><td>21</td><td>53</td><td>174</td></tr></tbody></table>\n\n<h5 class=\"table-notes-title\">Notes to Table 7.4.10.5.:</h5>\n- (1) See Note A-Table 7.4.10.5.\n\n[ARTICLE:7.4.10.6:Hydraulic Loads to Soil or Waste Pipes]\n(1) Except as provided in Sentence (2), the hydraulic load that is drained to every stack shall conform to Table 7.4.10.6.-A.\n(2) Where the nominally horizontal offset in a stack is 1.5 m or more, the hydraulic load that is served by it shall conform to Table 7.4.10.6.-B or Table 7.4.10.6.-C, whichever is the less restrictive.\n(3) Vertical sanitary drainage pipe shall be designed to carry no more than 29% of its full capacity.\n#### Table 7.4.10.6.-A Maximum Permitted Hydraulic Load Drained to a Stack Forming Part of Sentences 7.4.10.6.(1) and 7.5.7.3.(2) and Table 7.5.8.4.\n\n<table class=\"obc-table\"><thead><tr><th>Nominal Pipe Size<br>of Stack, NPS</th><th>Maximum Hydraulic Load, fixture units</th><th>Maximum Fixture Units<br>Drained from<br>any 1<br>Storey</th></tr></thead><tbody><tr><td>1¼</td><td>2</td><td>2</td></tr><tr><td>1½</td><td>8</td><td>2</td></tr><tr><td>2</td><td>24</td><td>6</td></tr><tr><td>3</td><td>102</td><td>18</td></tr><tr><td>4</td><td>540</td><td>100</td></tr><tr><td>5</td><td>1 400</td><td>250</td></tr><tr><td>6</td><td>2 900</td><td>500</td></tr><tr><td>8</td><td>7 600</td><td>830</td></tr><tr><td>10</td><td>15 000</td><td>2 700</td></tr><tr><td>12</td><td>26 000</td><td>4 680</td></tr><tr><td>15</td><td>50 000</td><td>9 000</td></tr></tbody></table>\n#### Table 7.4.10.6.-B Maximum Permitted Hydraulic Load Drained to a Branch Forming Part of Sentences 7.4.10.6.(2), 7.4.10.7.(1) and 7.5.7.3.(2)\n\n<table class=\"obc-table\"><thead><tr><th>Nominal Pipe Size<br>of Branch, NPS</th><th>Maximum Hydraulic Load, fixture units</th></tr></thead><tbody><tr><td>1¼</td><td>2</td></tr><tr><td>1½</td><td>3</td></tr><tr><td>2</td><td>6</td></tr><tr><td>3</td><td>27</td></tr><tr><td>4</td><td>180</td></tr><tr><td>5</td><td>390</td></tr><tr><td>6</td><td>700</td></tr><tr><td>8</td><td>1 600</td></tr><tr><td>10</td><td>2 500</td></tr><tr><td>12</td><td>3 900</td></tr></tbody></table>\n#### Table 7.4.10.6.-C (1) Maximum Permitted Hydraulic Load Drained to a Sanitary Building Drain or Sewer Forming Part of Sentence 7.4.10.6.(2) and Article 7.4.10.8.\n\n<table class=\"obc-table\"><thead><tr><th>Nominal Pipe</th><th></th><th>Maximum Hydraulic Load, fixture units</th><th></th><th></th><th></th><th></th><th></th><th></th><th></th><th></th><th></th></tr></thead><tbody><tr><td>Size<br>of Drain<br>or</td><td></td><td>Slope(2)</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td>Sewer, NPS</td><td>1 in 400</td><td>1 in 200</td><td>1 in 133</td><td>1 in 100</td><td>1 in 50</td><td>1 in 25</td><td></td><td></td><td></td><td></td><td></td></tr><tr><td>3</td><td>n/a</td><td>n/a</td><td>n/a</td><td>n/a</td><td>27</td><td>36</td><td></td><td></td><td></td><td></td><td></td></tr><tr><td>4</td><td>n/a</td><td>n/a</td><td>n/a</td><td>180</td><td>240</td><td>300</td><td></td><td></td><td></td><td></td><td></td></tr><tr><td>5</td><td>n/a</td><td>n/a</td><td>380</td><td>390</td><td>480</td><td>670</td><td></td><td></td><td></td><td></td><td></td></tr><tr><td>6</td><td>n/a</td><td>n/a</td><td>600</td><td>700</td><td>840</td><td>1 300</td><td></td><td></td><td></td><td></td><td></td></tr><tr><td>8</td><td>n/a</td><td>1 400</td><td>1 500</td><td>1 600</td><td>2 250</td><td>3 370</td><td></td><td></td><td></td><td></td><td></td></tr><tr><td>10</td><td>n/a</td><td>2 500</td><td>2 700</td><td>3 000</td><td>4 500</td><td>6 500</td><td></td><td></td><td></td><td></td><td></td></tr><tr><td>12</td><td>2 240</td><td>3 900</td><td>4 500</td><td>5 400</td><td>8 300</td><td>13 000</td><td></td><td></td><td></td><td></td><td></td></tr><tr><td>15</td><td>4 800</td><td>7 000</td><td>9 300</td><td>10 400</td><td>16 300</td><td>22 500</td><td></td><td></td><td></td><td></td><td></td></tr></tbody></table>\n\n<h5 class=\"table-notes-title\">Notes to Table 7.4.10.6.-C:</h5>\n- (1) See Note A-Table 7.4.10.6.-C.\n- (2) Slope is the ratio of rise to run, in whatever measurement units are chosen.\n\n[ARTICLE:7.4.10.7:Hydraulic Loads on Branches]\n\n(1) The hydraulic load that is drained to a branch shall conform to Table 7.4.10.6.-B.\n\n[ARTICLE:7.4.10.8:Hydraulic Loads on Sanitary Building Drains or Sewers]\n(1) Except as permitted by Article 7.4.10.7., the hydraulic load that is drained to a sanitary building drain or a sanitary building sewer shall conform to Table 7.4.10.6.-C.\n(2) Horizontal sanitary drainage pipe shall be designed to carry no more than 65% of its full capacity.\n\n[ARTICLE:7.4.10.9:Hydraulic Loads on Horizontal Storm Drains]\n\n(1) The hydraulic load that is drained to a storm building drain, a storm building sewer or a combined building sewer shall conform to Table 7.4.10.9.\n#### Table 7.4.10.9. Maximum Permitted Hydraulic Load Drained to a Storm Building Drain or Sewer, or a Combined Building Sewer Forming Part of Sentence 7.4.9.5.(2) and Article 7.4.10.9.\n\n<table class=\"obc-table\"><thead><tr><th></th><th></th><th>Maximum Hydraulic Load, L</th><th></th><th></th><th></th><th></th><th></th><th></th><th></th><th></th><th></th></tr></thead><tbody><tr><td>Nominal Pipe Size<br>of Drain<br>or Sewer, NPS</td><td></td><td>Slope(1)</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td></td><td>1 in 400</td><td>1 in 200</td><td>1 in 133</td><td>1 in 100</td><td>1 in 68</td><td>1 in 50</td><td>1 in 25</td><td></td><td></td><td></td><td></td></tr><tr><td>3</td><td>n/a</td><td>n/a</td><td>n/a</td><td>n/a</td><td>n/a</td><td>2 770</td><td>3 910</td><td></td><td></td><td></td><td></td></tr><tr><td>4</td><td>n/a</td><td>n/a</td><td>n/a</td><td>4 220</td><td>5 160</td><td>5 970</td><td>8 430</td><td></td><td></td><td></td><td></td></tr><tr><td>5</td><td>n/a</td><td>n/a</td><td>6 760</td><td>7 650</td><td>9 350</td><td>10 800</td><td>15 300</td><td></td><td></td><td></td><td></td></tr><tr><td>6</td><td>n/a</td><td>n/a</td><td>10 700</td><td>12 400</td><td>15 200</td><td>17 600</td><td>24 900</td><td></td><td></td><td></td><td></td></tr><tr><td>8</td><td>n/a</td><td>18 900</td><td>23 200</td><td>26 700</td><td>32 800</td><td>37 800</td><td>53 600</td><td></td><td></td><td></td><td></td></tr><tr><td>10</td><td>n/a</td><td>34 300</td><td>41 900</td><td>48 500</td><td>59 400</td><td>68 600</td><td>97 000</td><td></td><td></td><td></td><td></td></tr><tr><td>12</td><td>37 400</td><td>55 900</td><td>68 300</td><td>78 700</td><td>96 500</td><td>112 000</td><td>158 000</td><td></td><td></td><td></td><td></td></tr><tr><td>15</td><td>71 400</td><td>101 000</td><td>124 000</td><td>143 000</td><td>175 000</td><td>202 000</td><td>287 000</td><td></td><td></td><td></td><td></td></tr></tbody></table>\n\n<h5 class=\"table-notes-title\">Notes to Table 7.4.10.9.:</h5>\n- (1) Slope is the ratio of rise to run, in whatever measurement units are chosen.\n\n[ARTICLE:7.4.10.10:Hydraulic Loads to Roof Gutters]\n\n(1) The hydraulic load that is drained to a roof gutter shall conform to Table 7.4.10.10.\n\n#### Table 7.4.10.10. Maximum Permitted Hydraulic Load Drained to a Roof Gutter Forming Part of Article 7.4.10.10.\n\n<table class=\"obc-table\"><thead><tr><th>Nominal Pipe Size of Gutter,<br>NPS</th><th></th><th>Maximum Hydraulic Load, L</th><th></th><th></th><th></th><th></th><th></th></tr></thead><tbody><tr><td></td><td>Area of Gutter,cm ³</td><td></td><td></td><td>Slope</td><td></td><td></td><td></td></tr><tr><td>IVI O</td><td></td><td>1 in 200</td><td>1 in 100</td><td>1 in 50</td><td>1 in 25</td><td></td><td></td></tr><tr><td>3</td><td>22.8</td><td>406</td><td>559</td><td>812</td><td>1 140</td><td></td><td></td></tr><tr><td>4</td><td>40.5</td><td>838</td><td>1 190</td><td>1 700</td><td>2 410</td><td></td><td></td></tr><tr><td>5</td><td>63.3</td><td>1 470</td><td>2 080</td><td>2 950</td><td>4 170</td><td></td><td></td></tr><tr><td>6</td><td>91.2</td><td>2 260</td><td>3 200</td><td>4 520</td><td>6 530</td><td></td><td></td></tr><tr><td>7</td><td>124.1</td><td>3 250</td><td>4 600</td><td>6 500</td><td>9 190</td><td></td><td></td></tr><tr><td>8</td><td>162.1</td><td>4 700</td><td>6 600</td><td>9 400</td><td>13 200</td><td></td><td></td></tr><tr><td>10</td><td>253.4</td><td>8 480</td><td>12 000</td><td>17 000</td><td>23 600</td><td></td><td></td></tr></tbody></table>\n\n[ARTICLE:7.4.10.11:Hydraulic Loads on Leaders]\n\n(1) The hydraulic load that is drained to a leader shall conform to Table 7.4.10.11.\n\n#### Table 7.4.10.11. Maximum Permitted Hydraulic Load Drained to a Leader Forming Part of Sentence 7.4.10.11.(1)\n\n<table class=\"obc-table\"><thead><tr><th>Circular</th><th>Leader</th><th>Non-Circular Leader</th><th></th><th></th></tr></thead><tbody><tr><td>Nominal Pipe Size of Leader,<br>NPS</td><td>Maximum Hydraulic Load, L</td><td>Area of Leader, cm ²</td><td>Maximum Hydraulic<br>Load, L</td><td></td></tr><tr><td>2</td><td>1 700</td><td>20.3</td><td>1 520</td><td></td></tr><tr><td>2½</td><td>3 070</td><td>31.6</td><td>2 770</td><td></td></tr><tr><td>3</td><td>5 000</td><td>45.6</td><td>4 500</td><td></td></tr><tr><td>4</td><td>10 800</td><td>81.1</td><td>9 700</td><td></td></tr><tr><td>5</td><td>19 500</td><td>126.6</td><td>17 600</td><td></td></tr><tr><td>6</td><td>31 800</td><td>182.4</td><td>28 700</td><td></td></tr><tr><td>8</td><td>68 300</td><td>324.3</td><td>61 500</td><td></td></tr></tbody></table>\n\n[ARTICLE:7.4.10.12:Hydraulic Loads from Fixtures with a Semi-continuous Flow]\n\n(1) The hydraulic load from a fixture or equipment that produces a semi-continuous flow shall conform to Table 7.4.10.12.\n\n#### Table 7.4.10.12. Maximum Permitted Hydraulic Load from Fixtures with a Semi-continuous Flow Forming Part of Sentence 7.4.10.12.(1)\n\n<table class=\"obc-table\"><thead><tr><th>Nominal Pipe Size of Trap, NPS</th><th>Flow, L/s</th><th>Hydraulic Load, fixture units</th></tr></thead><tbody><tr><td>1½</td><td>0.000 -<br>0.090</td><td>3</td></tr><tr><td>2</td><td>0.091 -<br>0.190</td><td>6</td></tr><tr><td>3</td><td>0.191 -<br>0.850</td><td>27</td></tr><tr><td>4</td><td>0.851 -<br>5.700</td><td>180</td></tr></tbody></table>\n\n[ARTICLE:7.4.10.13:Reserved.]"
        }
      ]
    },
    {
      "id": "7.5",
      "title": "Venting Systems",
      "subsections": [
        {
          "id": "7.5.1",
          "title": "Vent Pipes for Traps",
          "content": "[ARTICLE:7.5.1.1:Venting for Traps]\n(1) Except as provided in Sentences (3) and (4), traps shall be protected by a vent pipe.\n(2) Drainage systems may require additional protection as provided in Subsections 7.5.4. and 7.5.5. by the installation of\n(a) branch vents,\n(b) vent stacks,\n(c) stack vents,\n(d) vent headers,\n(e) fresh air inlets,\n(f) relief vents,\n(g) circuit vents,\n(h) yoke vents,\n(i) offset relief vents,\n(j) additional circuit vents,\n(k) wet vents,\n(l) individual vents,\n(m) dual vents, or\n(n) continuous vents.\n(3) A trap that serves a floor drain or hub drain need not be protected by a vent pipe separately where\n(a) the nominal pipe size of the trap is not less than NPS 3,\n(b) the length of the fixture drain is not less than 450 mm,\n(c) the fall on the fixture drain does not exceed its nominal pipe size.\n(4) A trap need not be protected by a vent pipe\n(a) where it serves\n(i) a subsoil drainage pipe, or\n(ii) a storm drainage system, or\n(b) where it forms part of an indirect drainage system. (See also Clause 7.4.2.3.(2)(b))"
        },
        {
          "id": "7.5.2",
          "title": "Wet Venting",
          "content": "[ARTICLE:7.5.2.1:Wet Venting]\n(1) A sanitary drainage pipe is permitted to serve as a wet vent, provided\n(a) the hydraulic load is in accordance with Table 7.5.8.1.,\n(b) the number of wet-vented water closets does not exceed 2,\n(c) where 2 water closets are installed, they are connected at the same level by means of a double sanitary T fitting if the vent pipe is vertical and by means of a double Y fitting if the vent pipe is horizontal,\n(d) the water closets are installed downstream of all other fixtures,\n(e) trap arms and fixture drains connected to the wet vent do not exceed NPS 2, except for connections from emergency floor drains in accordance with [Sentence 7.5.1.1.\\(3\\),](#page-651-0)\n(f) the total hydraulic load on the wet vent does not exceed the limits stated in Table 7.5.8.1. when separately vented branches or fixture drains in the same storey, having a total hydraulic load not greater than 2 fixture units, are connected to the wet vent or a wet-vented water-closet trap arm,\n(g) the hydraulic load of separately vented fixtures that drain into the wet vent are not included when sizing the continuous vent that serves the wet vent,\n(h) where a wet vent extends through more than one storey, the total discharge from any one storey above the first storey does not exceed 4 fixture units,\n(i) there is not more than one nominally horizontal offset in the wet vent, and\n(i) the offset does not exceed 1.2 m for pipes of NPS 2 or less, or\n(ii) the offset does not exceed 2.5 m for pipes larger than NPS 2,\n(j) the wet vented portion is not reduced in size except for the portion that is upstream of floor drains in accordance with Sentence 7.5.1.1.(3),\n(k) the length of the wet vent is not limited."
        },
        {
          "id": "7.5.3",
          "title": "Circuit Venting",
          "content": "[ARTICLE:7.5.3.1:Circuit Venting]\n(1) A section of horizontal branch may be circuit-vented provided\n(a) a circuit vent is connected to it,\n(b) all fixtures served by the circuit vent are located in the same storey,\n(c) no stack is connected to it upstream of a circuit-vented fixture.\n(2) Fixtures with fixture outlet pipes less than NPS 2 shall be separately vented or separately circuit-vented.\n(3) Except as provided in Sentences (4) and (5), a relief vent shall be connected to the branch that forms part of a circuit-vented system, downstream of the connection of the most downstream circuit-vented fixture.\n(4) A sanitary drainage pipe having a hydraulic load not greater than 6 fixture units is permitted to act as a relief vent for a branch that is circuit-vented.\n(5) A symmetrically connected relief vent is permitted to serve as a combined relief vent for a maximum of 2 branches that are circuit-vented, provided there are not more than 8 circuit-vented fixtures connected between the combined relief vent and each circuit vent.\n(6) Additional circuit vents shall be required\n(a) where each cumulative horizontal change in direction of a branch served by a circuit vent exceeds 45° between vent pipe connections, or\n(b) where more than 8 circuit-vented fixtures are connected to a branch between vent pipe connections.\n(7) A sanitary drainage pipe is permitted to serve as an additional circuit vent in accordance with Sentence (6), provided the sanitary drainage pipe is sized as a wet vent in conformance with Article 7.5.8.1. and is not less than NPS 2.\n(8) Connections to circuit vents and additional circuit vents in accordance with Sentence (6) shall conform to Sentence 7.5.4.5.(1).\n(9) A circuit-vented branch, including the fixture drain downstream of the circuit vent connection, shall be sized in accordance with Articles 7.4.10.7. and 7.10.4.8., except that it shall be not less than\n(a) NPS 2, where traps less than NPS 2 are circuit-vented, or\n(b) NPS 3, where traps of NPS 2 or larger are circuit-vented.\n(10) Additional circuit vents shall be sized in accordance with Table 7.5.7.1. and Sentence 7.5.7.3.(1).\n(11) The hydraulic load on a circuit vent shall include the hydraulic load from fixtures connected to the branch served by the circuit vent, but shall not include the hydraulic load from fixtures permitted by Sentences (3), (4) and (5)."
        },
        {
          "id": "7.5.4",
          "title": "Vent Pipes for Stacks",
          "content": "[ARTICLE:7.5.4.1:Stack Vents]\n\n(1) The upper end of every stack shall terminate in a stack vent and the stack vent shall terminate in open air outside the building, or connect directly or through a header to another stack vent or vent stack that does terminate in open air outside the building.\n\n[ARTICLE:7.5.4.2:Vent Stacks]\n(1) Except as provided in Sentence (2), every stack that drains fixtures from more than 4 storeys containing plumbing fixtures shall have a vent stack.\n(2) A stack that serves as a wet vent does not require a vent stack.\n(3) The vent stack required by Sentence (1) shall be connected to a vertical section of the stack at or immediately below the lowest sanitary drainage pipe connected to the stack.\n(4) Fixtures are permitted to be connected to a vent stack, provided\n(a) the total hydraulic load of the connected fixtures does not exceed 8 fixture units,\n(b) at least one fixture is connected to a vertical portion of the vent stack and upstream of any other fixtures,\n(c) no other fixture is connected downstream of a water closet,\n(d) all fixtures are located in the lowest storey served by the vent stack, and\n(e) the section of the vent pipe that acts as a wet vent conforms to the requirements regarding wet vents.\n\n[ARTICLE:7.5.4.3:Yoke Vents]\n(1) Except as provided in Sentence (4), where a stack receives the discharge from fixtures located on more than 11 storeys, a yoke vent shall be installed\n(a) for each section of 5 storeys or part of them counted from the top down, and\n(b) at or immediately above each offset or double offset.\n(2) The yoke vent shall be connected to the stack by means of a drainage fitting at or immediately below the lowest sanitary drainage pipe from the lowest storey of the sections described in Sentence (1).\n(3) The yoke vent shall connect to the vent stack at least 1 m above the floor level of the lowest storey in the section described in Sentence (1).\n\n(4) A yoke vent need not be installed provided the stack is interconnected with the vent stack in each storey of the section in which fixtures are located by means of a vent pipe equal in nominal pipe size to the branch or fixture drain or NPS 2, whichever is smaller.\n\n[ARTICLE:7.5.4.4:Offset Relief Vents]\n(1) A stack that has a nominally horizontal offset more than 1.5 m long and above which the upper vertical portion of the stack passes through more than 2 storeys and receives a hydraulic load of more than 100 fixture units shall be vented by an offset relief vent connected to the vertical section immediately above the offset and by another offset relief vent\n(a) connected to the lower vertical section at or above the highest sanitary drainage pipe connection, or\n(b) extended as a vertical continuation of the lower section.\n\n[ARTICLE:7.5.4.5:Fixtures Draining into Vent Pipes]\n(1) The trap arm of a fixture that has a hydraulic load of not more than 1½ fixture units may be connected to the vertical section of a circuit vent, additional circuit vent, offset relief vent or yoke vent, provided\n(a) not more than 2 fixtures are connected to the vent pipe,\n(b) where 2 fixtures are connected to the vent pipe, the connection is made by means of a double sanitary T fitting, and\n(c) the section of the vent pipe that acts as a wet vent is not less than NPS 2.\n\n(See Note A-7.5.4.5.(1))"
        },
        {
          "id": "7.5.5",
          "title": "Miscellaneous Vent Pipes",
          "content": "[ARTICLE:7.5.5.1:Venting of Sanitary Sewage Sumps]\n\n(1) Every sump or tank that receives sanitary sewage shall be provided with a vent pipe that is connected to the top of the sump or tank. (See Article 7.5.7.7. for sizing of these vents.)\n\n[ARTICLE:7.5.5.2:Venting of Interceptors]\n(1) Every oil interceptor shall be provided with 2 vent pipes that\n(a) connect to the interceptor at opposite ends,\n(b) extend independently to open air,\n(c) terminate not less than 2 m above ground and at elevations differing by at least 300 mm, and\n(d) do not connect to each other or any other vent pipe.\n(2) Adjacent compartments within every oil interceptor shall be connected to each other by a vent opening.\n(3) Where a secondary receiver for oil is installed in conjunction with an oil interceptor, it shall be vented in accordance with the manufacturer's recommendations, and the vent pipe shall\n(a) in no case be less than NPS 1½,\n(b) extend independently to open air, and\n(c) terminate not less than 2 m above ground.\n(4) The vent pipes referred to in Sentence (1) are permitted to be one NPS smaller than the largest connected drainage pipe but not less than NPS 1¼, or can be sized in accordance with the manufacturer's recommendations.\n(5) A vent pipe that serves an oil interceptor and is located outside a building shall be not less than NPS 3 in areas where it may be subject to frost closure.\n(6) Every grease interceptor inlet pipe shall be provided with a vent pipe\n(a) within 1 500 mm of the inlet to the grease interceptor,\n(b) not less than NPS 1½ for inlet pipes up to NPS 4, but not larger than NPS 2, and\n(c) complete with a cleanout to provide cleaning of the vent pipe.\n(7) Where an acid waste dilution tank is installed, it shall be provided with a vent pipe connected at the top of the tank and that is sized in accordance with Article 7.5.7.7.\n\n[ARTICLE:7.5.5.3:Venting of Drain Piping and Dilution Tanks for Corrosive Waste]\n\n(1) Venting systems for drain piping, neutralizing tanks, or dilution tanks conveying corrosive waste shall extend independently and terminate outdoors. (See Article 7.5.7.7. for sizing of these vents.)\n\n[ARTICLE:7.5.5.4:Fresh Air Inlets]\n\n(1) Where a building trap is installed, a fresh air inlet not less than NPS 4 shall be connected upstream and within 1.2 m of the building trap and downstream of any other connection.\n\n[ARTICLE:7.5.5.5:Provision for Future Installations]\n(1) Where provision is made for a fixture to be installed in the future, the drainage system and venting system shall be sized accordingly and provision made for the necessary future connections.\n(2) Except as required in Sentence 7.5.7.7.(2), where a plumbing system is installed in a building, every storey in which plumbing is or may be installed, including the basement of a building, shall have extended into it or passing through it a vent pipe that is at least NPS 1½ for the provision of future connections."
        },
        {
          "id": "7.5.6",
          "title": "Arrangement of Vent Pipes",
          "content": "[ARTICLE:7.5.6.1:Drainage of Vent Pipes]\n(1) Vent pipes shall be installed without depression in which moisture can collect.\n(2) Waste pipes shall be installed and back vented at the same time.\n\n[ARTICLE:7.5.6.2:Vent Pipe Connections]\n(1) Vent pipes in a plumbing system shall be installed so as to be direct as possible to a vent stack or open air, as the case may be, and so that any horizontal run below the flood level of the fixture to which the vent pipe is installed is eliminated where structurally possible.\n(2) Except for wet vents, where a vent pipe is connected to a nominally horizontal sanitary drainage pipe, the connection shall be above the horizontal centre line of the sanitary drainage pipe.\n(3) Unused vent pipes installed for future connections shall be permanently capped with an end cleanout or an adapter and plug.\n\n[ARTICLE:7.5.6.3:Location of Vent Pipes]\n(1) Except as provided in Sentences (2) and (3), vent pipes that protects a fixture trap shall be located so that\n(a) the developed length of the trap arm is not less than twice the NPS of the fixture drain,\n(b) the total fall of the trap arm is not greater than its inside diameter, and\n(c) the trap arm does not have a cumulative change in direction of more than 135°.\n(2) The trap arm of water closets, of S-trap standards or of any other fixture that also discharges vertically and depends on siphonic action for its proper functioning shall not have a cumulative change in direction of more than 225°.\n(3) A vent pipe that protects a water closet or any other fixture that also depends on siphonic action for its proper functioning shall be located so that the distance between the connections of the fixture drain to the fixture and the vent pipe does not exceed\n(a) 1 m in the vertical plane, and\n(b) 3 m in the horizontal plane.\n(4) The maximum length of every trap arm shall conform to Table 7.5.6.3.\n\n#### Table 7.5.6.3. Length of Trap Arm Forming Part of Sentence 7.5.6.3.(4)\n\n<table class=\"obc-table\"><thead><tr><th>Nominal Pipe Size<br>of<br>Trap Served, NPS</th><th>Maximum Length of Trap Arm, m</th><th>Minimum Slope</th></tr></thead><tbody><tr><td>1¼</td><td>1.5</td><td>1 in 50</td></tr><tr><td>1½</td><td>1.8</td><td>1 in 50</td></tr><tr><td>2</td><td>2.4</td><td>1 in 50</td></tr><tr><td>3</td><td>3.6</td><td>1 in 50</td></tr><tr><td>4</td><td>4.9</td><td>1 in 50</td></tr><tr><td>4</td><td>9.8</td><td>1 in 100</td></tr></tbody></table>\n\n[ARTICLE:7.5.6.4:Connection of Vents Above Fixtures Served]\n(1) Except for a wet vent, every vent pipe shall extend above the flood level rim of every fixture that it serves before being connected to another vent pipe.\n(2) No vent pipe shall be connected in such a manner that a blockage in a soil or waste pipe would cause waste to drain through the vent pipe to the drainage system.\n\n[ARTICLE:7.5.6.5:Terminals]\n(1) Except as provided in Sentence (3), the upper end of every vent pipe that is not terminated in open air shall be connected to a venting system that terminates through a roof to open air.\n(2) The upper end of every vent pipe that is terminated in open air, other than a vent pipe that serves an oil interceptor or a fresh air inlet, shall be extended above the roof.\n(3) A vent pipe is permitted to be erected outside a building, provided that\n(a) no single change of direction of the vent pipe exceeds 45°,\n(b) all parts of the vent pipe are nominally vertical,\n(c) in areas where the vent pipe may be subject to frost closure, it is increased to not less than NPS 3 before penetrating a wall or roof, and\n(d) where the building is 4 storeys or less in height, the vent pipe terminates above the roof of the building.\n(4) Except for a fresh air inlet, where a vent pipe is terminated in open air, the terminal shall be located\n(a) not less than 1 m above and not less than 3.5 m in any other direction from every air inlet, openable window or door,\n(b) not less than 2 m above and not less than 3.5 m in any other direction from a roof that supports an occupancy,\n(c) not less than 2 m above ground, and\n(d) not less than 1.8 m from every property line.\n(5) Where a vent pipe passes through a roof, it shall\n(a) be terminated high enough to prevent the entry of roof drainage but not less than 150 mm above the roof or above the surface of storm water, which could pond on the roof, and\n(b) be provided with flashing to prevent the entry of water between the vent pipe and the roof. (See Article 7.2.10.14.)\n(6) Where a vent pipe passes through a roof and may be subject to frost closure, it shall be protected from frost closure by\n(a) increasing its diameter at least one NPS, but not less than NPS 3, immediately before it penetrates the roof,\n(b) insulating the pipe, or\n(c) protecting it in some other manner.\n\n(See Article 7.3.4.7.)\n(7) Where a vent pipe is located 2 m or more above a roof, it shall be so constructed as to be stable and secure.\n(8) Flashing shall be of material specified in Article 7.2.10.14. and on a shingled roof shall have a minimum dimension of 500 mm by 500 mm.\n(9) Where a sleeve flashing is installed on a flat roof, it shall extend at least 150 mm above the flood level and on a sloped roof shall be at least 150 mm high on the short side.\n(10) No bore of a vent stack or stack vent shall be reduced or obstructed by the installation of a flashing."
        },
        {
          "id": "7.5.7",
          "title": "Minimum Size of Vent Pipes",
          "content": "[ARTICLE:7.5.7.1:General]\n\n(1) The nominal pipe size of every vent pipe shall conform to Table 7.5.7.1.\n#### Table 7.5.7.1. Minimum Permitted Size of Vent Pipe Based on Size of Trap Served Forming Part of Sentences 2.5.7.1.(1) and 2.5.8.2.(1)\n\n<table class=\"obc-table\"><thead><tr><th>Nominal Pipe Size<br>of Trap Served, NPS</th><th>Minimum Nominal Pipe Size<br>of Vent Pipe, NPS</th></tr></thead><tbody><tr><td>1¼</td><td>1¼</td></tr><tr><td>1½</td><td>1¼</td></tr><tr><td>2</td><td>1½</td></tr><tr><td>3</td><td>1½</td></tr><tr><td>4</td><td>1½</td></tr><tr><td>5</td><td>2</td></tr><tr><td>6</td><td>2</td></tr></tbody></table>\n\n[ARTICLE:7.5.7.2:Size Restriction]\n(1) The nominal pipe size of a branch vent, stack vent, vent stack or vent header shall be not less than the nominal pipe size of the vent pipe to which it is connected.\n(2) Sanitary building drains shall be provided with at least one vent that is not less than NPS 3.\n(3) A vent referred to in Sentence (2) shall be a soil stack if one is available and may be a vent stack or waste stack that provides at least NPS 3 stack vent and that goes to open air above the roof, either directly or through a header.\n\n[ARTICLE:7.5.7.3:Additional Circuit Vents and Relief Vents]\n(1) Except as provided in Article 7.5.7.1. and Sentence 7.5.3.1.(7), the minimum nominal pipe size of an additional circuit vent or relief vent installed in conjunction with a circuit vent is permitted to be one NPS smaller than the required nominal pipe size of the circuit vent, but need not be larger than NPS 2.\n(2) The nominal pipe size of the sanitary drainage pipe acting as a relief vent in accordance with [Sentence 7.5.3.1.\\(4\\)](#page-652-0) shall be in conformance with Table 7.4.10.6.-A, 7.4.10.6.-B or 7.5.8.1., and Article [7.5.7.1.,](#page-657-0) whichever nominal pipe size is the largest considering the hydraulic load drained into the sanitary drainage pipe.\n\n[ARTICLE:7.5.7.4:Offset Relief Vents]\n\n(1) Except as provided in Article 7.5.7.1., the minimum nominal pipe size of an offset relief vent is permitted to be one NPS smaller than the NPS of the stack vent..\n\n[ARTICLE:7.5.7.5:Yoke Vents]\n\n(1) Yoke vents required by Sentence 7.5.4.3.(1) are permitted to be one NPS smaller than the NPS of the smallest pipe to which they are connected\n\n[ARTICLE:7.5.7.6:Vent Pipes for Manholes]\n\n(1) The minimum nominal pipe size of a vent pipe that serves a manhole within a building shall be NPS 2.\n\n[ARTICLE:7.5.7.7:Vents for Sewage Sumps, Neutralizing and Dilution Tanks, and Macerating Toilet Systems]\n(1) Except as provided in Sentences (2) and (3), the minimum nominal pipe size of the vent pipe for a sewage sump or neutralizing or dilution tank shall be one NPS smaller than the NPS of the largest branch or fixture drain draining to the sump.\n(2) The nominal pipe size of every vent pipe for a sewage sump or neutralizing or dilution tank shall be not less than NPS 2, but need not be greater than NPS 4.\n(3) The nominal pipe size of a vent pipe for a macerating toilet system with a sump shall be not less than NPS 1½."
        },
        {
          "id": "7.5.8",
          "title": "Sizing of Vent Pipes",
          "content": "[ARTICLE:7.5.8.1:Hydraulic Loads Draining to Wet Vents]\n(1) The hydraulic load that drains to a wet vent shall conform to Table 7.5.8.1.\n(2) When determining the nominal pipe size of a wet vent, the hydraulic load from the most downstream fixture or symmetrically connected fixtures shall not be included.\n#### Table 7.5.8.1. Maximum Permitted Hydraulic Loads Drained to a Wet Vent Forming Part of Sentences 7.5.7.3.(2) and 7.5.8.1.(1)\n\n<table class=\"obc-table\"><thead><tr><th></th><th>Maximum Hydraulic Load, Fixture Units</th><th></th><th></th><th></th><th></th></tr></thead><tbody><tr><td>Nominal Pipe Size<br>of Wet Vent, NPS</td><td>Not Serving Water Closets</td><td>Fixtures, Other Than Water Closets, That<br>Serve Not More Than 2 Water Closets</td><td></td><td></td><td></td></tr><tr><td>1½</td><td>2</td><td>n/a</td><td></td><td></td><td></td></tr><tr><td>2</td><td>4</td><td>3</td><td></td><td></td><td></td></tr><tr><td>3</td><td>12</td><td>8</td><td></td><td></td><td></td></tr><tr><td>4</td><td>36</td><td>14</td><td></td><td></td><td></td></tr><tr><td>5</td><td>n/a</td><td>18</td><td></td><td></td><td></td></tr><tr><td>6</td><td>n/a</td><td>23</td><td></td><td></td><td></td></tr></tbody></table>\n\n[ARTICLE:7.5.8.2:Individual Vents and Dual Vents]\n(1) The nominal pipe size of individual vents and dual vents shall be determined using Table 7.5.7.1. based on the largest trap served.\n(2) When sizing an individual vent or a dual vent, the length is not taken into consideration.\n\n[ARTICLE:7.5.8.3:Branch Vents, Vent Headers, Continuous Vents and Circuit Vents]\n(1) Branch vents, vent headers, circuit vents and continuous vents shall be sized in accordance with Table 7.5.8.3., unless they are individual vents or dual vents.\n(2) For the purposes of Table 7.5.8.3., the length of a branch vent shall be its developed length from the most distant sanitary drainage pipe connection to a vent stack, stack vent, header or open air.\n(3) For the purposes of Table 7.5.8.3., the length of a vent header shall be its developed length from the most distant sanitary drainage pipe connection to open air.\n(4) For the purposes of Table 7.5.8.3., the length of a circuit vent shall be its developed length from the horizontal sanitary drainage pipe connection to a vent stack, stack vent, vent header or open air.\n(5) For the purposes of Table 7.5.8.3., the length of a continuous vent shall be its developed length from the vertical sanitary drainage pipe connection to a vent stack, stack vent, vent header or open air.\n#### Table 7.5.8.3. Sizing of Branch Vents, Vent Headers, Circuit Vents and Continuous Vents(1) Forming Part of Article 7.5.8.3.\n\n<table class=\"obc-table\"><thead><tr><th></th><th></th><th>Nominal Pipe Size<br>of Vent Pipe, NPS</th><th></th><th></th><th></th><th></th><th></th><th></th><th></th><th></th><th></th></tr></thead><tbody><tr><td>Total Hydraulic Load<br>Served by Vent Pipe,</td><td>1¼</td><td>1½</td><td>2</td><td>3</td><td>4</td><td>5</td><td>6</td><td>8</td><td></td><td></td><td></td></tr><tr><td>fixture units</td><td></td><td></td><td></td><td></td><td>Maximum Length of Vent Pipe, m</td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td>2</td><td>9</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td></td><td></td><td></td></tr><tr><td>8</td><td>9</td><td>30</td><td>61</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td></td><td></td><td></td></tr><tr><td>20</td><td>7.5</td><td>15</td><td>46</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td></td><td></td><td></td></tr><tr><td>24</td><td>4.5</td><td>9</td><td>30</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td></td><td></td><td></td></tr><tr><td>42</td><td>NP</td><td>9</td><td>30</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td></td><td></td><td></td></tr><tr><td>60</td><td>NP</td><td>4.5</td><td>15</td><td>120</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td></td><td></td><td></td></tr><tr><td>100</td><td>NP</td><td>NP</td><td>11</td><td>79</td><td>305</td><td>NL</td><td>NL</td><td>NL</td><td></td><td></td><td></td></tr><tr><td>200</td><td>NP</td><td>NP</td><td>9</td><td>76</td><td>275</td><td>NL</td><td>NL</td><td>NL</td><td></td><td></td><td></td></tr><tr><td>500</td><td>NP</td><td>NP</td><td>6</td><td>55</td><td>215</td><td>NL</td><td>NL</td><td>NL</td><td></td><td></td><td></td></tr><tr><td>1 100</td><td>NP</td><td>NP</td><td>NP</td><td>15</td><td>61</td><td>215</td><td>NL</td><td>NL</td><td></td><td></td><td></td></tr><tr><td>1 900</td><td>NP</td><td>NP</td><td>NP</td><td>6</td><td>21</td><td>61</td><td>215</td><td>NL</td><td></td><td></td><td></td></tr><tr><td>2 200</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>9</td><td>27</td><td>105</td><td>335</td><td></td><td></td><td></td></tr><tr><td>3 600</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>7.5</td><td>18</td><td>76</td><td>245</td><td></td><td></td><td></td></tr><tr><td>5 600</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>7.5</td><td>18</td><td>76</td><td></td><td></td><td></td></tr></tbody></table>\n\n<h5 class=\"table-notes-title\">Notes to Table 7.5.8.3.:</h5>\n- (1) NP = not permitted and NL = not limited\n\n[ARTICLE:7.5.8.4:Vent Stacks or Stack Vents]\n(1) A vent stack or stack vent shall be sized in accordance with Table 7.5.8.4. based on\n(a) the length of the vent stack or stack vent, and\n(b) the total hydraulic load that is drained to the lowest section of a stack served by the vent pipe, plus any additional vent loads connected to the vent stack or stack vent.\n(2) For the purposes of Table 7.5.8.4., the length of a stack vent or vent stack shall be its developed length from its lower end to open air.\n(3) The minimum nominal pipe size of a vent stack or stack vent shall be one-half the NPS of the stack at its base.\n(4) A stack vent serving a wet vent stack that is over 4 storeys high shall extend the full size of the wet vent to open air.\n(5) Sanitary building drains shall be provided with at least one vent that is not less than NPS 3.\n\n#### Table 7.5.8.4. Size and Developed Length of Stack Vents and Vent Stacks(1) Forming Part of Sentences 7.5.8.4.(1) and (2)\n\n<table class=\"obc-table\"><thead><tr><th>Nominal</th><th>Total</th><th></th><th></th><th></th><th></th><th></th><th></th><th></th><th>Nominal Pipe Size of Stack Vent or Vent Stack, NPS</th><th></th><th></th><th></th></tr></thead><tbody><tr><td>Pipe Size</td><td>Hydraulic</td><td>Water</td><td>1¼</td><td>1½</td><td>2</td><td>3</td><td>4</td><td>5</td><td>6</td><td>8</td><td>10</td><td>12</td></tr><tr><td>of Stack,<br>NPS(2)</td><td>Load Being<br>Vented,<br>fixture units</td><td>Occupied<br>Area</td><td></td><td></td><td></td><td></td><td></td><td></td><td>Maximum Length of Stack Vent or Vent Stack, m</td><td></td><td></td><td></td></tr><tr><td>1¼</td><td>2</td><td>0.29</td><td>9</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td></tr><tr><td>1½</td><td>8</td><td>0.25</td><td>15</td><td>46</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td></tr><tr><td>2</td><td>12</td><td>0.25</td><td>9</td><td>23</td><td>61</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td></tr><tr><td></td><td>24</td><td>0.29</td><td>8</td><td>15</td><td>46</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td></tr><tr><td></td><td>10</td><td>0.15</td><td>NP</td><td>13</td><td>46</td><td>317</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td></tr><tr><td>3</td><td>21</td><td>0.20</td><td>NP</td><td>10</td><td>33.5</td><td>247</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td></tr><tr><td></td><td>53</td><td>0.25</td><td>NP</td><td>8</td><td>28.5</td><td>207</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td></tr><tr><td></td><td>102</td><td>0.29</td><td>NP</td><td>7.5</td><td>26</td><td>189</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td></tr><tr><td></td><td>43</td><td>0.15</td><td>NP</td><td>NP</td><td>10.5</td><td>76</td><td>299</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td></tr><tr><td>4</td><td>140</td><td>0.20</td><td>NP</td><td>NP</td><td>8</td><td>61</td><td>229</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td></tr><tr><td></td><td>320</td><td>0.25</td><td>NP</td><td>NP</td><td>7</td><td>52</td><td>195</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td></tr><tr><td></td><td>540</td><td>0.29</td><td>NP</td><td>NP</td><td>6.5</td><td>46</td><td>177</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td></tr><tr><td></td><td>190</td><td>0.15</td><td>NP</td><td>NP</td><td>NP</td><td>25</td><td>97.5</td><td>302</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td></tr><tr><td></td><td>490</td><td>0.20</td><td>NP</td><td>NP</td><td>NP</td><td>19</td><td>76</td><td>232</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td></tr><tr><td>5</td><td>940</td><td>0.25</td><td>NP</td><td>NP</td><td>NP</td><td>16</td><td>64</td><td>204</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td></tr><tr><td></td><td>1400</td><td>0.29</td><td>NP</td><td>NP</td><td>NP</td><td>15</td><td>58</td><td>180</td><td>NL</td><td>NL</td><td>NL</td><td>NL</td></tr><tr><td></td><td>500</td><td>0.15</td><td>NP</td><td>NP</td><td>NP</td><td>10</td><td>39.5</td><td>122</td><td>305</td><td>NL</td><td>NL</td><td>NL</td></tr><tr><td></td><td>1 100</td><td>0.20</td><td>NP</td><td>NP</td><td>NP</td><td>8</td><td>30.5</td><td>94.5</td><td>238</td><td>NL</td><td>NL</td><td>NL</td></tr><tr><td>6</td><td>2 000</td><td>0.25</td><td>NP</td><td>NP</td><td>NP</td><td>6.5</td><td>25.5</td><td>79</td><td>201</td><td>NL</td><td>NL</td><td>NL</td></tr><tr><td></td><td>2 900</td><td>0.29</td><td>NP</td><td>NP</td><td>NP</td><td>6</td><td>23.5</td><td>73</td><td>183</td><td>NL</td><td>NL</td><td>NL</td></tr><tr><td></td><td>1 800</td><td>0.15</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>9.5</td><td>29</td><td>73</td><td>287</td><td>NL</td><td>NL</td></tr><tr><td></td><td>3 400</td><td>0.20</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>7</td><td>22</td><td>58</td><td>219.5</td><td>NL</td><td>NL</td></tr><tr><td>8</td><td>5 600</td><td>0.25</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>6</td><td>19</td><td>49</td><td>186</td><td>NL</td><td>NL</td></tr><tr><td></td><td>7 600</td><td>0.29</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>5.5</td><td>17</td><td>43</td><td>170.5</td><td>NL</td><td>NL</td></tr><tr><td></td><td>4 000</td><td>0.15</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>9.5</td><td>24</td><td>94.5</td><td>292.5</td><td>NL</td></tr><tr><td></td><td>7 200</td><td>0.20</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>7</td><td>18</td><td>73</td><td>225.5</td><td>NL</td></tr><tr><td>10</td><td>11 000</td><td>0.25</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>6</td><td>15.5</td><td>61</td><td>192</td><td>NL</td></tr><tr><td></td><td>15 000</td><td>0.29</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>5.5</td><td>14</td><td>55</td><td>174</td><td>NL</td></tr><tr><td></td><td>7 300</td><td>0.15</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>9.5</td><td>36.5</td><td>116</td><td>287</td></tr><tr><td></td><td>13 000</td><td>0.20</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>7</td><td>28.5</td><td>91</td><td>219.5</td></tr><tr><td>12</td><td>20 000</td><td>0.25</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>6</td><td>24</td><td>76</td><td>186</td></tr><tr><td></td><td>26 000</td><td>0.29</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>5.5</td><td>22</td><td>70</td><td>152</td></tr><tr><td></td><td>15 000</td><td>0.15</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>12</td><td>39.5</td><td>94.5</td></tr><tr><td></td><td>25 000</td><td>0.20</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>9.5</td><td>29</td><td>73</td></tr><tr><td>15</td><td>38 000</td><td>0.25</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>8</td><td>24.5</td><td>61</td></tr><tr><td></td><td>50 000</td><td>0.29</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>NP</td><td>7</td><td>22.5</td><td>55</td></tr></tbody></table>\n\n<h5 class=\"table-notes-title\">Notes to Table 7.5.8.4.:</h5>\n- (1) NP = not permitted and NL = not limited.\n- (2) Stacks shall be sized using Table 7.4.10.6.-A.\n\n[ARTICLE:7.5.8.5:Lengths for Other Vent Pipes]\n\n(1) When sizing an additional circuit vent, offset relief vent, relief vent, yoke vent and the vent pipe for an interceptor, dilution tank, sanitary sewage tank, sump, or manhole, length is not taken into consideration."
        },
        {
          "id": "7.5.9",
          "title": "Air Admittance Valves",
          "content": "[ARTICLE:7.5.9.1:Air Admittance Valve as a Vent Terminal]\n\n(1) Individual vents and dual vents are permitted to terminate with a connection to an air admittance valve as provided in Articles 7.5.9.2. and 7.5.9.3. (See also Sentence 7.2.10.16.(1))\n\n[ARTICLE:7.5.9.2:Air Admittance Valves]\n(1) Air admittance valves shall only be used to vent\n(a) fixtures in buildings undergoing renovation, and\n(b) installations where connection to a vent may not be practical.\n(2) Air admittance valves shall be located\n(a) not less than 100 mm above the fixture drain being vented,\n(b) within the maximum developed length permitted for the vent, and\n(c) not less than 150 mm above insulation materials.\n(3) Air admittance valves shall\n(a) only vent fixtures located on the same storey, and\n(b) be connected to the horizontal fixture drain.\n\n[ARTICLE:7.5.9.3:Installation Conditions]\n(1) Air admittance valves shall not be installed in supply or return air plenums, or in locations where they may be exposed to freezing temperatures.\n(2) Air admittance valves shall be installed in accordance with the manufacturer's installation instructions.\n(3) Air admittance valves shall be rated for the nominal pipe size of vent pipe to which they are connected..\n(4) Installed air admittance valves shall be\n(a) accessible, and\n(b) located in a space that allows air to enter the valve.\n(5) Drainage systems shall have at least one vent that terminates to the outdoors in conformance with Sentence 7.5.6.5.(1)."
        }
      ]
    },
    {
      "id": "7.6",
      "title": "Potable Water Systems",
      "subsections": [
        {
          "id": "7.6.1",
          "title": "Arrangement of Piping",
          "content": "[ARTICLE:7.6.1.1:Design]\n(1) Fixtures supplied with separate hot and cold water controls shall have the hot water control on the left and the cold on the right.\n(1.1) Where hot and cold water are mixed and the temperature is regulated by a single, unmarked, manual control, a movement to the left shall increase the temperature and a movement to the right shall decrease the temperature.\n(2) In a hot water distribution system of a developed length of more than 30 m or supplying more than 4 storeys, the water temperature shall be maintained by\n(a) recirculation, or\n(b) a self-regulating heat tracing system.\n\n[ARTICLE:7.6.1.2:Drainage]\n\n(1) A water distribution system shall be installed so that the system can be drained or blown out with air and outlets for this purpose shall be provided.\n\n[ARTICLE:7.6.1.3:Control and Shut-Off Valves]\n(1) A building control valve shall be provided\n(a) on every water service pipe at the location where the water service pipe enters the building, or\n(b) on the water distribution system at a location immediately downstream of the point of entry treatment unit, where the building is served by a point of entry treatment unit located in the building.\n(2) Pipes that convey water from a gravity water tank or from a private water supply system shall be fitted with a shutoff valve at the source of supply.\n(2.1) Except as provided in Sentence (2.2), a drain port shall be provided on the water distribution system immediately downstream of the building control valve required by Sentence (1) and if there is a meter, the drain port shall be installed immediately downstream of the meter on the water distribution system.\n(2.2) Where the building control valve required by Sentence (1) is of NPS 1or smaller, the drain port may be an integral part of the building control valve in the form of a stop and waste valve and the drain port shall be located on the water distribution system side of the stop and waste valve.\n(3) Except for risers that serve only one dwelling unit, risers shall be provided with a shut-off valve located at the source of supply.\n(4) Water closets shall be provided with a shut-off valve on their water supply pipe.\n(5) In buildings of residential occupancy that contain more than one dwelling unit, a shut-off valve shall be installed where the water supply enters each dwelling unit, so that, when the water supply to one suite is shut off, the water supply to the remainder of the building is not interrupted.\n(6) In buildings of other than residential occupancy, shut-off valves shall be provided on the water supply to\n(a) every fixture, or\n(b) any group of fixtures in the same room, except as provided in [Sentence](#page-663-0) (4).\n(7) Pipes that supply water to a hot water tank shall be provided with a shut-off valve located close to the tank.\n(8) Where the water supply is to be metered, the installation of the meter, including the piping that is part of the meter installation and the valving arrangement for the meter installation, shall be according to the water purveyor's requirements.\n(9) For the purpose of identifying the pipe material where plastic water pipe is used underground for a service pipe, the end of the pipe inside the building shall be brought above ground for a distance not less than 300 mm and not greater than 450 mm.\n\n[ARTICLE:7.6.1.3A:Public Washrooms]\n\n(1) The water supply to each fixture in a washroom for public use shall be individually valved and each valve shall be accessible.\n\n[ARTICLE:7.6.1.3B:Tanks]\n\n(1) Every water pipe that supplies a hot water tank, pressure vessel, plumbing appliance or water using device shall be provided with a shut-off valve located close to the tank, pressure vessel, plumbing appliance or water using device.\n\n[ARTICLE:7.6.1.4:Protection for Exterior Water Supply]\n(1) Pipes that pass through an exterior wall to supply water to the exterior of the building shall be provided with\n(a) a frost-proof hydrant, or\n(b) a stop-and-waste cock located inside the building and close to the wall.\n\n[ARTICLE:7.6.1.5:Check Valves]\n\n(1) A check valve shall be installed at the building end of a water service pipe where the pipe is made of plastic that is suitable for cold water use only.\n\n[ARTICLE:7.6.1.6:Flushing Devices]\n(1) Flushing devices that serve water closets or urinals shall have sufficient capacity and be adjusted to deliver at each operation a volume of water that will thoroughly flush the fixture or fixtures they serve.\n(2) Where a manually operated flushing device is installed, it shall serve only one fixture.\n(3) Except as provided in Sentence (4), water closets and urinals shall have an integral means of limiting the maximum amount of water used in each flush cycle to that specified in Table 7.6.1.6.-A.\n(4) In buildings classified as Group C occupancy, the flush cycle for each fixture that is a water closet or urinal shall not exceed the maximum water used in each flush cycle listed for that fixture in Table 7.6.41.6.-B.\n(4.1) Sentences (3) and (4) do not apply to a fixture located in an existing building where the chief building official is satisfied that compliance with the requirement is impracticable because of maintenance or operational difficulties. (See Note A- 7.6.1.6.(4.1))\n(5) Flush-tank-type urinals shall be equipped with a device capable of preventing flush cycles when they are not in use.\n\n#### Table 7.6.1.6.-A Water Usage per Flush Cycle Forming Part of Sentence 7.6.1.6.(3)\n\n<table class=\"obc-table\"><thead><tr><th>Fixtures</th><th>Maximum Water Usage per Flush Cycle, LPF</th></tr></thead><tbody><tr><td>Water Closet (Tank Type)</td><td>6.0</td></tr><tr><td>Water Closet (Direct Flush)</td><td>6.0</td></tr><tr><td>Urinal (Tank Type)</td><td>1.9</td></tr><tr><td>Urinal (Direct Flush)</td><td>1.9</td></tr></tbody></table>\n\n#### Table 7.6.1.6.-B Water Usage per Flush Cycle for Sanitary Fixtures in a Group C Occupancy Forming Part of Sentence 7.6.1.6.(4)\n\n<table class=\"obc-table\"><thead><tr><th>Fixtures</th><th>Maximum Water Usage per Flush Cycle, LPF</th></tr></thead><tbody><tr><td>Water Closet (Tank Type)</td><td>4.8(1)</td></tr><tr><td>Water Closet (Direct Flush)</td><td>4.8</td></tr><tr><td>Urinal (Tank Type)</td><td>1.9</td></tr><tr><td>Urinal (Direct Flush)</td><td>1.9</td></tr></tbody></table>\n\n<h5 class=\"table-notes-title\">Notes to Table 7.6.1.6.-B:</h5>\n- (1) Water closets which provide a dual flush cycle option of both 4.1 LPF or less and 6.0 LPF are deemed to comply.\n\n[ARTICLE:7.6.1.7:Relief Valves]\n(1) Every pressure vessel that is part of a plumbing system or connected to a plumbing system shall be equipped with a pressure-relief valve designed to open when the water pressure in the tank reaches the rated working pressure of the tank, and so located that the pressure in the tank shall not exceed 1 100 kPa or one-half the maximum test pressure sustained by the tank, whichever is the lesser.\n(2) The hot water tank of a storage-type service water heater shall be equipped with a temperature-relief valve with a temperature-sensing element\n(a) located within the top 150 mm of the tank, and\n(b) designed to open and discharge sufficient water from the tank to keep the temperature of the water in the tank from exceeding 99°C under all operating conditions.\n(3) A pressure-relief valve and temperature-relief valve may be combined where Sentences (1) and (2) are complied with.\n(4) Indirect service water heaters shall be equipped with\n(a) a pressure-relief valve, and\n(b) a temperature-relief valve on every storage tank that forms part of the system.\n(5) Pipes that convey water from a temperature-relief, pressure-relief, or a combined temperature- and pressure-relief valve shall\n(a) be of a nominal pipe size at least equal to the NPS of the outlet of the valve,\n(b) be rigid, slope downward from the valve, and terminate with an indirect connection above a floor drain, sump, or other safe location, with an air break of not more than 300 mm,\n(c) have no thread at its outlet, and\n(d) be capable of operating at a temperature of not less than 99°C.\n(See Note A-7.6.1.7.(5))\n(6) The temperature-relief valve required in Clause (4)(b) shall\n(a) have a temperature-sensing element located within the top 150 mm of the tank, and\n(b) be designed to open and discharge sufficient water to keep the temperature of the water in the tank from exceeding 99°C under all operating conditions.\n(7) No shut-off valve shall be installed on the pipe between any tank and the relief valves or on the discharge lines from such relief valves.\n\n[ARTICLE:7.6.1.8:Solar Domestic Hot Water Systems]\n\n(1) Systems for solar heating of potable water shall be installed in conformance with CAN/CSA-F383, \"Installation of packaged solar domestic hot water systems.\"\n\n[ARTICLE:7.6.1.9:Water Hammer]\n\n(1) Provision shall be made to protect the water distribution system from the adverse effects of water hammer. (See Note A-7.6.1.9.(1))\n\n[ARTICLE:7.6.1.10:Mobile Home Water Service]\n(1) A water service pipe intended to serve a mobile home shall\n(a) be not less than NPS ¾,\n(b) terminate above ground, and\n(c) be provided with\n(i) a tamperproof terminal connection that is capable of being repeatedly connected, disconnected and sealed,\n(ii) a protective concrete pad,\n(iii) a means to protect it from frost heave, and\n(iv) a curb stop and a means of draining that part of the pipe located above the frost line when not in use.\n\n[ARTICLE:7.6.1.11:Thermal Expansion]\n(1) Where thermal expansion can occur, protection shall be provided for\n(a) check valves required by Article 7.6.1.5.,\n(b) backflow preventers required by Sentence 7.6.2.1.(3), and\n(c) pressure-reducing valves required by Article 2.6.3.3.\n(See Note A-7.6.1.11.(1))"
        },
        {
          "id": "7.6.2",
          "title": "Protection from Contamination",
          "content": "[ARTICLE:7.6.2.1:Connection of Systems]\n(1) Connections to potable water systems shall be designed and installed so that non-potable water or substances that may render the water non-potable cannot enter the system.\n(2) Reserved.\n(3) Backflow preventers shall be selected and installed in conformance with CSA B64.10, \"Selection and installation of backflow preventers.\"\n(3.1) No connection shall be made between a potable water system supplied with water from a drinking water system and any other potable water system without the consent of the water purveyor.\n\n[ARTICLE:7.6.2.2:Back-Siphonage]\n(1) Every potable water system that supplies a fixture or tank that is not subject to pressures above atmospheric shall be protected against back-siphonage by a backflow preventer.\n(2) Where a potable water supply is connected to a boiler, tank, cooling jacket, lawn sprinkler system or other device where a non-potable fluid may be under pressure that is above atmospheric or the water outlet may be submerged in the non-potable fluid, the water supply shall be protected against backflow by a backflow preventer.\n\n[ARTICLE:7.6.2.3:Backflow Caused by Back Pressure]\n(1) Except as provided in Sentence (3) and Articles 7.6.2.4. to 7.6.2.6., where a backflow preventer is required by this Subsection, the backflow preventer shall be selected, installed and tested in conformance with CSA B64.10, \"Selection and installation of backflow preventers.\"\n(2) Backflow preventers shall be provided in conformance with Sentence 7.2.10.10.(1).\n(3) Tank-type water closet valves shall be provided with a back-siphonage preventer in conformance with Sentence 7.2.10.10.(2).\n\n[ARTICLE:7.6.2.4:Backflow from Fire Protection Systems]\n(1) A backflow preventer shall not be required in residential full flow-through fire sprinkler/standpipe systems in which the pipes and fittings are constructed of potable water system materials.\n(2) Except as required by Sentence (4), potable water system connections to fire sprinkler and standpipe systems shall be protected against backflow caused by back-siphonage or back pressure in conformance with Clauses (a) to (g), as applicable:\n(a) residential partial flow-through fire sprinkler/standpipe systems in which the pipes and fittings are constructed of potable water system materials shall be protected by a dual check valve backflow preventer conforming to\n(i) CSA B64.6, \"Dual check valve (DuC) backflow preventers,\" or\n(ii) CSA B64.6.1, \"Dual check valve backflow preventers for fire protection systems (DuCF),\"\n(b) provided that the systems do not use antifreeze or other additives of any kind and that all pipes and fittings are constructed of potable water system materials, Class 1 fire sprinkler/standpipe systems shall be protected by a single or dual check valve backflow preventer conforming to\n(i) CSA B64.6, \"Dual check valve (DuC) backflow preventers,\" or\n(ii) CSA B64.9, \"Single check valve backflow preventers for fire protection systems (SCVAF),\"\n(c) provided that the systems do not use antifreeze or other additives of any kind, Class 1 fire sprinkler/standpipe systems not covered by [Clause](#page-667-0) (b) as well as Class 2 and Class 3 fire sprinkler/standpipe systems shall be protected by a double check valve backflow preventer conforming to\n(i) CSA B64.5, \"Double check valve (DCVA) backflow preventers,\" or\n(ii) CSA B64.5.1, \"Double check valve backflow preventers for fire protection systems (DCVAF),\"\n(d) Class 1, Class 2 or Class 3 Class 3 fire sprinkler/standpipe systems in which antifreeze or other additives are used shall be protected by a reduced pressure principle backflow preventer conforming to\n(i) CSA B64.4, \"Reduced pressure principle (RP) backflow preventers,\" or\n(ii) CSA B64.4.1, \"Reduced pressure principle backflow preventers for fire protection systems (RPF),\" installed on the portion of the system that uses the additives and the balance of the system shall be protected as required by Clause [\\(b\\)](#page-667-0) or [\\(c\\)](#page-667-1),\n(e) Class 4 and Class 5 fire sprinkler/standpipe systems shall be protected by a reduced pressure principle backflow preventer conforming to\n(i) CSA B64.4, \"Reduced pressure principle (RP) backflow preventers,\" or\n(ii) CSA B64.4.1, \"Reduced pressure principle backflow preventers for fire protection systems (RPF),\"\n(f) Class 6 fire sprinkler/standpipe systems shall be protected by a double check valve backflow preventer conforming to\n(i) CSA B64.5, \"Double check valve (DCVA) backflow preventers,\" or\n(ii) CSA B64.5.1, \"Double check valve backflow preventers for fire protection systems (DCVAF).\"\n(g) where a potentially severe health hazard may be caused by backflow, Class 6 fire sprinkler/standpipe systems shall be protected by a reduced pressure principle backflow preventer conforming to\n(i) CSA B64.4, \"Reduced pressure principle (RP) backflow preventers,\" or\n(ii) CSA B64.4.1, \"Reduced pressure principle backflow preventers for fire protection systems (RPF).\"\n(3) Backflow preventers required by Sentence (2) shall be installed upstream of the fire department pumper connection.\n(4) Where a reduced pressure principle backflow preventer is required on a water service pipe at a fire service connection located on the same premises as the fire service pipe in Class 3, 4, 5 and 6 fire sprinkler/standpipe systems, a reduced pressure principle backflow preventer conforming to CSA B64.4.1, \"Reduced pressure principle backflow preventers for fire protection systems (RPF),\" shall also be required on the fire service connection.\n\n[ARTICLE:7.6.2.5A:Backflow from Buildings with a Solar Domestic Hot Water System]\n(1) Except as permitted by Sentence (2) and as provided in Sentences (3) and (4), a potable water system shall be protected against backflow where the heat transfer loop of a solar domestic hot water system is directly connected to the potable water system.\n(2) Where the heat transfer loop of the solar domestic hot water system consists of direct flow-through of potable water only, protection against backflow is not required.\n(3) A potable water system that is directly connected to the heat transfer loop of a solar domestic hot water system that serves a residential occupancy within the scope of Part 9 shall be provided with a backflow preventer selected in accordance with CAN/CSA-F379.1, \"Packaged solar domestic hot water systems (liquid-to-liquid heat transfer) for allseason use.\"\n(4) Where a solar domestic hot water system includes a single wall heat exchanger and contains only a relatively harmless heat transfer fluid as described in CAN/CSA-F379.1, \"Packaged solar domestic hot water systems (liquid-toliquid heat transfer) for all-season use\", the backflow prevention required in Sentence (1) is permitted to be a dual check valve backflow preventer conforming to CSA B64.3, \"Dual Check valve backflow preventers with atmospheric port (DCAP)\".\n\n[ARTICLE:7.6.2.6:Premise Isolation]\n(1) Buildings or facilities where a moderate hazard or severe hazard may be caused by backflow shall be provided with premise isolation of the potable water system by the installation of a backflow preventer selected in accordance with Clauses 5.3.4.2.(b) and (c) of CSA B64.10, \"Selection and installation of backflow preventers.\"\n(2) Buildings of residential occupancy within the scope of Part 9 are not required to be isolated unless they have access to an auxiliary water supply.\n(3) Except as provided in Sentence (1), where no direct connection exists between the auxiliary water supply and the potable water system, premise isolation shall be provided by a dual check valve backflow preventer conforming to CSA B64.6, \"Dual check valve (DuC) backflow preventers.\"\n\n[ARTICLE:7.6.2.7:Hose Bibb]\n\n(1) Where a hose bibb is installed outside a building, inside a garage or in an area where there is an identifiable risk of contamination, the potable water system shall be protected against backflow through the hose bibb.\n\n[ARTICLE:7.6.2.8:Cleaning of Systems]\n\n(1) A newly installed part of a potable water system shall be cleaned and then flushed with potable water before the system is put into operation. (See Note A-7.6.2.8.(1))\n\n[ARTICLE:7.6.2.9:Air Gap]\n(1) An air gap shall not be located in a noxious environment.\n(2) Air gaps shall be not less than 25 mm high and at least twice the diameter of the opening of the water supply outlet in height.\n\n[ARTICLE:7.6.2.10:Vacuum Breakers]\n(1) Where the critical level is not marked on an atmospheric vacuum breaker, pressure vacuum breaker or spill-resistant pressure vacuum breaker, the critical level shall be taken as the lowest point on the device.\n(2) Where an atmospheric vacuum breaker is installed, it shall be located on the downstream side of the fixture control valve or faucet so that it will be subject to water supply pressure\n(a) only when the valve or faucet is open, and\n(b) for periods of continuous use not exceeding 12 h.\n(3) An atmospheric vacuum breaker shall be installed so that the critical level is at least the distance specified by the manufacturer for safe operation of the device, but not less than 25 mm above\n(a) the flood level rim of a fixture or tank, or\n(b) the highest point open to the atmosphere in an irrigation system.\n(4) A pressure vacuum breaker or spill-resistant pressure vacuum breaker shall be installed so that the critical level is not less than 300 mm above\n(a) the flood level rim of a fixture or tank, or\n(b) the highest point open to the atmosphere in an irrigation system.\n\n[ARTICLE:7.6.2.11:Tank-Type Water Closets]\n\n(1) Tank-type water closets shall be provided with a back-siphonage preventer in conformance with Sentence 7.2.10.10.(2)."
        },
        {
          "id": "7.6.3",
          "title": "Size and Capacity of Pipes",
          "content": "[ARTICLE:7.6.3.1:Design, Fabrication and Installation]\n(1) Water distribution systems shall be designed to provide peak demand flow when the flow pressures at the supply openings conform to the plumbing supply fitting manufacturer's specifications.\n(2) Potable water systems shall be designed, fabricated and installed in accordance with good engineering practice, such as that described in the ASHRAE Handbooks and ASPE Plumbing Engineering Design Handbooks.\n(3) Reserved.\n(4) Pipes that supply a fixture shall have a capacity that will produce a flow in the fixture that will flush the fixture and keep it in a sanitary condition.\n\n[ARTICLE:7.6.3.2:Hydraulic Load]\n(1) Except as provided in Sentence (3), the hydraulic load of a fixture or device that is listed in Table 7.6.3.2.-A shall be the number of fixture units given in the Table.\n(2) Except as provided in Sentences (1) and (3), the hydraulic load of a fixture that is not listed in Table 7.6.3.2.-A is the number of fixture units listed in Table 7.6.3.2-.D.\n(3) Where fixtures are supplied with both hot and cold water, the hydraulic loads for maximum separate demands shall be 75% of the hydraulic load of the fixture units given in Tables 7.6.3.2.-A and 7.6.3.2.-D when using a detailed engineering design method.\n(4) The hydraulic load of urinals and water closets with direct flush valves shall be the number of fixture units listed in Tables 7.6.3.2.-B and 7.6.3.2.-C. (See Note A- 7.6.3.2.(4))\n\n#### Table 7.6.3.2.-A Sizing of Water Distribution Systems(1)(2) Forming Part of Sentences 7.6.3.2.(1), (2) and (3) and 7.6.3.4.(2), (3) and (5)\n\n<table class=\"obc-table\"><thead><tr><th>Fixture<br>or Device</th><th>Minimum<br>Nominal Pipe</th><th>Private Use</th><th>fixture units</th><th>Hydraulic Load,</th><th>Public Use</th><th>fixture units</th><th>Hydraulic Load,</th></tr></thead><tbody><tr><td></td><td>Size<br>of Supply<br>Pipe, NPS</td><td>Cold</td><td>Hot</td><td>Total</td><td>Cold</td><td>Hot</td><td>Total</td></tr><tr><td>Bathroom group with 6 LPF flush tank(3)</td><td>n/a</td><td>2.7</td><td>1.5</td><td>3.6</td><td>n/a</td><td>n/a</td><td>n/a</td></tr><tr><td>Bathroom group with greater than 6 LPF<br>flush tank(3)</td><td>n/a</td><td>4</td><td>3</td><td>6</td><td>n/a</td><td>n/a</td><td>n/a</td></tr><tr><td>Bathroom group with more than 3 fixtures</td><td>n/a</td><td>n/a</td><td>n/a</td><td>(4)</td><td>n/a</td><td>n/a</td><td>n/a</td></tr><tr><td>Bathtub with or without shower head</td><td>1<br>/2</td><td>1</td><td>1</td><td>1.4</td><td>3</td><td>3</td><td>4</td></tr><tr><td>Bathtub with NPS<br>¾ spout</td><td>3<br>/4</td><td>7.5</td><td>7.5</td><td>10</td><td>7.5</td><td>7.5</td><td>10</td></tr><tr><td>Bedpan washer</td><td>1</td><td>n/a</td><td>n/a</td><td>n/a</td><td>7.5</td><td>7.5</td><td>10</td></tr><tr><td>Bidet</td><td>/8<br>3</td><td>1.5</td><td>1.5</td><td>2</td><td>n/a</td><td>n/a</td><td>n/a</td></tr><tr><td>Clothes washer, 3.5 kg</td><td>/2<br>1</td><td>1</td><td>1</td><td>1.4</td><td>2.25</td><td>2.25</td><td>3</td></tr><tr><td>Clothes washer, 6.8 kg</td><td>/2<br>1</td><td>n/a</td><td>n/a</td><td>n/a</td><td>3</td><td>3</td><td>4</td></tr><tr><td>Clothes washer, commercial(5)</td><td>n/a</td><td>n/a</td><td>n/a</td><td>n/a</td><td>n/a</td><td>n/a</td><td>n/a</td></tr><tr><td>Dental lavatory</td><td>3<br>/8</td><td>n/a</td><td>n/a</td><td>n/a</td><td>1.5</td><td>1.5</td><td>2</td></tr><tr><td>Dental unit, cuspidor</td><td>/8<br>3</td><td>n/a</td><td>n/a</td><td>n/a</td><td>1</td><td>n/a</td><td>1</td></tr><tr><td>Dishwasher, commercial(5)</td><td>n/a</td><td>n/a</td><td>n/a</td><td>n/a</td><td>n/a</td><td>n/a</td><td>n/a</td></tr><tr><td>Dishwasher, domestic</td><td>/8<br>3</td><td>n/a</td><td>1.4</td><td>1.4</td><td>n/a</td><td>n/a</td><td>n/a</td></tr><tr><td>Drinking fountain or water cooler</td><td>3<br>/8</td><td>n/a</td><td>n/a</td><td>n/a</td><td>0.25</td><td>n/a</td><td>0.25</td></tr><tr><td>Hose bibb</td><td>1<br>/2</td><td>2.5</td><td>n/a</td><td>2.5</td><td>2.5</td><td>n/a</td><td>2.5</td></tr><tr><td>Hose bibb</td><td>/4<br>3</td><td>3</td><td>n/a</td><td>3</td><td>6</td><td>n/a</td><td>6</td></tr><tr><td>Hose bibb, combination hot and cold</td><td>/2<br>1</td><td>1.9</td><td>1.9</td><td>2.5</td><td>1.9</td><td>1.9</td><td>2.5</td></tr><tr><td>Lavatory, 8.3 LPM<br>or less</td><td>/8<br>3</td><td>0.5</td><td>0.5</td><td>0.7</td><td>1.5</td><td>1.5</td><td>2</td></tr><tr><td>Lavatory, greater than 8.3 LPM</td><td>/8<br>3</td><td>0.75</td><td>0.75</td><td>1</td><td>1.5</td><td>1.5</td><td>2</td></tr><tr><td>Shower head, 9.5 LPM<br>or less per head</td><td>1<br>/2</td><td>1</td><td>1</td><td>1.4</td><td>3</td><td>3</td><td>4</td></tr><tr><td>Shower head, greater than 9.5 LPM<br>per<br>head</td><td>1<br>/2</td><td>1.5</td><td>1.5</td><td>2</td><td>3</td><td>3</td><td>4</td></tr><tr><td>Shower, spray, multi-head, fixture unit<br>per<br>head</td><td>(5)</td><td>1</td><td>1</td><td>1.4</td><td>3</td><td>3</td><td>4</td></tr><tr><td>Sink, bar</td><td>/8<br>3</td><td>0.75</td><td>0.75</td><td>1</td><td>1.5</td><td>1.5</td><td>2</td></tr><tr><td>Sink, clinic service faucet</td><td>1<br>/2</td><td>n/a</td><td>n/a</td><td>n/a</td><td>2.25</td><td>2.25</td><td>3</td></tr><tr><td>Sink, clinic service with direct flush valve</td><td>1</td><td>n/a</td><td>n/a</td><td>n/a</td><td>6</td><td>n/a</td><td>6</td></tr><tr><td>Sink, kitchen, commercial, per faucet</td><td>/2<br>1</td><td>n/a</td><td>n/a</td><td>n/a</td><td>3</td><td>3</td><td>4</td></tr><tr><td>Sink, kitchen, domestic, 8.3 LPM<br>or less</td><td>/8<br>3</td><td>1</td><td>1</td><td>1.4</td><td>1</td><td>1</td><td>1.4</td></tr><tr><td>Sink, kitchen, domestic, greater than<br>8.3<br>LPM</td><td>/8<br>3</td><td>1.5</td><td>1.5</td><td>2</td><td>1.5</td><td>1.5</td><td>2</td></tr><tr><td>Sink, laboratory</td><td>/8<br>3</td><td>n/a</td><td>n/a</td><td>n/a</td><td>1.5</td><td>1.5</td><td>2</td></tr><tr><td>Sink, laundry (1 or 2 compartments)</td><td>/8<br>3</td><td>1</td><td>1</td><td>1.4</td><td>1</td><td>1</td><td>1.4</td></tr><tr><td>Sink, service or mop basin</td><td>/2<br>1</td><td>n/a</td><td>n/a</td><td>n/a</td><td>2.25</td><td>2.25</td><td>3</td></tr><tr><td>Sink, washup, per faucet</td><td>1<br>/2</td><td>n/a</td><td>n/a</td><td>n/a</td><td>1.5</td><td>1.5</td><td>2</td></tr></tbody></table>\n\n#### Table 7.6.3.2.-A (Cont'd) Sizing of Water Distribution Systems(1)(2) Forming Part of Sentences 7.6.3.2.(1), (2) and (3) and 7.6.3.4.(2), (3) and (5)\n\n<table class=\"obc-table\"><thead><tr><th>Fixture<br>or Device</th><th>Minimum<br>Private Use<br>Nominal Pipe</th><th></th><th>Hydraulic Load,<br>fixture units</th><th></th><th>Public Use<br>Hydraulic Load,<br>fixture units</th><th></th><th></th></tr></thead><tbody><tr><td></td><td>Size<br>of Supply<br>Pipe, NPS</td><td>Cold</td><td>Hot</td><td>Total</td><td>Cold</td><td>Hot</td><td>Total</td></tr><tr><td>Urinal, with direct flush valve</td><td>/4<br>3</td><td>(6)</td><td>n/a</td><td>(6)</td><td>(6)</td><td>n/a</td><td>(6)</td></tr><tr><td>Urinal, with flush tank</td><td>/8<br>3</td><td>3</td><td>n/a</td><td>3</td><td>3</td><td>n/a</td><td>3</td></tr><tr><td>Urinal, with self-closing metering valve</td><td>1<br>/2</td><td>2</td><td>n/a</td><td>2</td><td>4</td><td>n/a</td><td>4</td></tr><tr><td>Water closet, 6 LPF or less with flush tank</td><td>/8<br>3</td><td>2.2</td><td>n/a</td><td>2.2</td><td>2.2</td><td>n/a</td><td>2.2</td></tr><tr><td>Water closet, greater than 6 LPF with<br>flush tank</td><td>/8<br>3</td><td>3</td><td>n/a</td><td>3</td><td>5</td><td>n/a</td><td>5</td></tr><tr><td>Water closet, with direct flush valve</td><td>1</td><td>(6)</td><td>n/a</td><td>(6)</td><td>(6)</td><td>n/a</td><td>(6)</td></tr></tbody></table>\n\n<h5 class=\"table-notes-title\">Notes to Table 7.6.3.2.-A:</h5>\n- (1) The fixture unit values in this Table are not applicable in certain assembly occupancies because of surges in use by the occupants. For such occupancies, refer to specific design information.\n- (2) For fixtures not indicated in this Table, refer to Table 7.6.3.2.-D.\n- (3) Bathroom group is based on NPS ½ bathtub supply pipe.\n- (4) Add additional fixture to the fixture load for bathroom group.\n- (5) Refer to the manufacturer's recommendations.\n- (6) For fixture unit values for fixtures with direct flush valves, see Sentence 7.6.3.2.(4) and Tables 7.6.3.2.-B and 7.6.3.2.-C.\n\n#### Table 7.6.3.2.-B Sizing of Water Distribution Systems for Urinals with Direct Flush Valves Forming Part of Sentences 7.6.3.2.(4) and 7.6.3.4.(5)\n\n<table class=\"obc-table\"><thead><tr><th>Number<br>of Valves</th><th>Individual Fixture Units<br>Assigned in<br>Decreasing Values</th><th>Fixture Units<br>in Accumulative Values(1)</th></tr></thead><tbody><tr><td>1</td><td>20</td><td>20</td></tr><tr><td>2</td><td>15</td><td>35</td></tr><tr><td>3</td><td>10</td><td>45</td></tr><tr><td>4</td><td>8</td><td>53</td></tr><tr><td>5 or more</td><td>5 each</td><td>58, plus 5 for each additional fixture<br>in excess of 5</td></tr></tbody></table>\n\n<h5 class=\"table-notes-title\">Notes to Table 7.6.3.2.-B:</h5>\n- (1) The accumulative fixture unit values are the total values to be used in conjunction with Table 7.6.3.2.-A.\n#### Table 7.6.3.2.-C Sizing of Water Distribution Systems for Water Closets with Direct Flush Valves Forming Part of Sentences 7.6.3.2.(4) and 7.6.3.4.(5)\n\n<table class=\"obc-table\"><thead><tr><th>Number of Valves</th><th>Individual Fixture Units<br>Assigned in<br>Decreasing Values</th><th>Fixture Units<br>in Accumulative Values(1)</th></tr></thead><tbody><tr><td>1</td><td>40</td><td>40</td></tr><tr><td>2</td><td>30</td><td>70</td></tr><tr><td>3</td><td>20</td><td>90</td></tr><tr><td>4</td><td>15</td><td>105</td></tr><tr><td>5 or more</td><td>10 for each public use,<br>and<br>6 for each private use</td><td>115, plus 10 for each public use<br>additional fixture<br>in excess of 5,<br>and<br>111, plus 6 for each private use<br>additional fixture<br>in excess of 5</td></tr></tbody></table>\n\n<h5 class=\"table-notes-title\">Notes to Table 7.6.3.2.-C:</h5>\n- (1) The accumulative fixture unit values are the total values to be used in conjunction with Table 7.6.3.2.-A.\n#### Table 7.6.3.2.-D Hydraulic Loads of Fixtures Not Listed in Table 7.6.3.2.-A Forming Part of Sentences 7.6.3.2.(2) and (3) and 7.6.3.4.(5)\n\n<table class=\"obc-table\"><thead><tr><th></th><th></th><th>Hydraulic Load, fixture units</th></tr></thead><tbody><tr><td>Nominal Pipe Size<br>of Supply Pipe,<br>NPS</td><td>Private Use</td><td>Public Use</td></tr><tr><td>⅜</td><td>1</td><td>2</td></tr><tr><td>½</td><td>2</td><td>4</td></tr><tr><td>¾</td><td>3</td><td>6</td></tr><tr><td>1</td><td>6</td><td>10</td></tr></tbody></table>\n\n[ARTICLE:7.6.3.3:Static Pressure]\n\n(1) Where the static pressure at any fixture may exceed 550 kPa, a pressure-reducing valve shall be installed to limit the maximum static pressure at the fixture to 550 kPa.\n\n[ARTICLE:7.6.3.4:Size]\n(1) Water service pipes shall be sized according to the peak demand flow but shall not be less than NPS ¾.\n(2) Except as provided in Sentence (3), the nominal pipe size of a supply pipe that serves a fixture shall conform to Table 7.6.3.2.-A.\n(3) For fixtures listed in Table 7.6.3.2.-A that are permitted to have an NPS ⅜ supply pipe, a connector not more than 750 mm long and not less than NPS ¼ may be used to supply water to the fixture.\n(4) No water system between the point of connection with the water service pipe or the water meter and the first water distribution pipe that supplies a water heater that serves more than one fixture shall be sized less than NPS ¾.\n(5) Except as permitted in Sentence (6), where both hot and cold water is supplied to fixtures in residential buildings containing one or two dwelling units or row houses with separate water service pipes, the water system may be sized in accordance with [Table 7.6.3.4.,](#page-674-0) where\n(a) the hydraulic loads for maximum separate demands on water distribution system piping are not less than 100% of the total hydraulic load of the fixture units given in Table 7.6.3.2.-A, 7.6.3.2.-B, 7.6.3.2.-C or 7.6.3.2.-D for private use,\n(b) the minimum water pressure at the entry to the building is 200 kPa, and\n(c) the total maximum length of the water system is 90 m.\n(See Note A-7.6.3.4.(5))\n(6) Where both hot and cold water is supplied to fixtures in a house containing only one dwelling unit, the water service pipe is permitted to be a minimum of NPS ¾ in provided,\n(a) a minimum NPS ¾ water supply piping located in the basement or lower level is extended to the base of every hot and cold riser that serves a maximum of one bathroom group and to the last water supply branch serving any basement bathroom group, fixture supply or hose bibb, and\n(b) the total hydraulic load is not more than 26 fixture units, using the values given in Table 7.6.3.2.-A.\n#### Table 7.6.3.4. Water Pipe Sizing for Buildings Containing One or Two Dwelling Units or Row Houses with Separate Water Service Pipes Forming Part of Sentence 7.6.3.4.(5)\n\n<table class=\"obc-table\"><thead><tr><th></th><th></th><th>Water Velocity m/s(1)</th><th></th><th></th></tr></thead><tbody><tr><td>Nominal Pipe Size<br>of Water<br>Pipe, NPS</td><td>3.0</td><td>2.4</td><td>1.5</td><td></td></tr><tr><td></td><td>Hydraulic Load, fixture units</td><td></td><td></td><td></td></tr><tr><td>½</td><td>8<br>7<br>4</td><td></td><td></td><td></td></tr><tr><td>¾</td><td>21</td><td>16</td><td>9</td><td></td></tr><tr><td>1</td><td>43</td><td>31</td><td>18</td><td></td></tr><tr><td>1¼</td><td>83</td><td>57</td><td>30</td><td></td></tr></tbody></table>\n\n<h5 class=\"table-notes-title\">Notes to Table 7.6.3.4.:</h5>\n- (1) Table 2.6.3.4. is not intended to limit water velocities that are permitted by Sentence 7.6.3.5.(1).\n\n[ARTICLE:7.6.3.5:Velocity]\n\n(1) The maximum permitted water velocities shall be those recommended by the pipe and fitting manufacturer."
        },
        {
          "id": "7.6.4",
          "title": "Water Efficiency",
          "content": "[ARTICLE:7.6.4.1:Water Supply Fittings]\n(1) Each lavatory in a washroom with fixtures for public use shall be equipped with a device capable of automatically shutting off the flow of water when the lavatory is not in use. (See Note A-7.6.4.1.(1) and (3))\n(2) An automatic compensating valve serving an individual shower head shall have a manufacturer's minimum-rated water flow rate equal to or less than the shower head it serves. (See Note A-7.6.4.1.(2))\n(3) Where multiple shower heads installed in a public showering facility are served by one temperature control, each shower head shall be equipped with a device capable of automatically shutting off the flow of water when the shower head is not in use. (See Note A-7.6.4.1.(1) and (3))"
        }
      ]
    },
    {
      "id": "7.7",
      "title": "Non-Potable Water Systems",
      "subsections": [
        {
          "id": "7.7.1",
          "title": "Non-Potable Water Systems",
          "content": "[ARTICLE:7.7.1.1:General]\n(1) Non-potable water systems shall be designed, fabricated and installed in accordance with this Subsection and good engineering practice. (See Note A-7.7.1.1.(1))\n(2) Except as provided in Sentence (3) and Subsection 7.7.2., non-potable water systems shall only be used to supply water closets, urinals, trap seal primers, and directly connected underground irrigation systems that only dispense water below the surface of the ground.\n(3) Non-potable water systems shall not be used to supply fixtures in healthcare facilities.\n(4) Where a non-potable water system is supplied by a potable water system, the potable water system shall be protected in accordance with Article 7.6.2.1.\n(5) Where the static pressure at any fixture in a non-potable water system may exceed 550 kPa, a pressure-reducing valve shall be installed to limit the maximum static pressure at the fixture to 550 kPa.\n(6) Where a clothes washer is supplied by a rainwater system and a potable water system, the potable water system shall be protected by dual check valve backflow preventers conforming to CSA B64.6, \"Dual check valve (DuC) backflow preventers\" for\n(a) area isolation, and\n(b) premise isolation.\n\n[ARTICLE:7.7.1.2:Identification and Marking]\n(0.1) Non-potable water piping shall be identified by markings that are permanent, distinct and easily recognized.\n(1) Non-potable water piping and outlets shall be identified and marked in accordance with CAN/CSA-B128.1, \"Design and Installation of Non-Potable Water Systems.\"\n(2) A sign containing the words NON-POTABLE WATER, DO NOT DRINK shall be in letters at least 25 mm high with a 5 mm stroke and posted immediately above a fixture that is permitted to receive non-potable water.\n\n[ARTICLE:7.7.1.3:Location of Pipes]\n(1) Non-potable water piping shall not be located directly above\n(a) areas where food, drink or products that are intended for human consumption are prepared, handled, dispensed or stored,\n(b) a non-pressurized or pressurized potable water tank, or\n(c) food-handling equipment.\n\n[ARTICLE:7.7.1.4:Location of Outlets]\n(1) Except as permitted in Sentence 7.1.5.3.(3), an outlet from a non-potable water system shall not be located where it can discharge into,\n- (0.a) a sink or lavatory,\n(a) a fixture into which an outlet from a potable water system is discharged, or\n\n(b) a fixture that is used for a purpose related to the preparation, handling or dispensing of food, drink or products that are intended for human consumption."
        },
        {
          "id": "7.7.2",
          "title": "Non-Potable Rainwater Harvesting Systems",
          "content": "[ARTICLE:7.7.2.1:General]\n(1) For the purposes of this Subsection, rainwater shall mean storm water discharged from an above-ground roof surface. (See Note A-7.7.2.1.(1))\n(2) For the purposes of this Subsection, a non-potable rainwater harvesting system shall mean a storage tank, a pump, pipes, fittings and other plumbing appurtenances used to collect and distribute rainwater, but shall not include a rain barrel not connected to a plumbing system.\n\n[ARTICLE:7.7.2.2:Permitted Applications]\n(1) Non-potable rainwater harvesting systems are only permitted to supply\n(a) water closets and urinals,\n(b) clothes washers,\n(c) floor-mounted service sinks and laundry trays,\n(d) trap primers,\n(e) irrigation systems,\n(f) hydronic systems,\n(g) make-up water systems for heat rejection systems, or\n(h) any other application where the harvested rainwater is not expected to be ingested or inhaled.\n\n[ARTICLE:7.7.2.3:Roof Design]\n(1) Roof surfaces that supply rainwater to a non-potable rainwater harvesting system shall be inaccessible to vehicular and pedestrian traffic. (See Note A-7.7.2.3.(1))\n(2) Roofing components and conveyance systems in contact with rainwater that is supplied to a non-potable rainwater harvesting system shall be constructed of materials that will not introduce substances into the rainwater that could adversely affect its intended end use. (See Note A-7.7.2.3.(2))\n\n[ARTICLE:7.7.2.4:Non-Potable Rainwater Harvesting System Design]\n(1) Non-potable rainwater harvesting systems and their connections shall be designed, fabricated and installed in accordance with this Subsection and good engineering practice. (See Note A-7.7.2.4.(1))\n(2) Non-potable rainwater harvesting systems shall not collect water discharged from an evaporative heat rejection system.\n(3) Non-potable rainwater harvesting systems shall be provided with a means to treat the harvested rainwater in such a manner that the quality of the delivered non-potable water conforms to appropriate provincial or territorial requirements or, in the absence of such requirements, the systems shall conform to [Sentence \\(4\\).](#page-676-0) (See Note A-7.7.2.4.(3) and (4))\n(4) Except as provided in [Sentence \\(3\\),](#page-676-1) non-potable rainwater harvesting systems shall be provided with\n(a) a water treatment system consisting of\n(i) a debris screen with a mesh size of not more than 6 mm ahead of the storage tank inlet,\n(ii) a first-flush diversion system with a capacity of not less than 0.3 L/m² of roof area ahead of the storage tank inlet,\n(iii) a calming inlet or settling chamber ahead of the storage tank inlet,\n(iv) a device to prevent the entrainment of sediment into the pump, and\n(v) where the harvested rainwater is used for an indoor application, a filter with a mesh size of not more than 50 μm ahead of the storage tank inlet, or\n(b) a means to treat the harvested rainwater in such a manner that the delivered non-potable water contains not more than the maximum acceptable levels of contaminants stated in CSA B805 / ICC 805, \"Rainwater harvesting systems.\" (See Note A-7.7.2.2.(1) and 7.7.2.4.(3) and (4))\n(5) Where the static pressure at any fixture in a non-potable rainwater harvesting system may exceed 550 kPa, a pressure-reducing valve shall be installed to limit the maximum static pressure at the fixture to 550 kPa.\n(6) Storage tanks in non-potable rainwater harvesting systems shall be designed and installed in accordance with\n(a) CAN/CSA-B126.0, \"General requirements and methods of testing for water cisterns,\" and\n(b) CAN/CSA-B126.1, \"Installation of water cisterns.\"\n(7) Storage tanks in non-potable rainwater harvesting systems shall be equipped with an overflow that directs excess rainwater to\n(a) a public storm sewer,\n(b) a public combined sewer,\n(c) a storm water management system, or\n(d) a designated storm water disposal location.\n(8) Where the storage tank outlet is located below the level of the adjoining street, the storage tank overflow required by [Sentence \\(7\\)](#page-677-0) shall\n(a) with an indirect connection that is not located within the building, or\n(b) be equipped with a backwater valve.\n(9) Make-up water connections to non-potable rainwater harvesting systems shall\n(a) be equipped with a reduced pressure principle backflow preventer, or\n(b) have an air gap.\n(10) Where a fixture combines water from a non-potable rainwater harvesting system and potable water at the fixture supply fitting, the potable water system shall be protected by a backflow preventer as described in Sentence 7.6.2.1.(3)."
        },
        {
          "id": "7.7.3",
          "title": "Non-Potable Water Systems for Re-Use Purposes",
          "content": "[ARTICLE:7.7.3.1:Conformance to Standards]\n(1) Except as provided in Article 7.7.2.4., non-potable water systems for re-use purposes shall be designed, constructed and installed to conform to good engineering practice appropriate to the circumstances such as described in\n(a) the ASHRAE Handbooks,\n(b) ASPE Data Books, or\n(c) CAN/CSA-B128.1, \"Design and Installation of Non-Potable Water Systems.\""
        }
      ]
    }
  ]
}