{
  "id": "2",
  "title": "Objectives",
  "division": "A",
  "sections": [
    {
      "id": "2.1",
      "title": "Application",
      "subsections": [
        {
          "id": "2.1.1",
          "title": "Application",
          "content": "[ARTICLE:2.1.1.1:Application]\n\n(1) This Part applies to all buildings covered in this Code. (See Article 1.1.1.1.)\n\n[ARTICLE:2.1.1.2:Application of Objectives]\n\n(1) The objectives described in this Part apply\n(a) to all buildings covered in this Code, and (See Article 1.1.1.1.)\n(b) only to the extent that they relate to compliance with this Code as required in Article 1.2.1.1."
        }
      ]
    },
    {
      "id": "2.2",
      "title": "Objectives",
      "subsections": [
        {
          "id": "2.2.1",
          "title": "Objectives",
          "content": "[ARTICLE:2.2.1.1:Objectives]\n\n(1) The objectives of this Code are as follows: (See Note A-2.2.1.1.(1))\n\nOS Safety\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of the building, a person in or adjacent to the building will be exposed to an unacceptable risk of injury.\n\nOS1 Fire Safety\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of the building, a person in or adjacent to the building will be exposed to an unacceptable risk of injury due to fire. The risks of injury due to fire addressed in this Code are those caused by—\n\n- OS1.1 fire or explosion occurring\n- OS1.2 fire or explosion impacting areas beyond its point of origin\n- OS1.3 collapse of physical elements due to a fire or explosion\n- OS1.4 fire safety systems failing to function as expected\n- OS1.5 persons being delayed in or impeded from moving to a safe place during a fire emergency\n\nOS2 Structural Safety\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of the building, a person in or adjacent to the building will be exposed to an unacceptable risk of injury due to structural failure. The risks of injury due to structural failure addressed in this Code are those caused by—\n\n- OS2.1 loads bearing on the building elements that exceed their loadbearing capacity\n- OS2.2 loads bearing on the building that exceed the loadbearing properties of the supporting medium\n- OS2.3 damage to or deterioration of building elements\n- OS2.4 vibration or deflection of building elements\n- OS2.5 instability of the building or part thereof\n- OS2.6 collapse of the excavation\n\nOS3 Safety in Use\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of the building, a person in or adjacent to the building will be exposed to an unacceptable risk of injury due to hazards. The risks of injury due to hazards addressed in this Code are those caused by—\n\n- OS3.1 tripping, slipping, falling, contact, drowning or collision\n- OS3.2 contact with hot surfaces or substances\n- OS3.3 contact with energized equipment\n- OS3.4 exposure to hazardous substances\n- OS3.5 exposure to high levels of sound from fire alarm systems\n- OS3.6 persons becoming trapped in confined spaces\n- OS3.7 persons being delayed in or impeded from moving to a safe place during an emergency (See Note A-2.2.1.1.(1))\n\nOS4 Resistance to Unwanted Entry\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of the building, a person in the building will be exposed to an unacceptable risk of injury due to the building's  low level of resistance to unwanted entry. The risks of injury due to unwanted entry addressed in this Code are those caused by—\n\n- OS4.1 intruders being able to force their way through locked doors or windows\n- OS4.2 occupants being unable to identify potential intruders as such\n\nOH Health\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of the building, a person will be exposed to an unacceptable risk of illness.\n\nOH1 Indoor Conditions\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of the building, a person in the building will be exposed to an unacceptable risk of illness due to indoor conditions. The risks of illness due to indoor conditions addressed in this Code are those caused by —\n\n- OH1.1 inadequate indoor air quality\n- OH1.2 inadequate thermal comfort\n- OH1.3 contact with moisture\n\nOH2 Sanitation\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of the building, a person in the building will be exposed to an unacceptable risk of illness due to unsanitary conditions. The risks of illness due to unsanitary conditions addressed in this Code are those caused by—\n\n- OH2.1 exposure to human or domestic waste\n- OH2.2 consumption of contaminated water\n- OH2.3 inadequate facilities for personal hygiene\n- OH2.4 contact with contaminated surfaces\n- OH2.5 contact with vermin and insects\n- OH2.6 unsanitary conditions caused by exposure to human or domestic waste\n\nOH3 Noise Protection\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of the building, a person in the building will be exposed to an unacceptable risk of illness due to high levels of sound originating in adjacent spaces in the building. The risks of illness due to high levels of sound addressed in this Code are those caused by—\n\nOH3.1 – exposure to airborne sound transmitted through assemblies separating dwelling units from adjacent spaces in the building.\n\nOH4 Vibration and Deflection Limitation\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of the building, a person in the building will be exposed to an unacceptable risk of illness due to high levels of vibration or deflection of building elements.\n\nOH5 Hazardous Substances Containment\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of the building, the public will be exposed to an unacceptable risk of illness due to the release of hazardous substances from the building.\n\nOH6 Privacy\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of a building, a person in the building will be provided with an unacceptable level of privacy.\n\nOH7 View to the Outdoors\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of the building, a person in the building will be unable to experience a view to the outdoors.\n\nOA Accessibility\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of the building, a person with a physical or sensory limitation will be unacceptably impeded from accessing or using the building or its facilities.\n\nOA1 Barrier-Free Path of Travel\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of the building, a person with a physical or sensory limitation will be unacceptably impeded from accessing the building or circulating within it.\n\nOA2 Barrier-Free Facilities\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of the building, a person with a physical or sensory limitation will be unacceptably impeded from using the building's facilities.\n\nOP Fire, Structural, Water and Sewage Protection of Buildings\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of the building, the building or adjacent buildings will be exposed to an unacceptable risk of damage due to fire or structural insufficiency, or the building or part thereof will be exposed to an unacceptable risk of loss of use also due to structural insufficiency.\n\nOP1 Fire Protection of the Building\n\nAn objective of this Code is to limit the probability that, as a result of its design or construction, the building will be exposed to an unacceptable risk of damage due to fire. The risks of damage due to fire addressed in this Code are those caused by—\n\n- OP1.1 fire or explosion occurring\n- OP1.2 fire or explosion impacting areas beyond its point of origin\n- OP1.3 collapse of physical elements due to a fire or explosion\n- OP1.4 fire safety systems failing to function as expected\n\nOP2 Structural Sufficiency of the Building\n\nAn objective of this Code is to limit the probability that, as a result of its design or construction, the building or part thereof will be exposed to an unacceptable risk of damage or loss of use due to structural failure or lack of structural serviceability. The risks of damage and of loss of use due to structural failure or lack of structural serviceability addressed in this Code are those caused by—\n\n- OP2.1 loads bearing on the building elements that exceed their loadbearing capacity\n- OP2.2 loads bearing on the building that exceed the loadbearing properties of the supporting medium\n- OP2.3 damage to or deterioration of building elements\n- OP2.4 vibration or deflection of building elements\n- OP2.5 instability of the building or part thereof\n- OP2.6 instability or movement of the supporting medium\n\nOP3 Protection of Adjacent Buildings from Fire\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of the building, adjacent buildings will be exposed to an unacceptable risk of damage due to fire. The risks of damage to adjacent buildings due to fire addressed in this Code are those caused by—\n\nOP3.1 – fire or explosion impacting areas beyond the building of origin\n\nOP4 Protection of Adjacent Buildings from Structural Damage\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of the building, adjacent buildings will be exposed to an unacceptable risk of structural damage. The risks of structural damage to adjacent buildings addressed in this Code are those caused by—\n\n- OP4.1 settlement of the medium supporting adjacent buildings\n- OP4.2 collapse of the building or portion thereof onto adjacent buildings\n- OP4.3 impact of the building on adjacent buildings\n- OP4.4 collapse of the excavation\n\nOP5 Water and Sewage Protection of Buildings and Facilities\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of a building, a building will be exposed to unacceptable risk of damage due to leakage of service water or sewage.\n\nOR Resource Conservation\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of a building, a resource will be exposed to an unacceptable risk of depletion or the capacity of the infrastructure supporting the use, treatment or disposal of the resource will be exposed to an unacceptable risk of being exceeded.\n\nOR1 Water and Energy Conservation\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of a building, a resource will be exposed to an unacceptable risk of depletion. The risks of resource depletion addressed in this Code are those caused by—\n\n- OR1.1 the consumption of water\n- OR1.2 the consumption of energy\n\nOR2 Infrastructure Capacity\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of a building the capacity of the infrastructure supporting the use, treatment or disposal of a resource will be exposed to an unacceptable risk of being exceeded. The risks of exceeding capacity addressed in this Code are those caused by—\n\nOR2.1 – excessive demand on the infrastructure\n\nOE Environmental Integrity\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction or operation of the building, the natural environment will be exposed to an unacceptable risk of degradation\n\nOE1 Air Quality\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of a building, the natural environment will be exposed to an unacceptable risk of degradation due to emissions of greenhouse gases into the air. The risks of degradation addressed in this Code are those caused by—\n\nOE1.1 – emissions of greenhouse gases into the air\n\nOE1.2 – the release of contaminants, other than greenhouse gases, into the air\n\nOE2 Water and Soil Quality\n\nAn objective of this Code is to limit the probability that, as a result of the design or construction of a building, the natural environment will be exposed to an unacceptable risk of degradation due to excessive release of contaminants into water or soil.\n\nOC Conservation of Buildings\n\nAn objective of this Code is to limit the probability that, as a result of the extension, material alteration or repair of an existing building or a change in use of an existing building, the existing building cannot be acceptably conserved."
        }
      ]
    }
  ]
}