{
  "id": "6",
  "title": "Heating, Ventilating and Air-Conditioning",
  "sections": [
    {
      "id": "6.1",
      "title": "General",
      "subsections": [
        {
          "id": "6.1.1",
          "title": "Application",
          "content": "[ARTICLE:6.1.1.1:Scope]\n(1) The scope of this Part shall be as described in Subsection 1.3.3. of Division A.\n(2) Where the method of operation of an existing heating, ventilating or air-conditioning system is altered, the repair or component replacements that change the capacity or extent of safety of the system shall conform to this Code. (See Note A-6.1.1.1.(2))\n\n[ARTICLE:6.1.1.2:Application]\n\n(1) This Part applies to systems and equipment for heating, ventilating and air-conditioning services."
        },
        {
          "id": "6.1.2",
          "title": "Definitions",
          "content": "[ARTICLE:6.1.2.1:Defined Terms]\n\n(1) Words that appear in italics are defined in Article 1.4.1.2. of Division A."
        }
      ]
    },
    {
      "id": "6.2",
      "title": "Design and Installation",
      "subsections": [
        {
          "id": "6.2.1",
          "title": "General",
          "content": "[ARTICLE:6.2.1.1:Good Engineering Practice]\n(1) Heating, ventilating and air-conditioning systems, including mechanical refrigeration equipment, shall be designed, constructed and installed in conformance with good engineering practice such as that described in, but not limited to,\n(a) the ASHRAE Handbooks and Standards,\n(b) the HRAI Digest,\n(c) the Hydronics Institute Manuals,\n(d) the NFPA Standards,\n(e) the SMACNA Manuals,\n(f) the ACGIH manual entitled \"Industrial Ventilation: A Manual of Recommended Practice for Design,\"\n(g) CSA B214, \"Installation code for hydronic heating systems,\"\n(h) CAN/CSA-Z317.2, \"Special requirements for heating, ventilation, and air-conditioning (HVAC) systems in health care facilities,\"\n(i) EPA 625/R-92/016, \"Radon Prevention in the Design and Construction of Schools and Other Large Buildings,\" and\n(j) ASHRAE Guideline 12, \"Minimizing the Risk of Legionellosis Associated with Building Water Systems.\"\n\n[ARTICLE:6.2.1.1A:Design Indoor Air Temperatures]\n(1) Buildings classified as Group B, Division 2 or 3 occupancies or Group C residential occupancies that are intended for use in the winter months on a continuing basis shall be insulated and be equipped with heating facilities that are capable of maintaining an indoor air temperature of 22°C at the outside winter design temperature referred to in Article 6.2.1.2.\n(2) All other buildings intended for occupancy in the winter months on a continuing basis should be insulated and shall be equipped with heating facilities to maintain a minimum indoor air temperature of 18°C or commensurate with the use of the building at the outside winter design temperature described in Article 6.2.1.2.\n\n[ARTICLE:6.2.1.2:Outdoor Design Conditions]\n\n(1) The outdoor conditions to be used in designing heating, ventilating and air-conditioning systems shall be determined in conformance with MMAH Supplementary Standard SB-1, \"Climatic and Seismic Data.\"\n\n[ARTICLE:6.2.1.3:Expansion, Contraction and System Pressure]\n\n(1) Heating and cooling systems shall be designed to allow for expansion and contraction of the heat transfer fluid and to maintain the system pressure within the rated working pressure limits of all components of the system.\n\n[ARTICLE:6.2.1.4:Structural Movement]\n\n(1) Mechanical systems and equipment shall be designed and installed to accommodate the maximum relative structural movement provided for in the construction of the building.\n\n[ARTICLE:6.2.1.5:Installation Standards]\n(1) The installation of solid fuel-burning appliances for central heating systems shall comply with CSA B365, \"Installation code for solid-fuel-burning appliances and equipment\" and the manufacturer's installation instructions.\n(2) The solid fuel-fired appliances in Sentence (1) shall conform to CSA B366.1, \"Solid-fuel-fired central heating appliances.\"\n(3) The design and installation of earth energy systems shall conform to CAN/CSA-C448.2, \"Design and installation of earth energy systems for residential and other small buildings,\" where such systems use groundwater, submerged heat exchangers or ground heat exchangers to serve,\n(a) a house with or without a secondary unit, or,\n(b) a building, a house with or without a secondary unit, where the conditioned space is not more than 1 400 m².\n(4) Except for a house with or without a secondary unit, the design and installation of earth energy systems shall conform to CAN/CSA-C448.1, \"Design and installation of earth energy systems for commercial and institutional buildings,\" where such systems use groundwater, submerged heat exchangers or ground heat exchangers to condition a floor space area more than 1 400 m².\n(5) The design and installation of solid fuel-burning stoves, ranges and space heaters, including the requirements for combustion air, shall conform to the requirements of CSA B365, \"Installation code for solid-fuel-burning appliances and equipment\" and the manufacturer's installation instructions.\n(6) The design and installation of hydronic heating systems shall conform to\n(a) CSA B214, \"Installation code for hydronic heating systems,\" or\n(b) good engineering practice appropriate to the circumstances such as described in Article 6.2.1.1.\n(7) Solid fuel-burning stoves, furnaces and hydronic heating systems designed to burn solid fuels, other than coal, shall conform to the particulate emission limits of,\n(a) CSA B415.1, \"Performance Testing of Solid-Fuel-Burning Heating Appliances,\" or\n(b) the \"Standards of Performance for New Residential Wood Heaters,\" set out in Subpart AAA of Part 60 of Title 40 of the Code of Federal Regulations, published by the United States Environmental Protection Agency, as it read on March 16, 2015.\n\n[ARTICLE:6.2.1.6:Installation ─ General]\n(1) Equipment requiring periodic maintenance and forming part of a heating, ventilating or air-conditioning system shall be installed with provision for access for inspection, maintenance, repair and cleaning. (See Note A-6.2.1.6.(1)\n(2) Mechanical equipment shall be provided with guards so as to prevent injury.\n(3) Heating, ventilating or air-conditioning systems shall be protected from freezing if they may be adversely affected by freezing temperatures.\n\n[ARTICLE:6.2.1.7:Asbestos]\n\n(1) Asbestos shall not be used in heating, ventilating or air-conditioning systems or equipment.\n\n[ARTICLE:6.2.1.8:Combustible Tubing]\n\n(1) Combustible tubing for pneumatic controls may be used in buildings required to be of noncombustible construction provided it has an outside diameter not exceeding 10 mm."
        },
        {
          "id": "6.2.2",
          "title": "Incinerators",
          "content": "[ARTICLE:6.2.2.1:Applicable Standard]\n\n(1) The design, construction, installation and material alteration of every indoor incinerator shall conform to NFPA 82, \"Standard on Incinerators and Waste and Linen Handling Systems and Equipment.\""
        },
        {
          "id": "6.2.3",
          "title": "Solid Fuel Storage",
          "content": "[ARTICLE:6.2.3.1:Solid Fuel Storage Bins]\n(1) A storage bin for solid fuel shall not be located above a sewer opening or drain opening.\n(2) Storage bins for solid fuel shall be designed and constructed so that the air temperature in the bin or the surface temperature of any part of the floor or walls is below 50°C."
        }
      ]
    },
    {
      "id": "6.3",
      "title": "Ventilation Systems",
      "subsections": [
        {
          "id": "6.3.1",
          "title": "Ventilation",
          "content": "[ARTICLE:6.3.1.1:Required Ventilation]\n(1) Except as provided in [Sentence](#page-579-2) (4), all buildings shall be ventilated in accordance with this Section.\n(2) Except in storage garages and repair garages covered by Article [6.3.1.3.,](#page-579-3) outdoor air shall be supplied to buildings for ventilation purposes in accordance with one of the following Sections of ANSI/ASHRAE 62.1, \"Ventilation for Acceptable Indoor Air Quality,\"\n(a) Section 6.2, Ventilation Rate Procedure, excluding the exception stated in Section 6.2.7.1.2 and note H of Table 6.2.2.1,\n(b) Section 6.3, Indoor Air Quality Procedure, or\n(c) Section 6.4, Natural Ventilation Procedure, excluding residential occupancies.\n(3) Except in storage garages and repair garages covered by [Article 6.3.1.3.,](#page-579-3) exhaust ventilation shall be provided in accordance with Section 6.5, Exhaust Ventilation, of ANSI/ASHRAE 62.1, \"Ventilation for Acceptable Indoor Air Quality,\" as a minimum.\n(4) Self-contained heating-season mechanical ventilation systems serving only one dwelling unit shall comply with Subsection 9.32.3.\n(5) Live/work units shall be mechanically ventilated in accordance with the requirements of Sentence (1).\n\n[ARTICLE:6.3.1.1A:Natural Ventilation]\n(1) Except as permitted by Sentence (2), the ventilation required by Article 6.3.1.1. shall be provided by mechanical ventilation except that it can be provided by natural ventilation or a combination of natural and mechanical ventilation in\n(a) buildings of other than residential occupancy having an occupant load of not more than one person per 40 m² during normal use,\n(b) buildings of industrial occupancy where the nature of the process contained in them permits or requires the use of large openings in the building envelope even during the winter, or\n(c) seasonal buildings not intended to be occupied during the winter.\n(2) Where climatic conditions permit, buildings containing occupancies other than residential occupancies, may be ventilated by natural ventilation methods in lieu of mechanical ventilation where engineering data demonstrates that such a method will provide the required ventilation for the type of occupancy.\n\n[ARTICLE:6.3.1.2:Crawl Spaces and Attic or Roof Spaces]\n\n(1) Unconditioned and unoccupied crawl spaces and attic or roof spaces shall be ventilated by natural or mechanical means as required by Part 5. (See Note A-6.3.1.2.(1))\n\n[ARTICLE:6.3.1.3:Ventilation of Storage and Repair Garages]\n(1) Except as provided in Sentence[s \\(4\\)](#page-580-0) an[d \\(6\\),](#page-580-1) an enclosed storage garage for five or more motor vehicles shall have a mechanical ventilation system designed to\n(a) limit the concentration of carbon monoxide to not more than 100 parts per million parts of air,\n(b) limit the concentration of nitrogen dioxide to not more than 3 parts per million parts of air, where the majority of the vehicles stored are powered by diesel-fuelled engines, or\n(c) provide, during operating hours, a continuous supply of outdoor air at a rate of not less than 3.9 L/s for each square metre of floor area (see Article 3.3.1.21.).\n(See Note A-6.3.1.3.(1)) (See also Sentence 3.3.5.4.(4))\n(2) Mechanical ventilation systems provided in accordance wit[h Clause \\(1\\)\\(a\\)](#page-579-4) shall be controlled automatically by carbon monoxide monitoring devices, and systems provided in accordance wit[h Clause \\(1\\)\\(b\\)](#page-579-5) shall be controlled by nitrogen dioxide or other acceptable monitoring devices. (See Note A-6.3.1.3.(2))\n(3) Mechanical ventilation systems provided in accordance with [Sentence \\(1\\)](#page-579-6) shall be designed such that the pressure in the storage garage is less than the pressure in adjoining buildings of other occupancy, or in adjacent portions of the same building having a different occupancy.\n(4) In storage garages subject to the requirements of Sentence [\\(1\\),](#page-579-6) where motor vehicles are parked by mechanical means, the ventilation requirements may be reduced by one half.\n(5) Except as provided in [Sentence \\(6\\),](#page-580-1) ticket and attendant booths of storage garages shall be pressurized with a supply of uncontaminated air.\n(6) The requirements of Sentences [\\(1\\)](#page-579-6) to [\\(5\\)](#page-580-2) shall not apply to open-air storeys in a storage garage.\n(7) A repair garage shall have a mechanical ventilation system designed to limit the exposure of workers to,\n(a) carbon monoxide to below the time weighted average concentration of 25 parts per million for a normal 8 hour workday or 40 hour work week, and\n(b) nitrogen dioxide from diesel powered vehicles to below 0.72 parts per million for a normal 8 hour workday or 40 hour work week.\n(8) In a repair garage, when a repair bay is not immediately adjacent to an outside garage door opening, a system capable of providing continuous general ventilation of not less than 700 L/s per internal bay shall be provided.\n(9) The general ventilation system described in Sentence (8) shall be designed to,\n(a) operate continuously, or\n(b) be controlled automatically by carbon monoxide monitoring devices, located so as to provide full protection throughout the repair garage.\n(10) The general ventilation system described in Sentence (8) is not required when tail pipes of vehicles are directly connected to local mechanical exhaust systems that terminate outdoors.\n\n[ARTICLE:6.3.1.4:Heat Recovery Ventilators]\n\n(1) Heat recovery ventilators with rated capacities of not less than 25 L/s and not more than 200 L/s shall be installed in accordance with Subsection 9.32.3.\n\n[ARTICLE:6.3.1.5:Indoor Air Contaminants]\n(1) Air contaminants of concern within buildings shall\n(a) be removed insofar as is possible at their points of origin, and\n(b) not be permitted to accumulate in concentrations greater than those permitted by good engineering practice such as that described in the publications listed in Sentence 6.2.1.1.(1), measured using the methodology described therein.\n(2) Systems serving spaces that contain sources of contamination and systems serving other occupied parts of the building but located in or running through spaces that contain sources of contamination shall be designed in such a manner as to prevent the spread of such contamination to other occupied parts of the building.\n(3) Heating, ventilating and air-conditioning systems shall be designed to minimize the growth and spread of biocontaminants.\n\n(4) Mechanical rooms containing refrigeration equipment shall be ventilated in accordance with CSA B52, \"Mechanical refrigeration code\".\n\n[ARTICLE:6.3.1.6:Commercial Cooking Equipment]\n\n(1) Except as provided in Article 3.6.3.5., all commercial cooking equipment shall be provided with ventilation systems designed, constructed and installed to conform to NFPA 96, \"Standard for Ventilation Control and Fire Protection of Commercial Cooking Operations.\""
        },
        {
          "id": "6.3.2",
          "title": "Air Duct Systems",
          "content": "[ARTICLE:6.3.2.1:Application]\n\n(1) This Subsection applies to the design, construction and installation of air duct distribution systems serving heating, ventilating and air-conditioning systems other than those in dwelling units covered by Part 9.\n\n[ARTICLE:6.3.2.2:Drain Pans]\n(1) HVAC systems that generate condensate or introduce liquid water into the airstream in the ducts shall be equipped with drain pans that are\n(a) designed in accordance with Section 5.10, Drain Pans, of ANSI/ASHRAE 62.1, \"Ventilation for Acceptable Indoor Air Quality,\"\n(b) provided with an outlet that is piped to the outside of the airstream in a location where condensate can be safely disposed of,\n(c) installed so that water does not stagnate and drains from the pan, and\n(d) provided with a drain line that is indirectly connected to a drainage system in accordance with Article 7.4.2.1.\n\n[ARTICLE:6.3.2.3:Materials in Air Duct Systems]\n(1) All ducts, duct connectors, associated fittings and plenums used in air duct systems shall be constructed of materials as described in Article 3.6.5.1.\n(2) Ducts that are used in a location where they may be subjected to excessive moisture shall have no appreciable loss of strength when wet and shall be resistant to moisture-induced corrosion.\n(3) All ductwork and fittings shall be constructed and installed as recommended in SMACNA Manuals and ASHRAE Standards.\n(4) All duct materials shall be suitable for exposure to the temperature and humidity of the air being carried and shall be resistant to corrosion caused by contaminants in the air being conveyed in the duct.\n\n[ARTICLE:6.3.2.4:Connections in Air Duct Systems]\n\n(1) Air duct systems shall have tight-fitting connections throughout.\n\n[ARTICLE:6.3.2.5:Duct Coverings, Linings, Adhesives and Insulation]\n(1) Coverings, linings and associated adhesives and insulation used in air ducts, plenums and other parts of air duct systems shall comply with Article 3.6.5.4.\n(2) Duct linings shall be installed so that they will not interfere with the operation of volume or balancing dampers or of fire dampers, fire stop flaps and other closures.\n\n[ARTICLE:6.3.2.6:Clearance of Ducts and Plenums]\n\n(1) The clearance of ducts and plenums from combustible materials shall comply with Article 3.6.5.6.\n\n[ARTICLE:6.3.2.6A:Construction and Installation of Ducts and Plenums]\n(1) Rectangular panels in plenums and ducts more than 300 mm wide shall be shaped to provide sufficient stiffness.\n(2) Where the installation of heating supply ducts in walls and floors creates a space between the duct and construction material, the space shall be fire stopped with noncombustible material at each end.\n(3) Ducts shall be securely supported by metal hangers, straps, lugs or brackets, except that where zero clearance is permitted, wooden brackets may be used.\n(4) All round duct joints shall be tight-fitting and lapped not less than 25 mm.\n(5) Rectangular duct connections shall be made with S and drive cleats.\n(6) Trunk supply ducts shall not be nailed directly to wood members.\n(7) Branch ducts shall be supported at suitable spacings to maintain alignment and prevent sagging.\n(8) Ducts in or beneath concrete slabs-on-ground shall be watertight, corrosion-, decay- and mildew-resistant.\n(9) Where a supply or return duct is not protected by an insulated exterior wall or where the duct is exposed to an unheated space it shall be insulated to prevent condensation.\n\n[ARTICLE:6.3.2.7:Interconnection of Systems]\n(1) In a residential occupancy, air from one suite shall not be circulated to any other suite or to a public corridor.\n(2) Except as permitted by Sentences (3) and 6.3.2.10.(6), air duct systems serving storage garages shall not be directly interconnected with other parts of the building.\n(3) Exhaust ducts referred to in [Sentence 6.3.2.10.\\(10\\)](#page-584-0) are permitted to exhaust through an enclosed storage garage prior to exhausting to the outdoors, provided\n(a) the storage garage exhaust system runs continuously,\n(b) the capacity of the storage garage exhaust system is equal to or exceeds the volume of the exhaust entering the garage, and\n(c) a leakage rate 1 smoke/fire damper rated in accordance with CAN/ULC-S112.1, \"Standard for Leakage Rated Dampers for Use in Smoke Control Systems,\" is provided near the duct outlet location in the storage garage to prevent air from the storage garage from entering the exhaust ductwork system in the event the building's exhaust fan is shut down.\n(4) Except for corridors conforming to Sentence 3.3.1.4.(4) or as permitted in Sentences (5) and (6), a public corridor or corridor serving the public shall not be used as a portion of a supply, return or exhaust air system serving adjoining areas, other than as part of a supply air system serving toilet rooms, bathrooms, shower rooms and similar auxiliary spaces opening directly to the public corridor or corridor used by the public.\n(5) A public corridor may be used as part of an engineered smoke control system.\n(6) Infiltration due to corridor pressurization is permitted into a residential occupancy from a public corridor.\n\n[ARTICLE:6.3.2.8:Makeup Air]\n(1) In ventilating systems that exhaust air to the outdoors, provision shall be made for the admission of a supply of makeup air in sufficient quantity so that the operation of the exhaust system and other exhaust equipment or combustion equipment is not adversely affected.\n(2) Makeup air facilities required by Sentence (1) shall be interlocked with the exhaust devices they serve so that both operate together.\n(3) Where makeup air facilities are intended to introduce air directly from the outdoors to occupied parts of the building in winter, they shall incorporate means of tempering that air to maintain the indoor design temperature.\n\n[ARTICLE:6.3.2.9:Supply, Return, Intake and Exhaust Air Openings]\n(1) Supply, return and exhaust air openings located less than 2 m above the floor in rooms or spaces in buildings shall be protected by grilles having openings of a size that will not allow the passage of a 15 mm diam sphere.\n(2) Outdoor air intakes shall be located so that\n(a) the quality of the air entering the building complies with Sentences 6.2.1.2.(2) and (3), and\n(b) they are separated a minimum distance from sources of contaminants in accordance with Table 6.3.2.9.\n(3) Outdoor air intakes shall be installed not less than 0.3 m above roofs, landscape grades or other surfaces, taking into account anticipated snow accumulation levels.\n(4) Exterior openings for outdoor air intakes and exhaust outlets shall be shielded from the entry of snow and rain and shall be fitted with corrosion-resistant screens of mesh having openings not larger than 15 mm, except where experience has shown that climatic conditions require larger openings to prevent the screen openings from icing over.\n(5) Screens required in Sentence (4) shall be accessible for maintenance.\n(6) Combustible grilles, diffusers and other devices covering supply, return, intake and exhaust openings shall comply with Article 3.6.5.7.\n#### Table 6.3.2.9. Minimum Distances of Air Intakes from Sources of Contaminants Forming Part of Sentence 6.3.2.9.(2)\n\n<table class=\"obc-table\"><thead><tr><th>Source of Contaminants</th><th>Minimum Distance of<br>Outdoor Air Intake, m</th><th></th></tr></thead><tbody><tr><td>Garage entry of a garage for 5 or more motor vehicles, automobile loading area and drive-in queue</td><td>4.5</td><td></td></tr><tr><td>Truck loading area or dock, and bus parking</td><td>7.6</td><td></td></tr><tr><td>Driveway, parking space, lane, road and similar locations that carry a low volume of traffic</td><td>1.5</td><td></td></tr><tr><td>Thoroughfare, arterial road, freeway, highway<br>and similar locations that carry a high volume of traffic</td><td>7.6</td><td></td></tr><tr><td>Garbage storage/pick-up area and dumpsters</td><td>4.5</td><td></td></tr><tr><td>Discharge from evaporative heat rejection systems</td><td>7.6</td><td></td></tr><tr><td>Sanitary vent</td><td>3.5</td><td></td></tr><tr><td>Kitchen exhaust outlet</td><td>3.0</td><td></td></tr><tr><td>Vent for combustion products from solid fuel-burning appliances</td><td>3.0</td><td></td></tr></tbody></table>\n\n[ARTICLE:6.3.2.10:Exhaust Ducts and Outlets]\n(1) Except as provided in Sentence (2), exhaust ducts of non-mechanical ventilating systems serving separate rooms or spaces shall not be combined.\n(2) Exhaust ducts of non-mechanical ventilating systems serving similar occupancies may be combined immediately below the point of final delivery to the outdoors, such as at the base of a roof ventilator.\n(3) Exhaust ducts of ventilating systems shall have provision for the removal of condensation where this may be a problem.\n(4) Exhaust outlets shall be designed to prevent back draft under wind conditions.\n(5) Except as permitted in Sentence (6), exhaust systems shall discharge directly to the outdoors. (See Note A-6.3.2.10.(5) and (6))\n(6) Exhaust systems are permitted to exhaust into a storage garage, provided\n(a) they serve rooms that are accessible only from that storage garage,\n(b) the exhaust contains no contaminants that would adversely affect the air quality in the storage garage, and (See Note A-6.3.2.10.(6)(b))\n(c) they are designed in accordance with Sentence 6.3.2.7.(3).\n\n(See Note A-6.3.2.10.(5) and (6))\n(7) Exhaust ducts connected to laundry drying equipment shall be,\n(a) independent of other exhaust ducts,\n(b) designed and installed so that the entire duct can be cleaned, and\n(c) constructed of smooth corrosion-resistant material.\n\n(See Note A-6.3.2.10.(7) and (8))\n(8) Where collective venting of multiple installations of laundry-drying equipment is used, the ventilation system shall\n(a) be connected to a common exhaust duct that is vented by one central exhaust fan,\n(b) include an interlock to activate the central exhaust fan when laundry-drying equipment is in use, and\n(c) be provided with make-up air. (See Note A-6.3.2.10.(7) and (8))\n(9) Exhaust ducts or vents connected to laundry-drying equipment shall discharge directly to the outdoors.\n(10) Except as provided in [Sentence \\(12\\)](#page-584-1) and except for self-contained systems serving individual dwelling units, exhaust ducts serving rooms containing water closets, urinals, basins, showers or slop sinks shall be independent of other exhaust ducts.\n(11) Except as provided in [Sentence \\(12\\)](#page-584-1) and except for self-contained systems serving individual dwelling units, exhaust ducts serving rooms containing residential cooking equipment shall be independent of other exhaust ducts.\n(12) Two or more exhaust systems described in Sentences [\\(10\\)](#page-584-0) an[d \\(11\\)](#page-584-2) may be interconnected or connected with exhaust ducts serving other areas of the building, provided\n(a) the connections are made at the inlet of an exhaust fan, and all interconnected systems are equipped with suitable back pressure devices to prevent the passage of odours from one system to another when the fan is not in operation, or\n(b) the exhaust ducts discharge to a shaft that is served by an exhaust fan having a capacity that is equal to or greater than the combined capacity of the exhaust fans discharging to the plenum multiplied by the operation diversity factor, provided that the exhaust fan serving the shaft operates continuously. (See Note A-6.3.2.10.(12)(b))\n(13) Where exhaust ducts containing air from conditioned spaces pass through or are adjacent to unconditioned spaces, the ducts shall be constructed to prevent condensation from forming on the inside or outside of the ducts.\n(14) Except as provided in Sentence (15), exhaust air shall be provided at a rate not less than 24 L/s for each water closet, urinal, shower or slop sink.\n(15) Except as provided in Sentence 6.3.1.1.(4), exhaust air shall be provided for fixtures in dwelling units in accordance with ANSI/ASHRAE 62.1, \"Ventilation for Acceptable Indoor Air Quality.\"\n(16) Except for wash basins (lavatories), sanitary facilities in a food premises shall be mechanically ventilated and shall be capable of exhausting air at the rate of not less than 24 L/s for each sanitary fixture listed in Sentence (17).\n(17) The mechanical ventilation described in Sentence (16) applies to rooms containing water closets, urinals, basins, showers or slop sinks.\n\n[ARTICLE:6.3.2.11:Return-Air System]\n(1) Return-air systems shall comply with Article 3.6.5.8.\n(2) Where a ceiling space is used as a return-air plenum, the requirements of Article 3.6.4.3. shall apply.\n(3) A public corridor or exit shall not be used as a return-air plenum.\n(4) The return-air system shall be designed to handle the entire air supply.\n(5) The return-air system shall be designed so that the negative pressure from the circulating fan cannot affect the furnace combustion air supply nor draw combustion products from joints or openings in the furnace or flue pipe.\n(6) Return-air inlets shall not be installed in an enclosed room or crawl space that provides combustion air to a fuel-fired appliance.\n\n[ARTICLE:6.3.2.12:Underground Ducts]\n(1) Underground ducts shall\n(a) be constructed and installed to provide interior drainage from and access to all low points,\n(b) not be connected directly to a sewer, and\n(c) be installed and constructed of materials recommended by ASHRAE and SMACNA Standards and HRAI Manuals.\n(2) A clean-out or pump-out connection shall be provided in an underground duct system at every low point of the duct system.\n\n[ARTICLE:6.3.2.13:Filters]\n(1) Air filters for air duct systems shall conform to the requirements for Class 2 air filter units as described in CAN/ULC-S111, \"Standard Method of Fire Tests for Air Filter Units.\"\n(2) When electrostatic-type filters are used, they shall be installed so as to ensure that the electric circuit is automatically de-energized when filter access doors are opened or, in dwelling units, when the furnace circulation fan is not operating.\n\n[ARTICLE:6.3.2.14:Cleaning Devices]\n\nr¹ (1) Reserved.\n\n(2) Where contaminants of concern are present in the outdoor air of the local area of the building site, ventilation required by Sentence 6.3.1.1.\\(1\\) shall be provided by a ventilation system designed to include devices that reduce the concentrations of contaminants to those permitted in the ACGIH's \"Industrial Ventilation: A Manual of Recommended  Practice for Design\" prior to the introduction of outdoor air to indoor occupied spaces.\n\n[ARTICLE:6.3.2.15:Evaporative Heat Rejection Systems]\n(1) Evaporative heat rejection systems shall\n(a) incorporate a drift eliminator or other means to minimize the dispersion of entrained water droplets, and\n(b) have a design discharge velocity that does not exceed the maximum discharge velocity recommended by the manufacturer.\n(2) Evaporative heat rejection systems shall be designed so that water continuously circulates through all parts of the system that are normally wetted when the system is operating.\n(3) Evaporative heat rejection systems and their components shall be constructed of corrosion-resistant, non-porous materials that do not promote the proliferation of disease-causing micro-organisms and that are compatible with disinfectants, biocides and other cleaning agents.\n(4) Evaporative heat rejection systems shall be installed such that\n(a) no discharge air bypasses the drift eliminator or other means referred to in Clause \\(1\\)\\(a\\), and\n(b) the systems are accessible for cleaning, inspection and maintenance.\n(5) Except as provided in Sentence \\(6\\), air discharged from evaporative heat rejection systems shall discharge away from the building, so as to not re-enter it, to a distance not less than\n(a) 2.15 m above sidewalks and driveways,\n(b) 7.6 m from outdoor air intakes,\n(c) 3 m horizontally or vertically from exterior doors and operable windows, and\n(d) 3 m horizontally or vertically from occupiable outdoor spaces, excluding maintenance spaces.\n(See Note A-6.3.2.15.\\(5\\) and \\(6\\)\\)\n(6) Air discharged from evaporative heat rejection systems in health care facilities shall discharge away from the building in compliance with CAN/CSA-Z317.2, \"Special requirements for heating, ventilation, and air-conditioning \\(HVAC\\) systems in health care facilities.\" (See Note A-6.3.2.15.\\(5\\) and (6))\n(7) Air intakes of evaporative heat rejection systems shall incorporate protective measures to minimize the entrainment of vegetation and other organic matter.\n(8) Make-up water connections shall be equipped with backflow prevention devices that conform to Article 7.6.2.1. (See Note A-6.3.2.15.\\(8\\) and \\(9\\)\\)\n(9) Water treatment systems and equipment for controlling the proliferation of disease-causing micro-organisms shall\n(a) be provided in accordance with Section 7.6.2. of ASHRAE Guideline 12, \"Minimizing the Risk of Legionellosis  Associated with Building Water Systems,\" and\n(b) include means for drainage, dilution, cleaning, and application of chemicals for the control of scale, corrosion and biological contamination.\n(See Note A-6.3.2.15.\\(8\\) and \\(9\\)\\)\n(10) Drains, overflows and blow-downs shall be connected to the building's drainage system in accordance with Clause 7.4.2.1.(1)(d).\n(11) Evaporative heat rejection systems shall be provided with access openings, service platforms, fixed ladders and fallrestraint connections to allow inspection, maintenance and testing.\n\n[ARTICLE:6.3.2.16:Evaporative Air Coolers, Misters, Atomizers, Air Washers and Humidifiers]\n(1) Evaporative air coolers, misters, atomizers, air washers and humidifiers shall be designed in accordance with Sections 8 and 9 of ASHRAE Guideline 12, \"Minimizing the Risk of Legionellosis Associated with Building Water  Systems.\"\n(2) Systems referred to in Sentence (1) shall\n(a) be designed so that water continuously circulates through all parts of the system that are normally wetted when the system is operating, and\n(b) incorporate a method of preventing water stagnation within the system itself and the internal plumbing when the system is not operating.\n\n(See Note A-6.3.2.16.(2))\n(3) All components of systems referred to in Sentence \\(1\\), including filters and evaporation media, shall be constructed of corrosion-resistant, non-porous materials that do not promote the proliferation of disease-causing micro-organisms.\n(4) Associated sumps shall\n(a) be constructed of corrosion-resistant, non-porous materials that do not promote the proliferation of disease-causing micro-organisms,\n(b) include auxiliary drains to prevent the overflow of water into ductwork, and\n(c) be installed so that they can be flushed, drained, cleaned and disinfected.\n(5) Where misters, atomizers or air washers are used in ductwork, the affected duct section shall be\n(a) designed to ensure drainage of unevaporated and accumulated water, and\n(b) constructed of corrosion-resistant, non-porous materials that do not promote the proliferation of disease-causing micro-organisms.\n(6) Make-up water connections shall be equipped with backflow prevention devices that conform to Article 7.6.2.1. (See Note A-6.3.2.16.\\(6\\)\\)\n\n[ARTICLE:6.3.2.17:Fans and Associated Air-Handling Equipment]\n(1) Fans for heating, ventilating and air-conditioning systems shall be located and installed so that their operation\n(a) does not adversely affect the draft required for proper operation of fuel-fired appliances, and\n(b) does not allow the air in the duct system to be contaminated by air or gases from the boiler room or furnace room.\n(2) Fans and associated air-handling equipment, such as air washers, filters and heating and cooling units, when installed on the roof or elsewhere outside the building, shall be of a type designed for outdoor use.\n\n[ARTICLE:6.3.2.18:Vibration Isolation Connectors]\n\n(1) Vibration isolation connectors in air duct systems shall comply with Article 3.6.5.2.\n\n[ARTICLE:6.3.2.19:Tape]\n\n(1) Tape used for sealing joints in air ducts, plenums and other parts of air duct systems shall comply with Article  3.6.5.3."
        },
        {
          "id": "6.3.3",
          "title": "Chimneys and Venting Equipment",
          "content": "[ARTICLE:6.3.3.1:Requirement for Venting]\n(1) Except as provided in Articles 6.3.3.2. and 6.3.3.3., the products of combustion from oil-, gas and solid-fuel-burning appliances shall be vented in conformance with the requirements in the applicable appliance installation standard listed in Article 6.2.1.5.\n(2) Except as provided in Article 6.2.1.5., vented products of combustion, other than those referred to in Sentence (1), shall be discharged away from the building, so as not to re-enter it, to a distance not less than\n(a) 2.15 m above sidewalks and driveways,\n(b) 3 m from outdoor air intakes,\n(c) 3 m horizontally or vertically from doors and operable windows, and\n(d) 3 m horizontally or vertically from occupiable outdoor spaces, excluding maintenance spaces. (See Note A-6.3.3.1.\\(2\\)\\)\n\n[ARTICLE:6.3.3.2:Masonry or Concrete Chimneys]\n(1) Rectangular masonry or concrete chimneys not more than 12 m in height shall conform to Part 9 if they serve\n(a) appliances with a combined total rated heat output of 120 kW or less, or\n(b) fireplaces.\n(2) Masonry or concrete chimneys other than those described in Sentence (1) shall be designed and installed in conformance with the appropriate requirements in NFPA 211, \"Standard for Chimneys, Fireplaces, Vents and Solid Fuel-Burning Appliances.\"\n\n[ARTICLE:6.3.3.3:Metal Smoke Stacks]\n\n(1) Single wall metal smoke stacks shall be designed and installed in conformance with NFPA 211, \"Standard for Chimneys, Fireplaces, Vents and Solid Fuel-Burning Appliances.\"\n\n[ARTICLE:6.3.3.4:Access Ladders]\n(1) Access ladders for chimneys, when provided, shall consist of steel or bronze rungs, built into the walls of the chimneys.\n(2) Rungs for external ladders shall begin at not less than 2.5 m from ground level."
        },
        {
          "id": "6.3.4",
          "title": "Ventilation for Laboratories",
          "content": "[ARTICLE:6.3.4.1:Application]\n\n(1) This Subsection applies to laboratories where dangerous goods, including flammable liquids and combustible liquids, are used in normal laboratory operations in quantities or in a manner that creates a fire or explosion hazard.\n\n[ARTICLE:6.3.4.2:General Ventilation]\n(1) A laboratory shall be provided with continuous mechanical ventilation designed to ensure that dangerous goods vapours and particles\n(a) do not accumulate in the laboratory,\n(b) are prevented from migrating to other parts of the building,\n(c) do not accumulate in the ventilation system,\n(d) are exhausted to the outdoors, and\n(e) are not returned to the building.\n(2) A ventilation system required by this Subsection shall be provided with monitoring devices to\n(a) indicate that the ventilation system is in operation, and\n(b) sound an alarm if the ventilation system is malfunctioning.\n(3) A ventilation system required by this Subsection shall be maintained in conformance with Section 4.12. of the Fire Code made under the Fire Protection and Prevention Act, 1997.\n\n[ARTICLE:6.3.4.2:A. Power-Ventilated Enclosure]\n\n(1) A power-ventilated enclosure required by the Fire Code made under the Fire Protection and Prevention Act, 1997 shall be designed and constructed to conform to Articles 6.3.4.3. and 6.2.4.4.\n\n[ARTICLE:6.3.4.3:Enclosure Exhaust Ventilation]\n(1) The ventilation system for a power-ventilated enclosure referred to in Article 6.3.4.2A. shall\n(a) conform to NFPA 91, \"Standard for Exhaust Systems for Air Conveying of Vapors, Gases, Mists, and Particulate  Solids,\"\n(b) provide continuous exhaust ventilation at an air velocity sufficient to prevent the accumulation of combustible or reactive deposits in the power-ventilated enclosure and its exhaust duct system,\n(c) confine dangerous goods vapours and particles to the area where they are generated and exhaust them to the outdoors,\n(d) not return the exhausted air to the building, and\n(e) be provided with well identified control switches that are\n(i) located outside the power-ventilated enclosure, and\n(ii) readily accessible in case of an emergency.\n\n[ARTICLE:6.3.4.4:Enclosure Construction]\n(1) The power-ventilated enclosure referred to in Article 6.3.4.2A. and its exhaust duct system shall\n(a) except as provided in Sentences \\(2\\) and \\(3\\), be constructed of noncombustible materials compatible with and chemically resistant to the dangerous goods vapours and particles being exhausted, and\n(b) be provided with access doors to permit inspection and maintenance of the fan assembly and exhaust ducts.\n(2) Combustible materials are permitted in the power-ventilated enclosure described in Sentence (1) and its exhaust duct systems if\n(a) such materials are required by the corrosive or reactive properties of the dangerous goods being used, and\n(b) their flame-spread rating is not more than 25.\n(3) The flame-spread rating required by Sentence \\(2\\) is permitted to be greater than 25 if an automatic fire suppression system is provided inside the power-ventilated enclosure and its exhaust duct system."
        }
      ]
    },
    {
      "id": "6.4",
      "title": "Heating Appliances",
      "subsections": [
        {
          "id": "6.4.1",
          "title": "Heating Appliances, General",
          "content": "[ARTICLE:6.4.1.1:Location of Appliances]\n\n(1) Except for appliances installed in dwelling units, fuel-fired heating appliances shall be located, enclosed or separated from the remainder of the building in conformance with Section 3.6. (See also Subsection 9.10.10.\\)\n\n[ARTICLE:6.4.1.2:Appliances Installed Outside the Building]\n(1) Fuel-fired appliances installed outside a building shall be\n(a) designed and constructed for outdoor use,\n(b) installed not less than 1 200 mm from the property line, measured horizontally, and\n(c) installed not less than 3 m from an adjacent wall of the same building when such wall contains an opening or openings within 3 storeys above and 5 m horizontally from the appliance, unless such openings are protected by a closure assembly having a 45 min fire-protection rating determined in conformance with Article 3.1.8.4., or by wired glass conforming to Article 3.1.8.14."
        },
        {
          "id": "6.4.2",
          "title": "Unit Heaters",
          "content": "[ARTICLE:6.4.2.1:Clearances]\n\n(1) Every unit heater using either steam or hot water as the heating medium shall be installed such that the clearances between the appliance and adjacent combustible material conform to Table 6.7.1.2."
        },
        {
          "id": "6.4.3",
          "title": "Radiators and Convectors",
          "content": "[ARTICLE:6.4.3.1:Lining or Backing]\n(1) A noncombustible lining or backing shall be provided for every steam or hot water radiator and convector\n(a) located in a recess or concealed space, or\n(b) attached to the face of a wall of combustible construction or encapsulated mass timber construction.\n(2) Every steam or hot water radiator and convector shall be installed so as to conform to the clearance requirements of Table 6.7.1.2."
        }
      ]
    },
    {
      "id": "6.5",
      "title": "Thermal Insulation Systems",
      "subsections": [
        {
          "id": "6.5.1",
          "title": "Insulation",
          "content": "[ARTICLE:6.5.1.1:Insulation and Coverings]\n(1) Insulation and coverings on pipes shall comply with Article 3.6.5.5.\n(2) Insulation and coverings on pipes shall be composed of material that will withstand deterioration from softening, melting, mildew and mould at the operating temperature of the system.\n\n(3) Exposed piping or equipment subject to human contact shall be insulated so that the temperature of the exposed surface does not exceed 52°C. (See Note A-6.5.1.1.\\(3\\)\\)"
        }
      ]
    },
    {
      "id": "6.6",
      "title": "Refrigeration and Cooling Systems",
      "subsections": [
        {
          "id": "6.6.1",
          "title": "Refrigerating Systems and Equipment for Air Conditioning",
          "content": "[ARTICLE:6.6.1.1:Cooling Units]\n(1) Where a cooling unit is combined with a fuel-fired furnace in the same duct system, the cooling unit shall be installed\n(a) in parallel with the heating furnace,\n(b) upstream of the furnace provided the furnace is designed for such application, or\n(c) downstream of the furnace provided the cooling unit is designed to prevent excessive temperature or pressure in the refrigeration system."
        }
      ]
    },
    {
      "id": "6.7",
      "title": "Piping Systems",
      "subsections": [
        {
          "id": "6.7.1",
          "title": "Piping for Heating and Cooling Systems",
          "content": "[ARTICLE:6.7.1.1:Piping Materials and Installation]\n(1) Piping shall be made from materials designed to withstand the effects of temperatures and pressures that may occur in the system. (See Articles 3.1.5.19., 3.1.9.1., 9.10.9.6. and 9.10.9.7. for fire safety requirements.)\n(2) Every pipe used in a heating or air-conditioning system shall be installed to allow for expansion and contraction due to temperature changes.\n(3) Supports and anchors for piping in a heating or air-conditioning system shall be designed and installed to ensure that undue stress is not placed on the supporting structure.\n\n[ARTICLE:6.7.1.2:Clearances]\n\n(1) Clearances between combustible material and bare pipes carrying steam or hot water shall conform to Table 6.7.1.2.\n#### Table 6.7.1.2. Clearance Between Steam or Hot Water Pipes and Combustible Material Forming Part of Article 6.4.2.1., Sentence 6.4.3.1.(2) and Article 6.7.1..2.\n\n<table class=\"obc-table\"><thead><tr><th>Steam or Water Temperature, °C</th><th>Minimum Clearance, mm</th></tr></thead><tbody><tr><td>Up to 95</td><td>No clearance</td></tr><tr><td>above 95 to 120</td><td>15</td></tr><tr><td>above 120</td><td>25</td></tr></tbody></table>\n\n[ARTICLE:6.7.1.3:Surface Temperature]\n\n(1) The exposed surface temperature of a steam or hot water radiator shall not exceed 70°C unless precautions are taken to prevent human contact. (See Note A-6.5.1.1.\\(3\\))\n\n[ARTICLE:6.7.1.4:Protection]\n\n(1) Where a pipe carrying steam or hot water at a temperature above 120°C passes through a combustible floor, ceiling or wall, the construction shall be protected by a sleeve of metal or other noncombustible material not less than 50 mm larger in diameter than the pipe.\n\n[ARTICLE:6.7.1.5:Piping in Shafts]\n\n(1) Where piping for heating or air-conditioning systems is enclosed in a shaft, the requirements of Article 3.6.3.1. for shafts shall apply."
        },
        {
          "id": "6.7.2",
          "title": "Storage Bins",
          "content": "[ARTICLE:6.7.2.1:Storage Bins]\n(1) Service pipes passing through a storage bin for solid fuel shall be protected or so located as to avoid damage to the pipes.\n(2) Except for fuel-thawing pipes, every pipe designed to operate at a temperature of 50°C or above shall be located where fuel cannot be stored in contact with it."
        }
      ]
    },
    {
      "id": "6.8",
      "title": "Equipment Access",
      "subsections": [
        {
          "id": "6.8.1",
          "title": "Openings",
          "content": "[ARTICLE:6.8.1.1:Access Openings]\n\n(1) Any covering of an access opening through which a person could enter shall be openable from the inside without the use of keys where there is a possibility of the opening being accidentally closed while the system or equipment is being serviced.\n\n[ARTICLE:6.8.1.2:Openings in Air Duct Systems]\n(1) Air duct systems shall have no openings other than those required for the proper operation and maintenance of the system.\n(2) Access openings shall be provided in duct systems to allow the removal of material that may accumulate in plenums and ducts.\n\n[ARTICLE:6.8.1.3:Odour Removal Equipment]\n(1) When odour removal equipment of the adsorption type is used, it shall be\n(a) installed to allow access so that adsorption material can be reactivated or renewed, and\n(b) protected from dust accumulation by air filters installed on the inlet side.\n(2) Facilities for flushing and drainage shall be provided where filters are designed to be washed in place."
        }
      ]
    },
    {
      "id": "6.9",
      "title": "Fire Safety Systems",
      "subsections": [
        {
          "id": "6.9.1",
          "title": "General",
          "content": "[ARTICLE:6.9.1.1:Fire Safety Requirements]\n(1) The fire safety characteristics of heating, ventilating and air-conditioning systems shall comply with Subsection 3.6.5.\n(2) Characteristics referred to in Sentence (1) include but are not limited to\n(a) use of combustible materials in duct systems,\n(b) flame-spread ratings and smoke-developed ratings of duct and pipe materials and coverings,\n(c) installation of equipment relative to property lines, and\n(d) requirements for fire dampers and fire stop flaps.\n\n[ARTICLE:6.9.1.2:Hazardous Gases, Dusts or Liquids]\n(1) Except as provided in Subsection 6.3.4., systems serving spaces that contain hazardous gases, dusts or liquids shall be designed, constructed and installed in conformance with the provisions of the Fire Code made under the Fire Protection and Prevention Act, 1997, or in the absence of requirements pertinent to such systems in the Fire Code, to good engineering practice such as that described in the publications of the National Fire Protection Association and in the CCBFC NRCC-CONST-56437E, \"National Fire Code of Canada. (See Note A-6.9.1.2.\\(1\\)\\)\n(2) When indoor piping for Class I flammable liquids is installed in a trench, the trench shall be\n(a) provided with positive ventilation to the outdoors, or\n(b) designed to prevent the accumulation of flammable vapours.\n\n[ARTICLE:6.9.1.3:Commercial Cooking Equipment]\n(1) Fire protection systems for commercial cooking equipment referred to in Sentence 6.3.1.6.\\(1\\) using vegetable oil or animal fat shall conform to\n(a) ANSI/CAN/UL/ULC 300, \"Standard for Fire Testing of Fire Extinguishing Systems for Protection of Commercial  Cooking Equipment,\" or\n(b) ULC/ORD-C1254.6, \"Fire Testing of Restaurant Cooking Area Fire Extinguishing System Units.\""
        },
        {
          "id": "6.9.2",
          "title": "Dampers and Ductwork",
          "content": "[ARTICLE:6.9.2.1:Fire Dampers]\n\n(1) Fire dampers shall conform to Article 3.1.8.10.\n\n[ARTICLE:6.9.2.2:Smoke Detectors]\n\n(1) Air handling systems shall incorporate smoke detectors where and as required by Article 3.2.4.12.\n\n[ARTICLE:6.9.2.3:Exhaust Ducts and Outlets]\n(1) Where an exhaust duct system is used for smoke removal in a high building, the requirements of Article 3.2.6.6. shall apply.\n(2) Where exhaust duct systems from more than one fire compartment are connected to an exhaust duct in a vertical service space, the requirements of Article 3.6.3.4. shall apply.\n\n[ARTICLE:6.9.2.4:Ducts in Exits]\n(1) Where ducts penetrate fire separations separating exits from the remainder of the building, they shall be in accordance with Article 3.4.4.4.\n(2) Duct penetration of fire separations separating exits from the remainder of the building is permitted if the duct\n(a) is designed for the purposes of Subsection 3.2.6., or\n(b) only serves the exit from a dedicated rooftop air make-up unit."
        },
        {
          "id": "6.9.3",
          "title": "Carbon Monoxide Alarms",
          "content": "[ARTICLE:6.9.3.1:Application]\n(1) Article 6.9.3.2. applies to every building that\n(a) contains a residential occupancy, a care occupancy with individual suites, or a care occupancy containing sleeping rooms not within a suite, and contains a fuel-burning appliance or a storage garage, or\n(b) contains a residential occupancy and is served by a forced-air fuel-burning appliance not contained within the building.\n(2) Articles 6.9.3.3. and 6.9.3.4. apply to every building.\n\n[ARTICLE:6.9.3.2:Location of Carbon Monoxide Alarms]\n(1) A carbon monoxide alarm shall be installed in a suite of residential occupancy or care occupancy where\n(a) a fuel-burning appliance or a flue is installed in the suite,\n(b) a forced-air fuel-burning appliance provides heated air directly to the suite,\n(c) a fuel-burning appliance or a flue is located in a room, suite or area that shares a common wall or floor or ceiling assembly with the suite, or\n(d) a storage garage shares a common wall or floor or ceiling assembly with the suite.\n(2) Where a carbon monoxide alarm is required by Sentence (1) to be installed in a suite of residential occupancy or care occupancy, other than a suite that consists of a combined living and sleeping area, a carbon monoxide alarm shall be installed\n(a) adjacent to each sleeping room in the suite, and\n(b) on each storey without a sleeping room in the suite.\n(3) Where a carbon monoxide alarm is required by Sentence (1) to be installed in a suite of residential occupancy or care occupancy that consists of a combined living and sleeping area, a carbon monoxide alarm shall be installed in the combined living and sleeping area.\n(4) In addition to the carbon monoxide alarms required to be installed in a suite of residential occupancy or care occupancy in accordance with Sentence (2), a carbon monoxide alarm shall be installed in each sleeping room within the suite where the sleeping room\n(a) contains a fuel-burning appliance or a flue, or\n(b) shares a common wall or floor or ceiling assembly with\n(i) a room, suite or area that is located outside the suite and contains a fuel-burning appliance or a flue, or\n(ii) a storage garage.\n(5) Carbon monoxide alarms shall be installed in public corridors serving suites of residential occupancy where the corridor is directly heated by a forced-air fuel-burning appliance.\n(6) Where carbon monoxide alarms are required by Sentence (5) to be installed in a public corridor, the carbon monoxide alarms shall be installed such that\n(a) there is at least one carbon monoxide alarm in each portion of a divided corridor, and\n(b) each carbon monoxide alarm in an undivided portion of a corridor is spaced not more than 25 m apart.\n\n[ARTICLE:6.9.3.3:Location of Carbon Monoxide Alarms in All Buildings]\n(1) A carbon monoxide alarm shall be installed in service rooms or other areas of a building where the service room or other area\n(a) contains a fuel-burning appliance used for building services or laundry drying equipment, and\n(b) is not located within a suite of residential occupancy.\n\n[ARTICLE:6.9.3.4:Installation and Conformance to Standards]\n(1) The carbon monoxide alarms required by Articles 6.9.3.2. and 6.9.3.3. shall\n(a) except as permitted in Sentence (2), be permanently connected to an electrical circuit and shall have no disconnect switch between the overcurrent device and the carbon monoxide alarm,\n(b) in case the regular power supply to the carbon monoxide alarm is interrupted, be provided with a battery as an alternative power source that can continue to provide power to the carbon monoxide alarm for a period of not less than 8 h in the standby condition, followed by the operation of the carbon monoxide alarm for an alarm signal for at least 12 h,\n(c) be wired so that\n(i) activation of one carbon monoxide alarm within a suite of residential occupancy will activate all carbon monoxide alarms within the suite, and\n(ii) activation of one carbon monoxide alarm located in a public corridor serving suites of residential occupancy will activate all carbon monoxide alarms within the corridor,\n(d) be audible within sleeping rooms when the intervening doors are closed, where located adjacent to a sleeping room in a suite of residential occupancy, and\n(e) conform to\n(i) CAN/CSA-6.19, \"Residential Carbon Monoxide Alarming Devices\", or\n(ii) UL 2034, \"Single and Multiple Station Carbon Monoxide Alarms\".\n(2) Where the building is not supplied with electrical power, carbon monoxide alarms are permitted to be battery operated.\n(3) Except as permitted in Sentence (4), the carbon monoxide alarms required by Articles 6.9.4.2. and 6.9.4.3. shall have a visual signalling component conforming to the requirements in 18.5.3. (Light, Color and Pulse Characteristics) of NFPA 72, \"National Fire Alarm and Signaling Code\".\n(4) Where the building is not supplied with electrical power, carbon monoxide alarms need not have a visual signalling component.\n(5) The luminous intensity for visual signalling components required by Sentence (3) that are installed in sleeping rooms or combined living and sleeping areas shall be a minimum of 175 cd.\n(6) The visual signalling component required by Sentence (3) need not\n(a) be integrated with the carbon monoxide alarm provided it is interconnected to it,\n(b) be on battery backup, or\n(c) have synchronized flash rates, when installed in a dwelling unit.\n(7) The carbon monoxide alarms required by Articles 6.9.3.2. and 6.9.3.3. shall be installed\n(a) at the manufacturer's recommended height, or\n(b) in the absence of specific instructions, on or near the ceiling."
        },
        {
          "id": "6.9.4",
          "title": "Ash Storage",
          "content": "[ARTICLE:6.9.4.1:Ash Storage Bins]\n(1) Every ash storage bin shall be constructed of noncombustible material.\n(2) Every opening in an ash storage bin shall be protected by a tight-fitting metal door with metal frame securely fastened to the bin.\n\n[ARTICLE:6.9.4.2:Fireplaces]\n\n(1) Fireplaces shall conform to the requirements of Section 9.22."
        }
      ]
    }
  ]
}