{
  "id": "11",
  "title": "Renovation",
  "sections": [
    {
      "id": "11.1",
      "title": "General",
      "subsections": [
        {
          "id": "11.1.1",
          "title": "Scope",
          "content": "[ARTICLE:11.1.1.1:Scope]\n\n\n(1) The scope of this Part shall be as described in Subsection 1.3.3. of Division A.\n\n\n[ARTICLE:11.1.1.2:Definitions]\n\n\n(1) In this Part,\n\nBuilding system means a combination of elements or components that form a complete major division of construction in the design of a building or part of a building, including a structural or framing system, a waterproofing system, a drainage system, an exterior cladding system, a roofing system, a window system, a partition system, a corridor system, a stair system, a fire alarm and detection system, a sprinkler system or a heating, ventilation or air-conditioning system, a foundation system, a standpipe and hose system, a flooring system, a plumbing system, a sewage system or an electrical system."
        },
        {
          "id": "11.1.2",
          "title": "Application",
          "content": "[ARTICLE:11.1.2.1:Extension, Material Alteration or Repair]\n\n\n(1) Where an existing building is subject to extension, material alteration or repair,\n(a) the proposed construction shall comply with Section 11.3., and\n(b) the performance level of the building shall be evaluated and compensating construction shall be undertaken in accordance with Section 11.4."
        }
      ]
    },
    {
      "id": "11.2",
      "title": "Classification of Existing Buildings",
      "subsections": [
        {
          "id": "11.2.1",
          "title": "Classification",
          "content": "[ARTICLE:11.2.1.1:Construction Index and Hazard Index]\n\n\n(1) Where proposed construction will result in the change of major occupancy of all or part of an existing building to another major occupancy, the building shall be classified as to its,\n(a) construction on the basis of its construction index as provided for in this Part, including Table 11.2.1.1.-A, and (See Note A-11.2.1.1.(1)(a))\n(b) occupancy on the basis of its hazard index as provided for in this Part, including Tables 11.2.1.1.-B to 11.2.1.1.-N. (See Note A-11.2.1.1.(1)(b))\n\nr1\n\n(2) Small or medium sized existing buildings as determined in Tables 11.2.1.1.-B to 11.2.1.1.-N facing multiple streets may be assigned a hazard index credit of 1, which may be subtracted from the hazard index of the proposed major occupancy to reduce the additional upgrading required by Table 11.4.3.4.-A provided,\n(a) the building does not contain a Group B, Division 1, a Group C, or a Group F, Division 1 occupancy, and\n(b) firefighting access complying with Articles 3.2.5.1. to 3.2.5.5. or Subsection 9.10.20. is provided.\n(3) The requirements of Articles 2.2.2.3. to 2.2.2.8. and 3.2.2.20. to 3.2.2.93. do not apply to this Part.\n(4) For the purpose of this Part, the calculation of the construction index and hazard index for a Group G major occupancy is permitted to be based on a Group F, Division 2 major occupancy.\n\n\n[ARTICLE:11.2.1.2:Multiple Occupancies]\n\n\n(1) The classification of an existing building of multiple occupancy under Article 11.2.1.1. shall be applied according to Articles 3.2.2.5. to 3.2.2.8.\n\n\n[ARTICLE:11.2.1.3:Prohibition of Occupancy Combinations]\n\n\n(1) Nothing in this Part relieves an applicant from complying with the requirements of Article 2.2.1.2., 3.1.3.2. or 9.10.9.14."
        }
      ]
    },
    {
      "id": "11.3",
      "title": "Proposed Construction",
      "subsections": [
        {
          "id": "11.3.1",
          "title": "New and Existing Building Systems",
          "content": "[ARTICLE:11.3.1.1:Material Alteration or Repair of a Building System]\n\n\n(1) Where an existing building system is materially altered or repaired, the performance level of the building after the material alteration or repair shall be at least equal to the performance level of the building prior to the material alteration or repair. (See Note A-11.3.1.1.(1))\n\n\n[ARTICLE:11.3.1.2:New Building Systems and Extension of Existing Building Systems]\n\n\n(1) Except as provided in Article 11.3.3.1. and Section 11.5., the design and construction of a new building system or the extension of an existing building system, shall comply with all other Parts. (See Note A-11.3.1.2.(1))"
        },
        {
          "id": "11.3.2",
          "title": "Extension of Buildings",
          "content": "[ARTICLE:11.3.2.1:Portion of Extended Buildings]\n\n\n(1) Where an existing building is extended,\n(a) this Part applies to the existing portion of the building, and\n(b) the extended portion of the building shall comply with all other Parts."
        },
        {
          "id": "11.3.3",
          "title": "Renovation",
          "content": "[ARTICLE:11.3.3.1:Basic Renovation (See Note A-11.3.3.1.)]\n\n\n(1) Except as provided in Sentence (2) and Article 11.3.3.2., construction may be carried out to maintain the existing performance level of all or part of an existing building, by the reuse, relocation or extension of the same or similar materials or components, to retain the existing character, structural uniqueness, heritage value, or aesthetic appearance of all or part of the building, if the construction will not adversely affect the early warning and evacuation systems, fire separations or the structural adequacy or will not create an unhealthy environment in the building.\n(2) Construction in respect of a Group B, Division 3 occupancy, a hotel or a retirement home may be carried out in accordance with Sentence (1) only if the construction will be in conformance with the Fire Code made under the Fire Protection and Prevention Act, 1997.\n\n\n[ARTICLE:11.3.3.2:Extensive Renovation (See Note A-11.3.3.2.)]\n\n\n(1) Where existing interior walls or ceilings or floor assemblies or roof assemblies are substantially removed in an existing building and new interior walls, ceilings, floor assemblies or roof assemblies are installed in the building, structural and fire-resistance elements shall be constructed in compliance with the requirements of the other Parts.\n(2) Except as provided in Section 11.5., the proposed construction within an existing suite shall comply with the requirements of Section 3.8. where,\n(a) new interior walls or floor assemblies are installed,\n(b) the suite has an area greater than 300 m<sup>2</sup> , and\n(c) the suite is located in,\n  - (i) a floor area where the existing difference in elevation between the adjacent ground level and the floor level is not more than 200 mm, or\n  - (ii) a normally occupied floor area which is accessible by a passenger type elevator or other platform equipped passenger elevating device from an entrance storey where the existing difference in elevation between the adjacent ground level and the entrance storey level is not more than 200 mm.\n(3) Except as provided in Section 11.5., the proposed construction within an existing suite, other than a suite described in Sentence (2) or a suite in a building described in Clause 3.8.1.1.(1)(a), (b), (c) or (d), shall comply with the requirements of Sentences 3.8.1.3.(6), 3.8.2.3.(6), 3.8.3.1.(6), 3.8.3.3.(19), 3.8.3.7.(1), 3.8.3.15.(5) and 3.8.3.16.(4) where new interior walls or floor assemblies are installed. (See Note A-11.3.3.2.(3))\n(4) Except as provided in Sentence (5), where existing interior walls or ceilings or floor assemblies or roof assemblies are substantially removed on any storey in an existing building and new interior walls, ceilings, floor assemblies or roof assemblies are installed, the storey shall be sprinklered if,\n(a) the storey will contain a Group C major occupancy, and\n(b) the building is over 3 storeys in building height.\n(5) Sentence (4) does not apply where the building,\n(a) conforms to Subclause 3.2.2.50.(1)(a)(ii), and\n(b) contains dwelling units having means of egress conforming to Sentence 3.3.4.4.(8).\n(6) Where existing interior walls or ceilings or floor assemblies or roof assemblies are substantially removed and new interior walls, ceilings, floor assemblies or roof assemblies are installed in an existing building or part of an existing building that is a retirement home, the following requirements apply:\n(a) the retirement home shall be sprinklered,\n(b) a voice communication system conforming to Article 3.2.4.23. shall be provided in the building, if Clause 3.2.6.8.(1)(b) or (c), as applicable, requires that such a voice communication system be provided in the building, and\n(c) doors to suites and sleeping rooms not within suites in the retirement home, other than doors leading directly to the exterior, shall be equipped with self-closing devices."
        },
        {
          "id": "11.3.4",
          "title": "Plumbing",
          "content": "[ARTICLE:11.3.4.1:Extension, Material Alteration or Repair]\n\n\n(1) Despite Subsections 11.3.1. to 11.3.3., when an existing building is extended or subject to material alteration or repair, Part 7 applies,\n(a) to the design and construction of plumbing in the extensions and those parts of the building subject to material alteration and repair, and\n(b) to plumbing which is adversely affected by the extension, alteration or repair."
        },
        {
          "id": "11.3.5",
          "title": "Sewage Systems",
          "content": "[ARTICLE:11.3.5.1:Existing Septic Tanks]\n\n\n(1) Despite Subsections 11.3.1. to 11.3.3., where an existing septic tank is subject to material alteration, repair or replacement, the construction of the septic tank shall comply with Part 8.\n\n\n[ARTICLE:11.3.5.2:Vertical Separations and Existing Sewage Systems]\n\n\n(1) Despite Subsections 11.3.1. to 11.3.3., where an existing sewage system is extended or is subject to material alteration or repair, the requirements respecting the vertical separation to the water table set out in Part 8 apply to the extended, altered or repaired portions of the sewage system as well as to the existing portions of the sewage system."
        }
      ]
    },
    {
      "id": "11.4",
      "title": "Performance Level Evaluation and Compensating Construction",
      "subsections": [
        {
          "id": "11.4.1",
          "title": "General",
          "content": "[ARTICLE:11.4.1.1:Performance Level]\n\n\n(1) The performance level of a building after construction shall not be less than the performance level of the building prior to construction.\n(2) For the purposes of Sentence (1), reduction of performance level shall be determined in accordance with Subsection 11.4.2.\n(3) Where the proposed construction would reduce the performance level of an existing building, compensating construction shall be required in conformance with Subsection 11.4.3.\n(4) For the purpose of this Subsection, where a permit to construct a farm building has been applied for before January 1, 2025, the performance level of the farm building is permitted to be evaluated based on the applicable requirements of Ontario Regulation 332/12 (Building Code) made under the Act, as it read on December 31, 2024."
        },
        {
          "id": "11.4.2",
          "title": "Reduction in Performance Level",
          "content": "[ARTICLE:11.4.2.1:Structural]\n\n\n(1) The performance level of an existing building is reduced where after proposed construction in all or part of an existing building,\n(a) the major occupancy will change to a different major occupancy,\n(b) the occupant load will increase by more than 15%, or\n(c) the live load will increase due to change in use within the same major occupancy,\n\nand the existing structural floor and roof framing systems and their supporting members after the construction are not adequate to support the proposed dead loads and live loads.\n\n\n[ARTICLE:11.4.2.2:Increase in Occupant Load]\n\n\n(1) Except as provided in Sentences 11.4.2.5.(2) and (3), the performance level of an existing building is reduced where proposed construction will increase the occupant load of an existing building by more than 15%.\n(2) The performance level of an existing building is reduced where proposed construction will increase the occupant load by 15% or less and the new occupant load will be more than 15% above the occupant load for which a fire alarm system is required under Sentence 3.2.4.1.(2).\n(3) The performance level of an existing building is reduced where proposed construction will increase the occupant load by 15% or less and the new occupant load will be more than 15% above the existing exit capacity as required under Article 3.4.3.2.\n\n\n[ARTICLE:11.4.2.3:Change of Major Occupancy]\n\n\n(1) Except as provided in Sentence 11.4.2.5.(4), the performance level of an existing building is reduced where proposed construction will result in,\n(a) the change of the major occupancy of all or part of an existing building to another major occupancy of a greater hazard index,\n(b) the conversion of a suite of a Group C major occupancy into more than one suite of Group C major occupancy,\n(c) the conversion of a suite or part of a suite of a Group A, Division 2 or a Group A, Division 4 major occupancy into a gaming premises,\n(d) the change of a farm building or part of a farm building to another major occupancy other than a Group G major occupancy,\n(e) the change of a building or part of a building to a post-disaster building,\n(f) the change of a building or part of a building to a retirement home,\n(g) the change in use of a building or part of a building where the previous major occupancy of the building or part of the building cannot be determined, or\n(h) the change of a farm building or part of a farm building to a Group G, Division 1 major occupancy.\n(2) For the purpose of this Article and Sentences 11.4.2.1.(1) and 11.4.2.5.(4), the change of use set out in Clauses (1)(b) to (h) is also deemed to constitute a change in major occupancy.\n(3) The performance level of an existing building is reduced where the early warning and evacuation systems requirements of other Parts for the proposed major occupancy exceed those of the existing building.\n(4) The performance level of an existing building is reduced where the proposed major occupancy in the building is not separated from the adjoining major occupancies by fire separations having fire-resistance ratings conforming to Tables 2.2.1.4., 3.1.3.1. and 11.4.3.4.-B.\n\n(5) The performance level of an existing building is reduced where the occupancy of all or part of an existing building of combustible construction is changed to a new major occupancy that would require the building, if it were a new building, to be of noncombustible construction or to be constructed in accordance with Article 3.2.2.51. or 3.2.2.60.\n(6) Despite Clause (1)(a), the performance level of an existing building is reduced where proposed construction will result in the change of the major occupancy of all or part of an existing building to a Group C major occupancy in a building over 3 storeys in building height, except in a building conforming to Subclause 3.2.2.50.(1)(a)(ii) and having an egress facility conforming to Sentence 3.3.4.4.(8).\n\n\n[ARTICLE:11.4.2.4:Plumbing]\n\n\n(1) The performance level of an existing building is reduced where the existing building is extended or subject to material alteration or repair, and plumbing in the existing building is adversely affected by the extension, alteration or repair.\n\n\n[ARTICLE:11.4.2.5:Sewage Systems]\n\n\n(1) The performance level of an existing building is reduced where the existing building is extended or subject to material alteration or repair and a sewage system serving the existing building is adversely affected by the extension, alteration or repair of the existing building.\n(2) Except as provided in Sentence (3), the performance level of an existing building is reduced where proposed construction will increase the occupant load of an existing building, and the new occupant load will result in the total daily design sanitary sewage flow of the building, calculated in accordance with Article 8.2.1.3., exceeding the capacity of any component of a sewage system serving the building.\n(3) The performance level of an existing dwelling unit is reduced where proposed construction that,\n(a) increases the number of bedrooms in the dwelling unit,\n(b) exceeds 15% of the finished area of the dwelling unit, or\n(c) adds new plumbing fixtures to the dwelling unit,\n\nwill result in the total daily design sanitary sewage flow of the dwelling unit, calculated in accordance with Article 8.2.1.3., exceeding the capacity of any component of a sewage system serving the dwelling unit.\n\n(4) The performance level of an existing building is reduced where proposed construction will result in the change of a major occupancy of all or part of the existing building to another major occupancy and,\n(a) the total daily design sanitary sewage flow of the proposed major occupancy, calculated in accordance with Article 8.2.1.3., exceeds the capacity of any component of a sewage system serving the building, or\n(b) the type or amount of sanitary sewage which will, under the proposed major occupancy, be discharged to a sewage system serving the building, is prohibited by Article 8.1.3.1.\n\n\n[ARTICLE:11.4.2.6:Extension of Buildings of Combustible Construction]\n\n\n(1) The performance level of an existing building of combustible construction is reduced where the existing building is extended by adding a storey or storeys such that the extended building will be more than four storeys in building height."
        },
        {
          "id": "11.4.3",
          "title": "Compensating Construction",
          "content": "[ARTICLE:11.4.3.1:General (See Note A-11.4.3.1.)]\n\n\n(1) Where the performance level of an existing building is reduced under Subsection 11.4.2., compensating construction shall be carried out in accordance with this Subsection.\n\n(2) Except as provided in Sentence (3), compensating construction required under this Subsection applies to the part of the building being altered and shall include,\n(a) fire separations, with the required fire-resistance ratings, separating the part being altered from the floor areas immediately above and below and from the immediate adjacent areas, and\n(b) access to exits and exits from the building, where the alteration adversely affects the exit system of the building.\n(3) Compensating construction required under this Subsection applies to the existing building systems that are adversely affected by the proposed construction.\n\n\n[ARTICLE:11.4.3.2:Structural]\n\n\n(1) Where the performance level of an existing building is reduced under Sentence 11.4.2.1.(1),\n(a) remedial measures shall be taken to support the proposed loads, or\n(b) the portion of the floor affected by the proposed loads shall be restricted to the loading it will support and signs stating the restrictions shall be posted.\n\n(See Note A-11.4.3.2.(1))\n\n\n[ARTICLE:11.4.3.3:Increase in Occupant Load (See Note A-11.4.3.3.)]\n\n\n(1) Where the performance level of an existing building is reduced under Sentence 11.4.2.2.(1), (2) or (3), the building shall be evaluated, and the early warning and evacuation systems shall be upgraded, in conformance with the applicable requirements of Table 11.4.3.3.\n(2) Sentence (1) does not apply in a Group C occupancy where the new total occupant load is,\n(a) 14 persons or fewer in a boarding, lodging or rooming house, except that where the occupant load is between 10 and 15 persons, an interconnected system of smoke alarms in corridors near stairways is required, or\n(b) 16 persons or fewer in a building containing residential suites which are dwelling units, except that where the occupant load is between 10 and 17 persons, an interconnected system of smoke alarms in corridors near stairways is required.\n(3) Where the performance level of an existing building is reduced under Sentence 11.4.2.2.(1), additional construction shall be required in order that the building or part of the building subject to the increase in occupant load conforms to the requirements of Sentences 2.4.2.1.(1) and 6.3.1.1.(2), Subsection 3.7.4. and Article 9.31.1.1.\n\n\n[ARTICLE:11.4.3.4:Change in Major Occupancy (See Note A-11.4.3.4.)]\n\n\n(1) Where the performance level of an existing building is reduced under Clause 11.4.2.3.(1)(a), (b), (c), (d), (e) or (g), additional upgrading shall be required in conformance with Table 11.4.3.4.-A and so that the construction index of the building is increased to at least equal the hazard index of the new major occupancy that the building is to support.\n(2) A building or part of the building subject to a change of major occupancy shall conform to the requirements of Articles 2.4.2.3. to 2.4.2.5., Subsection 3.2.6., Sections 3.7., 3.11., 3.12., Sentences 6.3.1.1.(2), and 6.3.2.7.(1) and 9.33.6.13.(7.1), Subsections 9.5.1. and 9.5.3., 9.5.3A. to 9.5.3F. and 9.5.4., Section 9.7., Subsection 9.10.17., Sections 9.31. and 9.32., and Subsections 9.34.1. to 9.34.3. as they apply to the new major occupancy that the building or part of the building is to support.\n(3) Where the performance level of an existing building is reduced under Sentence 11.4.2.3.(3), the building shall be evaluated, and the early warning and evacuation systems shall be upgraded, in conformance with the applicable requirements of Table 11.4.3.3.\n(4) Where the performance level of an existing building is reduced under Sentence 11.4.2.3.(4), upgrading of the fire separations shall be required in conformance with the applicable requirements of Article 3.1.3.1. and Table 11.4.3.4.-B.\n\n(5) Where the performance level is reduced under Sentence 11.4.2.3.(5), the requirement for the building to be of noncombustible construction or to be constructed in accordance with Article 3.2.2.51. or 3.2.2.60. is satisfied if the building is sprinklered.\n(6) Where the performance level is reduced under Sentence 11.4.2.3.(6), the storey subject to the change shall be sprinklered.\n(7) Where the performance level of an existing building is reduced under Clause 11.4.2.3.(1)(f), the following requirements apply:\n(a) the retirement home shall be sprinklered,\n(b) a voice communication system conforming to Article 3.2.4.22. shall be provided in the building, and\n(c) doors to suites and sleeping rooms not within suites in the retirement home, other than doors leading directly to the exterior, shall be equipped with self-closing devices.\n(8) Where a major occupancy is changed to a Group B, Division 2 major occupancy, heating, ventilating, air conditioning systems shall conform to the requirements of Sentence 6.2.1.1.(1).\n(9) Where a major occupancy is changed to a Group B, Division 3 major occupancy, ventilation, air circulation, and filtration systems shall conform to the requirements of Sentence 6.2.1.1.(1).\n\n\n[ARTICLE:11.4.3.5:Plumbing]\n\n\n(1) Where the performance level of an existing building is reduced under Sentence 11.4.2.4.(1), upgrading of plumbing in the existing building which is adversely affected by the extension, alteration or repair shall be required in conformance with Part 7.\n\n\n[ARTICLE:11.4.3.6:Sewage Systems]\n\n\n(1) Where the performance level of an existing building is reduced under Article 11.4.2.5., upgrading of a sewage system which is adversely affected by the construction, increase in occupant load, increase in the total daily design sanitary sewage flow or change in amount or type of sanitary sewage shall be required in conformance with Part 8.\n\n\n[ARTICLE:11.4.3.7:Extension of Buildings of Combustible Construction]\n\n\n(1) Where the performance level of an existing building is reduced under Article 11.4.2.6., the building shall be sprinklered."
        }
      ]
    },
    {
      "id": "11.5",
      "title": "Compliance Alternatives",
      "subsections": [
        {
          "id": "11.5.1",
          "title": "Compliance Alternatives (See Note A-11.5.1.)",
          "content": "[ARTICLE:11.5.1.1:Compliance Alternatives]\n\n\n(1) A compliance alternative shown in Table 11.5.1.1.-A, 11.5.1.1.-B, 11.5.1.1.-C, 11.5.1.1.-D/E or 11.5.1.1.-F may be substituted for a requirement contained in Part 3, 4, 6 or 8 where the chief building official is satisfied that compliance with the requirement is impracticable because,\n(a) of structural or construction difficulties, or\n(b) it is detrimental to the preservation of a heritage building.\n\n(2) A compliance alternative shown in Table 11.5.1.1.-A, 11.5.1.1.-B, 11.5.1.1.-C, 11.5.1.1.-D/E or 11.5.1.1.-F may be substituted for a requirement contained in Part 9 or 12 without satisfying the chief building official that compliance with the requirement is impracticable.\n\n### Table 11.2.1.1.-A Construction Index Forming Part of Sentence 11.2.1.1.(1)\n\n\n<table class=\"obc-table\"><thead><tr><th></th><th>Fire-Resistance Rating</th><th></th><th></th><th></th></tr></thead><tbody><tr><td>Floors over Basement</td><td>Other Floors</td><td>Roof</td><td>Type of Construction</td><td>C.I.(2)</td></tr><tr><td>3 h</td><td>3 h</td><td>1.5 h</td><td>Noncombustible</td><td>8<br>(1)</td></tr><tr><td>2 h</td><td>2 h</td><td>1 h</td><td>Noncombustible</td><td>7</td></tr><tr><td>1 h</td><td>1 h</td><td>45 min</td><td>Noncombustible</td><td>6</td></tr><tr><td>45 min</td><td>45 min</td><td>0 h</td><td>Noncombustible</td><td>5</td></tr><tr><td>45 min</td><td>45 min</td><td>45 min</td><td>Heavy Timber</td><td>5</td></tr><tr><td>45 min</td><td>45 min</td><td>45 min</td><td>Combustible</td><td>5</td></tr><tr><td>45 min</td><td>0 h</td><td>0 h</td><td>Noncombustible</td><td>4</td></tr><tr><td>45 min</td><td>45 min</td><td>0 h</td><td>Combustible</td><td>4</td></tr><tr><td>30 min</td><td>0 h</td><td>0 h</td><td>Noncombustible</td><td>3</td></tr><tr><td>30 min</td><td>30 min</td><td>0 h</td><td>Combustible</td><td>3</td></tr><tr><td>0 h</td><td>30 min</td><td>0 h</td><td>Combustible</td><td>2</td></tr><tr><td>0 h</td><td>0 h</td><td>0 h</td><td>Combustible</td><td>1<br>(1)</td></tr></tbody></table>\n\n\n\n<h5 class=\"table-notes-title\">Notes to Table 11.2.1.1-.A:</h5>\n\n- (1) C.I. of 1 is lowest fire protection performance level and C.I. of 8 is highest.\n- (2) Take highest rating for C.I. from Table 11.2.1.1.-A for existing building.\n\n### Table 11.2.1.1.-B(1)(4) Hazard Index Forming Part of Sentences 11.2.1.1.(1) and (2)\n\n\n<table class=\"obc-table\"><thead><tr><th>Group A</th><th></th><th>Occupancy<br>H.I.(5)</th><th></th><th></th><th></th><th></th><th></th></tr></thead><tbody><tr><td>Division 1</td><td>Small</td><td>Medium</td><td>Large</td><td></td><td></td><td></td><td></td></tr><tr><td>Dinner Theatres</td><td>4</td><td>5</td><td>6</td><td></td><td></td><td></td><td></td></tr><tr><td>Live Theatres</td><td>4</td><td>5</td><td>6</td><td></td><td></td><td></td><td></td></tr><tr><td>Motion Picture Theatres</td><td>4</td><td>5</td><td>6</td><td></td><td></td><td></td><td></td></tr><tr><td>Opera Houses</td><td>4</td><td>5</td><td>6</td><td></td><td></td><td></td><td></td></tr><tr><td>Television Studios (With Audience)</td><td>4</td><td>5</td><td>6</td><td></td><td></td><td></td><td></td></tr></tbody></table>\n\n\n\n<h5 class=\"table-notes-title\">Notes to Table 11.2.1.1.-B:</h5>\n\n\n<table class=\"obc-table\"><thead><tr><th>(1)</th><th>Building<br>Size (Maximum)(2)(3)</th><th></th></tr></thead><tbody><tr><td></td><td>–<br>300 occupant load<br>maximum / 1 storey<br>–<br>600 m2<br>/ 600 occupant load<br>maximum / 1 storey<br>with less than 40% 2 storey<br>(6)</td><td>Small<br>Medium</td></tr><tr><td></td><td>–<br>Any area / not exceeding 18 m high, measured between grade<br>and the floor level of the top storey<br>–<br>Over 18 m high, measured between grade<br>and the floor level of the top storey</td><td>Large<br>H.I.<br>= 7</td></tr></tbody></table>\n\n\n- (2) Sizes are based on building area and building height, unless noted.\n- (3) Building size is based on the existing building facing one street.\n- (4) For existing buildings facing multiple streets, see Sentence 11.2.1.1.(2) and Table 11.4.3.4.-A.\n- (5) Take lowest rating for H.I. from Table for major occupancy change.\n- (6) Building may have less than 40% of its area as 2 storeys for purposes as described in Clauses 3.2.2.21.(1)(c) and (d).\n\n\n<h4 class=\"table-title\">Table 11.2.1.1.-C(1)(4)(6) Hazard Index</h4>\n\nForming Part of Sentences 11.2.1.1.(1) and (2)\n\n\n<table class=\"obc-table\"><thead><tr><th>Group A</th><th></th><th>Occupancy<br>H.I.(5)</th><th></th><th></th></tr></thead><tbody><tr><td>Division 2</td><td>Small</td><td>Medium</td><td>Large</td><td></td></tr><tr><td>Art Galleries</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Auditoria</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Billiard Halls, Amusement Arcades</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Bowling Alleys</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Churches</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Clubs, Lodges (Non-Residential)</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Community Halls</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Concert Halls</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Court Rooms</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Dance Halls</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Daycare Centres</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Exhibition Halls (Without Sales)</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Exhibition Halls (With Sales)</td><td></td><td>See Group E</td><td></td><td></td></tr><tr><td>Gaming premises</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Gymnasia (Multi-Purpose)</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Gymnasia (Athletic)</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Lecture Halls</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Libraries</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Licensed Beverage Establishments</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Licensed Clubs, Lodges</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Museums</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Passenger Stations / Depots</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Public Heritage Buildings</td><td>3</td><td>—</td><td>—</td><td></td></tr><tr><td>Recreational Piers</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Restaurants</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Schools, Colleges</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Undertaking Premises</td><td>3</td><td>4</td><td>6</td><td></td></tr></tbody></table>\n\n\n\n<h4 class=\"table-title\">Table 11.2.1.1.-C(1)(4)(6) (Cont'd) Hazard Index</h4>\n\nForming Part of Sentences 11.2.1.1.(1) and (2)\n\n\n<h5 class=\"table-notes-title\">Notes to Table 11.2.1.1.-C:</h5>\n\n\n<table class=\"obc-table\"><thead><tr><th>(1)</th><th>Building<br>Size (Maximum)(2)(3)</th><th></th></tr></thead><tbody><tr><td></td><td>–<br>400 m2<br>/ 1 storey</td><td>Small</td></tr><tr><td></td><td>–<br>250 m2<br>/ 3 storey<br>(Public Heritage Building)</td><td>Small</td></tr><tr><td></td><td>–<br>800 m2<br>/ 2 storey</td><td>Medium</td></tr><tr><td></td><td>–<br>Any area / not exceeding 18 m high, measured between grade<br>and the floor level of the top storey</td><td>Large</td></tr><tr><td></td><td>–<br>Over 18 m high, measured between grade<br>and the floor level of the top storey</td><td>H.I.<br>= 7</td></tr></tbody></table>\n\n\n- (2) Sizes are based on building area and building height, unless noted.\n- (3) Building size is based on the existing building facing one street.\n- (4) For existing buildings facing multiple streets, see Sentence 11.2.1.1.(2) and Table 11.4.3.4.-A.\n- (5) Take lowest rating for H.I. from Table for major occupancy change.\n- (6) Buildings which exceed 3 storeys in building height and are of combustible construction shall be sprinklered.\n\n### Table 11.2.1.1.-D(1)(4) Hazard Index Forming Part of Sentences 11.2.1.1.(1) and (2)\n\n\n<table class=\"obc-table\"><thead><tr><th>Group A</th><th></th><th>Occupancy<br>H.I.(5)</th><th></th><th></th></tr></thead><tbody><tr><td>Division 3</td><td>Small</td><td>Medium</td><td>Large</td><td></td></tr><tr><td>Arenas (No Occupancy On Activity Surface)</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Armouries (No Occupancy On Activity Surface)</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Enclosed Stadia or Grandstand</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Ice Rinks (No Occupancy On<br>Activity Surface)</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Indoor Swimming Pools</td><td>3</td><td>4</td><td>6</td><td></td></tr></tbody></table>\n\n\n\n<h5 class=\"table-notes-title\">Notes to Table 11.2.1.1.-D:</h5>\n\n\n<table class=\"obc-table\"><thead><tr><th>(1)</th><th>Building<br>Size (Maximum)(2)(3)</th><th></th></tr></thead><tbody><tr><td></td><td>–<br>1<br>000 m2<br>/ 1 storey<br>–<br>2<br>000 m2<br>/ 2 storey</td><td>Small<br>Medium</td></tr><tr><td></td><td>–<br>Any area / not exceeding 18 m high, measured between grade<br>and the floor level of the top storey<br>–<br>Over 18 m high, measured between grade<br>and the floor level of the top storey</td><td>Large<br>H.I.<br>= 7</td></tr></tbody></table>\n\n\n- (2) Sizes are based on building area and building height, unless noted.\n- (3) Building size is based on the existing building facing one street.\n- (4) For existing buildings facing multiple streets, see Sentence 11.2.1.1.(2) and Table 11.4.3.4.-A.\n- (5) Take lowest rating for H.I. from Table for major occupancy change.\n\n\n<h4 class=\"table-title\">Table 11.2.1.1.-E(1)(3) Hazard Index</h4>\n\nForming Part of Sentences 11.2.1.1.(1) and (2)\n\n\n<table class=\"obc-table\"><thead><tr><th>Group A<br>Division 4</th><th></th><th>Occupancy<br>H.I.(4)</th><th></th><th></th></tr></thead><tbody><tr><td></td><td>Small</td><td>Medium</td><td>Large</td><td></td></tr><tr><td>Amusement Park Structures</td><td>2</td><td>3</td><td>5</td><td></td></tr><tr><td>Bleachers</td><td>1</td><td>3</td><td>5</td><td></td></tr><tr><td>Grandstands (Open)</td><td>1</td><td>3</td><td>5</td><td></td></tr><tr><td>Reviewing Stands</td><td>1</td><td>3</td><td>5</td><td></td></tr><tr><td>Stadia (Open)</td><td>1</td><td>3</td><td>5</td><td></td></tr></tbody></table>\n\n\n\n<h5 class=\"table-notes-title\">Notes to Table 11.2.1.1.-E:</h5>\n\n\n<table class=\"obc-table\"><thead><tr><th>(1)</th><th>Building<br>Size (Maximum)(2)</th><th></th><th></th><th></th></tr></thead><tbody><tr><td></td><td>–<br>2 500 occupant load<br>max. / min. limiting distance<br>of 6 m (combustible)<br>–<br>15 000 occupant load<br>maximum (with roof at least ½ rating if combustible)<br>–<br>Unlimited occupant load</td><td>Small<br>Medium<br>Large</td><td></td><td></td></tr></tbody></table>\n\n\n- (2) Building size is based on the existing building facing one street.\n- (3) For existing buildings facing multiple streets, see Sentence 11.2.1.1.(2) and Table 11.4.3.4.-A.\n- (4) Take lowest rating for H.I. from Table for major occupancy change.\n\n#### Table 11.2.1.1.-F (1) Hazard Index Forming Part of Sentences 11.2.1.1.(1) and (2)\n\nGroup B Division 1 Occupancy H.I.(3)(5) Small Medium Large Detention Facilities (Minimum Security)(4) 4 5 6 Detention Facilities (All Other Types of Security) 6 6 7 Police Station with Detention 3 — —\n\n\n<h5 class=\"table-notes-title\">Notes to Table 11.2.1.1.-F:</h5>\n\n\n<table class=\"obc-table\"><thead><tr><th>(1)</th><th>Building<br>Size (Maximum)(2)</th><th></th><th></th><th></th></tr></thead><tbody><tr><td></td><td>–<br>Any area / 1 storey</td><td>Small</td><td></td><td></td></tr><tr><td></td><td>–<br>600 m2<br>/ 1 storey<br>(Police Station with Detention)</td><td>Small</td><td></td><td></td></tr><tr><td></td><td>–<br>Any area (noncombustible) / 2 storey</td><td>Medium</td><td></td><td></td></tr><tr><td></td><td>–<br>Any area (noncombustible); 500 m2<br>(combustible) / 2 storey</td><td>Large</td><td></td><td></td></tr><tr><td></td><td>–<br>Over 18 m high, measured between grade<br>and the floor level of the top storey<br>(noncombustible)</td><td>H.I. = 7</td><td></td><td></td></tr><tr><td></td><td>–<br>Over 500 m2<br>(combustible) / over 2 storey</td><td>H.I. = 7</td><td></td><td></td></tr></tbody></table>\n\n\n- (2) Sizes are based on building area and building height, unless noted.\n- (3) When the size of a building falls into more than one category, the H.I. for the least restrictive is permitted to be used.\n- (4) Minimum security means occupants free to exit building in a fire emergency.\n- (5) Detention occupancy with any H.I. shall be sprinklered.\n\n### Table 11.2.1.1.-G(1)(4) Hazard Index Forming Part of Sentences 11.2.1.1.(1) and (2)\n\n\n<table class=\"obc-table\"><thead><tr><th>Group B</th><th>Occupancy<br>H.I.(5)(7)</th><th></th><th></th></tr></thead><tbody><tr><td>Division 2</td><td>Small</td><td>Medium</td><td>Large</td></tr><tr><td>Hospital, Long-Term Care Home<br>(Immobile)(6)</td><td>4</td><td>5</td><td>7</td></tr><tr><td>Hospital, Long-Term Care Home (Non-Ambulatory)(6)</td><td>4</td><td>5</td><td>6</td></tr><tr><td>Hospital, Long-Term Care Home (Ambulatory)(6)</td><td>3</td><td>4</td><td>6</td></tr><tr><td>Psychiatric Facility (Maximum Confinement)</td><td>4</td><td>5</td><td>7</td></tr><tr><td>Psychiatric Facility (Minimum Confinement)</td><td>3</td><td>4</td><td>6</td></tr><tr><td>Police Station With Detention (as Permitted in Article 3.1.2.4.)</td><td>3</td><td>—</td><td>—</td></tr></tbody></table>\n\n\n\n<h5 class=\"table-notes-title\">Notes to Table 11.2.1.1.-G:</h5>\n\n\n<table class=\"obc-table\"><thead><tr><th>(1)</th><th>Building<br>Size (Maximum)(2)(3)</th><th></th></tr></thead><tbody><tr><td></td><td>–<br>250 m2<br>/ 1 storey</td><td>Small</td></tr><tr><td></td><td>–<br>600 m2<br>/ 1 storey<br>(Police Station with Detention)</td><td>Small</td></tr><tr><td></td><td>–<br>500 m2<br>/ 2 storey; 1<br>000 m2<br>/ 1 storey</td><td>Medium</td></tr><tr><td></td><td>–<br>Any area (noncombustible); 500 m2<br>(combustible) / 2 storey</td><td>Medium</td></tr><tr><td></td><td>–<br>Any area / not exceeding 18 m high, measured between grade<br>and the floor level of the top storey</td><td>Large</td></tr><tr><td></td><td>–<br>Over 18 m high, measured between grade<br>and the floor level of the top storey</td><td>H.I. = 7</td></tr></tbody></table>\n\n\n- (2) Sizes are based on building area and building height, unless noted.\n- (3) Building size is based on the existing building facing one street.\n- (4) For existing buildings facing multiple streets, see Sentence 11.2.1.1.(2) and Table 11.4.3.4.-A.\n- (5) When the size of a building falls into more than one category, the H.I. for the least restrictive is permitted to be used.\n- (6) Immobile means patients are attached to life support systems and cannot be moved. Non-Ambulatory means patients are confined to bed and require transportation. Ambulatory means patients may walk on their own.\n- (7) Care and treatment occupancy with any H.I. shall be sprinklered.\n\n### Table 11.2.1.1.-H(1) Hazard Index Forming Part of Sentences 11.2.1.1.(1) and (2)\n\n\n<table class=\"obc-table\"><thead><tr><th>Group B</th><th></th><th>Occupancy H.I.(4)(5)</th><th></th><th></th></tr></thead><tbody><tr><td>Division 3</td><td>Small</td><td>Medium</td><td>Large</td><td></td></tr><tr><td>Residential care facilities</td><td></td><td></td><td></td><td></td></tr><tr><td>(Ambulatory)(6)</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>(Non-Ambulatory)(6)</td><td>4</td><td>5</td><td>6</td><td></td></tr><tr><td>Children Custodial Homes</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Convalescent Homes</td><td></td><td></td><td></td><td></td></tr><tr><td>(Ambulatory)(6)</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>(Non-Ambulatory)(6)</td><td>4</td><td>5</td><td>6</td><td></td></tr><tr><td>Group Homes For<br>Adult Residents with Developmental Disabilities</td><td></td><td></td><td></td><td></td></tr><tr><td>(Minimum Confinement)</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>(Maximum Confinement)</td><td>4</td><td>5</td><td>6</td><td></td></tr></tbody></table>\n\n\n\n<h5 class=\"table-notes-title\">Notes to Table 11.2.1.1.-H:</h5>\n\n\n<table class=\"obc-table\"><thead><tr><th>(1)</th><th>Building<br>Size (Maximum)(2)(3)</th><th></th></tr></thead><tbody><tr><td></td><td>–<br>600 m2<br>/ 1 storey<br>–<br>500 m2<br>/ 2 storey;<br>1<br>000 m2<br>/ 1 storey<br>–<br>Any area / not exceeding 18 m high, measured between grade<br>and the floor level of the top storey<br>–<br>Over 18 m high, measured between grade<br>and the floor level of the top storey</td><td>Small<br>Medium<br>Large<br>H.I. = 7</td></tr></tbody></table>\n\n\n- (2) Sizes are based on building area and building height, unless noted.\n- (3) Building size is based on the existing building facing one street.\n- (4) When the size of a building falls into more than one category, the H.I. for the least restrictive is permitted to be used.\n- (5) Care occupancy with any H.I. shall be sprinklered.\n- (6) Non-Ambulatory means patients are confined to bed and require transportation. Ambulatory means patients may walk on their own.\n\n#### Table 11.2.1.1.-I (1) Hazard Index Forming Part of Sentences 11.2.1.1.(1) and (2)\n\n\n<table class=\"obc-table\"><thead><tr><th></th><th></th><th>Occupancy<br>H.I.(4)</th><th></th><th></th></tr></thead><tbody><tr><td>Group C</td><td>Small</td><td>Medium</td><td>Large</td><td></td></tr><tr><td>Apartments</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Boarding Houses/Group Homes</td><td>3</td><td>—</td><td>—</td><td></td></tr><tr><td>Clubs, Residential</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Colleges, Residential</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Convents</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Dormitories/Hostels</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Hotels</td><td>3</td><td>5</td><td>6</td><td></td></tr><tr><td>Houses</td><td>2</td><td>2</td><td>—</td><td></td></tr><tr><td>Lodging Houses</td><td>3</td><td>—</td><td>—</td><td></td></tr><tr><td>Live/work units</td><td>4</td><td>5</td><td>7</td><td></td></tr><tr><td>Monasteries</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Public Heritage Buildings</td><td>3</td><td>—</td><td>—</td><td></td></tr><tr><td>Rectories</td><td>2</td><td>—</td><td>—</td><td></td></tr><tr><td>Retirement Homes</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Rooming Houses</td><td>3</td><td>—</td><td>—</td><td></td></tr><tr><td>Schools, Boarding</td><td>3</td><td>4</td><td>6</td><td></td></tr></tbody></table>\n\n\n\n<h5 class=\"table-notes-title\">Notes to Table 11.2.1.1.-I:</h5>\n\n\n<table class=\"obc-table\"><thead><tr><th>(1)</th><th>Building<br>Size (Maximum)(2)(3)</th><th></th></tr></thead><tbody><tr><td></td><td>–<br>600 m2<br>/ 3 storey</td><td>Small</td></tr><tr><td></td><td>–<br>250 m2<br>/ 3 storey<br>(Public Heritage Building)</td><td>Small</td></tr><tr><td></td><td>–<br>2 000 m2<br>/ not exceeding 6 storeys</td><td>Medium</td></tr><tr><td></td><td>–<br>Any area / not exceeding 36 m high, measured between grade<br>and the floor level of the top storey</td><td>Large</td></tr><tr><td></td><td>Over 36 m high, measured between grade<br>and the floor level of the top storey<br>–</td><td>H.I. = 7</td></tr><tr><td></td><td>–<br>Hotels<br>over 18 m high, measured between grade<br>and the floor level of the top storey</td><td>H.I. = 7</td></tr></tbody></table>\n\n\n- (2) Sizes are based on building area and building height, unless noted.\n- (3) Buildings which exceed 3 storeys in building height and are of combustible construction shall be sprinklered.\n- (4) Take lowest rating for H.I. from Table for major occupancy change.\n\n#### Table 11.2.1.1.-J (1)(4)6) Hazard Index Forming Part of Sentences 11.2.1.1.(1) and (2)\n\n\n<table class=\"obc-table\"><thead><tr><th></th><th>Occupancy<br>H.I.(5)</th><th></th><th></th></tr></thead><tbody><tr><td>Group D</td><td>Small</td><td>Medium</td><td>Large</td></tr><tr><td>Advertising and Sales Offices</td><td>3</td><td>3</td><td>5</td></tr><tr><td>Automatic Bank Deposit</td><td>3</td><td>4</td><td>5</td></tr><tr><td>Barber/Hairdresser Shops</td><td>3</td><td>4</td><td>5</td></tr><tr><td>Beauty Parlours</td><td>3</td><td>4</td><td>5</td></tr><tr><td>Branch Banks</td><td>3</td><td>4</td><td>5</td></tr><tr><td>Car Rental Premises</td><td>3</td><td>3</td><td>5</td></tr><tr><td>Chiropractic Offices</td><td>3</td><td>4</td><td>5</td></tr><tr><td>Communications Offices (Telecommunications)</td><td>3</td><td>4</td><td>5</td></tr><tr><td>Communications Offices (Courier)</td><td>3</td><td>3</td><td>5</td></tr><tr><td>Computer Centres</td><td>3</td><td>4</td><td>5</td></tr><tr><td>Construction Offices</td><td>3</td><td>3</td><td>5</td></tr><tr><td>Costume Rental Premises</td><td>3</td><td>4</td><td>5</td></tr><tr><td>Dental Offices (Denture Clinic)</td><td>3</td><td>4</td><td>5</td></tr><tr><td>Dental Offices (Surgical/Anaesthesia)</td><td>4</td><td>5</td><td>6</td></tr><tr><td>Dental Offices (General)</td><td>3</td><td>4</td><td>5</td></tr><tr><td>Dry Cleaning Depots</td><td>3</td><td>4</td><td>5</td></tr><tr><td>Dry Cleaning Premises (Self-Serve)</td><td>4</td><td>4</td><td>5</td></tr><tr><td>Health/Fitness Clubs</td><td>3</td><td>4</td><td>5</td></tr><tr><td>Laundries (Self-Serve)</td><td>4</td><td>4</td><td>5</td></tr><tr><td>Massage Parlours</td><td>3</td><td>4</td><td>5</td></tr><tr><td>Medical Offices (Examination)</td><td>3</td><td>4</td><td>5</td></tr><tr><td>Medical Offices (Surgical/Anaesthesia)</td><td>4</td><td>5</td><td>6</td></tr><tr><td>Offices (Business)</td><td>3</td><td>3</td><td>5</td></tr><tr><td>Offices (Charitable)</td><td>3</td><td>3</td><td>5</td></tr><tr><td>Offices (Legal/Accounting)</td><td>3</td><td>3</td><td>5</td></tr><tr><td>Offices/Studios (Design)</td><td>3</td><td>4</td><td>5</td></tr></tbody></table>\n\n\n#### Table 11.2.1.1.-J (1)(4)(6) (Cont'd) Hazard Index Forming Part of Sentences 11.2.1.1.(1) and (2)\n\n\n<table class=\"obc-table\"><thead><tr><th></th><th></th><th>Occupancy<br>H.I.(5)</th><th></th><th></th></tr></thead><tbody><tr><td>Group D</td><td>Small</td><td>Medium</td><td>Large</td><td></td></tr><tr><td>Pharmacy Offices</td><td>3</td><td>4</td><td>5</td><td></td></tr><tr><td>Photographic Studios</td><td>3</td><td>4</td><td>5</td><td></td></tr><tr><td>Physiotherapy Offices</td><td>3</td><td>4</td><td>5</td><td></td></tr><tr><td>Police Stations (No Detention)</td><td>3</td><td>4</td><td>5</td><td></td></tr><tr><td>Printing and Duplicating</td><td>4</td><td>5</td><td>6</td><td></td></tr><tr><td>Public Heritage Buildings</td><td>3</td><td>—</td><td>—</td><td></td></tr><tr><td>Public Saunas</td><td>3</td><td>4</td><td>5</td><td></td></tr><tr><td>Radio Stations (No Audience)</td><td>3</td><td>4</td><td>5</td><td></td></tr><tr><td>Small Tool Rental Premises</td><td>3</td><td>4</td><td>5</td><td></td></tr><tr><td>Suntan Parlours</td><td>3</td><td>4</td><td>5</td><td></td></tr><tr><td>Veterinary Offices</td><td>3</td><td>4</td><td>5</td><td></td></tr></tbody></table>\n\n\n\n<h5 class=\"table-notes-title\">Notes to Table 11.2.1.1.-J:</h5>\n\n\n<table class=\"obc-table\"><thead><tr><th>(1)</th><th>Building<br>Size (Maximum)(2)(3)</th><th></th></tr></thead><tbody><tr><td></td><td>–<br>800 m2<br>/ 2 storey</td><td>Small</td></tr><tr><td></td><td>–<br>250 m2<br>/ 3 storey<br>(Public Heritage Building)</td><td>Small</td></tr><tr><td></td><td>–<br>1 600 m2<br>/ 3 storey</td><td>Medium</td></tr><tr><td></td><td>–<br>Any area / not exceeding 18 m<br>high, measured between grade<br>and the floor level of the top storey</td><td>Large</td></tr><tr><td></td><td>–<br>Over 18 m high, measured between grade<br>and the floor level of the top storey,<br>but<br>not exceeding 36 m high, measured between grade<br>and the floor level of the top storey</td><td>H.I. = 6</td></tr><tr><td></td><td>–<br>Over 36 m high, measured between grade<br>and the floor level of the top storey</td><td>H.I. = 7</td></tr></tbody></table>\n\n\n- (2) Sizes are based on building area and building height, unless noted.\n- (3) Building size is based on the existing building facing one street.\n- (4) For existing buildings facing multiple streets, see Sentence 11.2.1.1.(2) and Table 11.4.3.4.-A.\n- (5) When the size of a building falls into more than one category, the H.I. for the least restrictive is permitted to be used.\n- (6) Buildings which exceed 3 storeys in building height and are of combustible construction shall be sprinklered.\n\n### Table 11.2.1.1.-K(1)(4)(6) Hazard Index Forming Part of Sentences 11.2.1.1.(1) and (2)\n\n\n<table class=\"obc-table\"><thead><tr><th></th><th></th><th>Occupancy<br>H.I.(5)</th><th></th></tr></thead><tbody><tr><td>Group E</td><td>Small</td><td>Medium</td><td>Large</td></tr><tr><td>Automotive/Hardware Department Stores</td><td>4</td><td>5</td><td>7</td></tr><tr><td>China Shops</td><td>3</td><td>4</td><td>6</td></tr><tr><td>Department Stores</td><td>4</td><td>5</td><td>7</td></tr><tr><td>Electrical Stores (Fixtures)</td><td>3</td><td>3</td><td>5</td></tr><tr><td>Exhibition Halls (With Sales)</td><td>4</td><td>5</td><td>7</td></tr><tr><td>\"Fast Food\" Outlets</td><td>3</td><td>4</td><td>5</td></tr><tr><td>Feed and Seed Stores</td><td>4</td><td>5</td><td>7</td></tr><tr><td>Flea Markets</td><td>4</td><td>5</td><td>7</td></tr><tr><td>Flowers Shops</td><td>3</td><td>4</td><td>6</td></tr><tr><td>\"Food\" and Vegetable Markets</td><td></td><td>4</td><td>6</td></tr><tr><td>Garden Shops</td><td>3</td><td>4</td><td>6</td></tr><tr><td>\"Gas\" Bars</td><td>4</td><td>5</td><td>7</td></tr><tr><td>Gift Shops</td><td>3</td><td>4</td><td>6</td></tr><tr><td>Home Improvement Stores</td><td>4</td><td>5</td><td>7</td></tr><tr><td>Kitchen/Bathroom Cupboards Stores</td><td>3</td><td>4</td><td>6</td></tr><tr><td>Plumbing Stores (Fixtures/Accessories)</td><td>3</td><td>3</td><td>5</td></tr><tr><td>\"Pop\" Shops</td><td>3</td><td>4</td><td>6</td></tr><tr><td>Public Heritage Buildings</td><td>3</td><td>—</td><td>—</td></tr><tr><td>Rentals</td><td></td><td>See Group D</td><td></td></tr><tr><td>Restaurants (Not More Than 30 Persons as Permitted by Article 3.1.2.7.)</td><td>3</td><td>4</td><td>5</td></tr><tr><td>Shopping Malls</td><td>4</td><td>5</td><td>7</td></tr><tr><td>Stationery/Office Supply Stores</td><td>3</td><td>4</td><td>6</td></tr><tr><td>Stores (Art)</td><td>3</td><td>4</td><td>6</td></tr><tr><td>Stores (Baked Goods)</td><td>3</td><td>4</td><td>6</td></tr><tr><td>Stores (Beer)</td><td>3</td><td>4</td><td>6</td></tr><tr><td>Stores (Book)</td><td>3</td><td>4</td><td>6</td></tr><tr><td>Stores (Camera)</td><td>3</td><td>4</td><td>6</td></tr><tr><td>Stores (Candy)</td><td>3</td><td>4</td><td>6</td></tr></tbody></table>\n\n\n\n<h4 class=\"table-title\">Table 11.2.1.1.-K(1)(4)(6) (Cont'd) Hazard Index</h4>\n\nForming Part of Sentences 11.2.1.1.(1) and (2)\n\n\n<table class=\"obc-table\"><thead><tr><th></th><th></th><th>Occupancy<br>H.I.(5)</th><th></th><th></th></tr></thead><tbody><tr><td>Group E</td><td>Small</td><td>Medium</td><td>Large</td><td></td></tr><tr><td>Stores (Clothing)</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Stores (Drugs)</td><td>4</td><td>4</td><td>6</td><td></td></tr><tr><td>Stores (Electronic)</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Stores (Floor Coverings)</td><td>4</td><td>5</td><td>7</td><td></td></tr><tr><td>Stores (Food)</td><td>3</td><td>3</td><td>6</td><td></td></tr><tr><td>Stores (Furniture/Appliances)</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Stores (Hardware)</td><td>4</td><td>5</td><td>7</td><td></td></tr><tr><td>Stores (Health)</td><td>4</td><td>4</td><td>6</td><td></td></tr><tr><td>Stores (Hobby)</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Stores (Jewellery)</td><td>3</td><td>3</td><td>5</td><td></td></tr><tr><td>Stores (Paint/Wallpaper)</td><td>4</td><td>5</td><td>7</td><td></td></tr><tr><td>Stores (Pet)</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Stores (Records/Tapes)</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Stores (Spirits)</td><td>4</td><td>5</td><td>7</td><td></td></tr><tr><td>Stores (Toys)</td><td>4</td><td>5</td><td>7</td><td></td></tr><tr><td>Stores (Variety)</td><td>4</td><td>4</td><td>6</td><td></td></tr><tr><td>Stores (Video Sales/Rental)</td><td>3</td><td>4</td><td>6</td><td></td></tr><tr><td>Supermarkets</td><td>3</td><td>4</td><td>6</td><td></td></tr></tbody></table>\n\n\n\n<h5 class=\"table-notes-title\">Notes to Table 11.2.1.1.-K:</h5>\n\n\n<table class=\"obc-table\"><thead><tr><th>(1)</th><th>Building<br>Size (Maximum)(2)(3)</th><th></th></tr></thead><tbody><tr><td></td><td>–<br>600 m2<br>/ 2 storey<br>–<br>250 m2<br>/ 3 storey<br>(Public Heritage Building)</td><td>Small<br>Small</td></tr><tr><td></td><td>–<br>800 m2<br>/ 3 storey</td><td>Medium</td></tr><tr><td></td><td>–<br>Any area / up to 18 m high, measured between grade<br>and the floor level of the top storey</td><td>Large</td></tr><tr><td></td><td>–<br>Over 18 m<br>high, measured between grade<br>and the floor level of the top storey</td><td>H.I. = 7</td></tr></tbody></table>\n\n\n- (2) Sizes are based on building area and building height, unless noted.\n- (3) Building size is based on the existing building facing one street.\n- (4) For existing buildings facing multiple streets, see Sentence 11.2.1.1.(2) and Table 11.4.3.4.-A.\n- (5) When the size of a building falls into more than one category, the H.I. for the least restrictive is permitted to be used.\n- (6) All buildings 1 500 m<sup>2</sup> and over are to be sprinklered.\n\n#### Table 11.2.1.1.-L (1)(4)(5) Hazard Index Forming Part of Sentences 11.2.1.1.(1) and (2)\n\n\n<table class=\"obc-table\"><thead><tr><th>Group F<br>Division 1</th><th></th><th>Occupancy<br>H.I.(3)</th><th></th><th></th></tr></thead><tbody><tr><td></td><td></td><td>Medium</td><td>Large</td><td></td></tr><tr><td>Ammunition Manufacturing and Storage</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Black Powder Manufacturing and Storage</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Bulk Plants for Flammable Liquids</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Bulk Storage Warehouse (Hazardous Substances)</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Cereal and Feed Mills</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Chemical Manufacturing/Processing Plant</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Distilleries</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Dry Cleaning Plants (Flammable)</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Explosives Manufacturing and Storage</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Fertilizer Manufacturing Plants</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Fireworks Manufacturing and Storage</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Flour Mills</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Gas (Flammable) Compressor Stations</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Gas (Flammable) Manufacturing and Storage</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Grain Elevators</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Lacquer Factories</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Loading Area for all Group F, Division 1</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Mattress Factories (High Fire Load)</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Paint/Varnish/Pyroxylin Factories</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Petrochemical Plants</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Refineries</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Rubber Processing Plants</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Spray Painting Operations</td><td>3</td><td>6</td><td>8</td><td></td></tr><tr><td>Waste Paper Processing Plants (Dry)</td><td>3</td><td>6</td><td>8</td><td></td></tr></tbody></table>\n\n\n\n<h5 class=\"table-notes-title\">Notes to Table 11.2.1.1.-L:</h5>\n\n\n<table class=\"obc-table\"><thead><tr><th>(1)</th><th>Building<br>Size (Maximum)(2)</th><th></th></tr></thead><tbody><tr><td></td><td>–<br>400 m2<br>/ 2 storey</td><td>Small</td></tr><tr><td></td><td>–<br>600 m2<br>/ 4 storey</td><td>Medium</td></tr><tr><td></td><td>–<br>1 500 m2<br>/ 4 storey</td><td>Large</td></tr></tbody></table>\n\n\n- (2) Sizes are based on building area and building height.\n- (3) When the size of a building falls into more than one category, the H.I. for the least restrictive is permitted to be used.\n- (4) All buildings 1 500 m<sup>2</sup> and over are to be sprinklered.\n- (5) All floor assemblies shall be fire separations.\n\n### Table 11.2.1.1.-M(1)(4)(6) Hazard Index Forming Part of Sentences 11.2.1.1.(1) and (2)\n\n\n<table class=\"obc-table\"><thead><tr><th>Group F</th><th></th><th>Occupancy<br>H.I.(5)</th><th></th><th></th></tr></thead><tbody><tr><td>Division 2</td><td></td><td>Medium</td><td>Large</td><td></td></tr><tr><td>Aircraft Hangars</td><td>3</td><td>5</td><td>6</td><td></td></tr><tr><td>Abattoirs</td><td>3</td><td>4</td><td>5</td><td></td></tr><tr><td>Bakeries</td><td>3</td><td>5</td><td>6</td><td></td></tr><tr><td>Body Shops</td><td>3</td><td>5</td><td>6</td><td></td></tr><tr><td>Candy Plants</td><td>3</td><td>4</td><td>5</td><td></td></tr><tr><td>Cold Storage Plants<br>Combustible<br>Insulation<br>Flammable Refrigerant<br>Combustible<br>Packaging</td><td>3</td><td>5</td><td>7</td><td></td></tr><tr><td>Combustible<br>Insulation<br>Flammable Refrigerant<br>Noncombustible<br>Packaging</td><td>3</td><td>5</td><td>6</td><td></td></tr><tr><td>Combustible<br>Insulation<br>Non-Flammable Refrigerant<br>Noncombustible<br>Packaging</td><td>3</td><td>4</td><td>5</td><td></td></tr><tr><td>Noncombustible<br>Insulation<br>Non-Flammable Refrigerant<br>Noncombustible<br>Packaging</td><td>2</td><td>3</td><td>4</td><td></td></tr><tr><td>Dry Cleaning Establishments (Non-flammable or Non-explosive)</td><td>3</td><td>4</td><td>5</td><td></td></tr><tr><td>Electrical Substations</td><td>3</td><td>4</td><td>5</td><td></td></tr><tr><td>Factories (High Fire Load)</td><td>3</td><td>5</td><td>6</td><td></td></tr><tr><td>Freight Depots (High Fire Load)</td><td>3</td><td>5</td><td>6</td><td></td></tr><tr><td>Helicopter Landings (On Roof)</td><td></td><td>4</td><td>5</td><td></td></tr><tr><td>Laboratories (High Fire Load)</td><td></td><td>5</td><td>6</td><td></td></tr><tr><td>Laundries (Not Self-Serve)</td><td>3</td><td>4</td><td>5</td><td></td></tr><tr><td>Manufacturer Sales (High Fire Load)</td><td>3</td><td>5</td><td>6</td><td></td></tr><tr><td>Mattress Factories</td><td>3</td><td>4</td><td>5</td><td></td></tr><tr><td>Meat Packing Plants</td><td>3</td><td>4</td><td>5</td><td></td></tr></tbody></table>\n\n\n\n<h4 class=\"table-title\">Table 11.2.1.1.-M(1)(4)(6) (Cont'd) Hazard Index</h4>\n\nForming Part of Sentences 11.2.1.1.(1) and (2)\n\n\n<table class=\"obc-table\"><thead><tr><th>Group F</th><th></th><th>Occupancy<br>H.I.(5)</th><th></th></tr></thead><tbody><tr><td>Division 2</td><td>Small</td><td>Medium</td><td>Large</td></tr><tr><td>Packaging Manufacturers (Cellulose)</td><td>3</td><td>4</td><td>5</td></tr><tr><td>Packaging Manufacturers (Noncombustible)</td><td>2</td><td>3</td><td>4</td></tr><tr><td>Packaging Manufacturers (Plastics)</td><td>3</td><td>5</td><td>6</td></tr><tr><td>Paper Processing Plants (Wet)</td><td>3</td><td>5</td><td>6</td></tr><tr><td>Planing Mills</td><td>3</td><td>5</td><td>6</td></tr><tr><td>Printing Plants</td><td>3</td><td>4</td><td>5</td></tr><tr><td>Public Heritage Buildings</td><td>3</td><td>3</td><td>—</td></tr><tr><td>Repair Garages</td><td>3</td><td>5</td><td>6</td></tr><tr><td>Sample Display Rooms (High Fire Load)</td><td>3</td><td>5</td><td>6</td></tr><tr><td>Self-Service Storage Buildings</td><td>3</td><td>4</td><td>5</td></tr><tr><td>Service Stations (No Spray Painting)</td><td>3</td><td>5</td><td>6</td></tr><tr><td>Storage Rooms (High Fire Load)</td><td>3</td><td>5</td><td>6</td></tr><tr><td>Television Studios (No Audience)</td><td>3</td><td>4</td><td>5</td></tr><tr><td>Tire Storage</td><td>3</td><td>5</td><td>6</td></tr><tr><td>Warehouses (High Fire Load)</td><td>3</td><td>5</td><td>6</td></tr><tr><td>Welding Shops</td><td>3</td><td>5</td><td>6</td></tr><tr><td>Wholesale Rooms (High Fire Load)</td><td>3</td><td>5</td><td>6</td></tr><tr><td>Wood Working Factories</td><td>3</td><td>5</td><td>6</td></tr><tr><td>Workshops (High Fire Load)</td><td>3</td><td>5</td><td>6</td></tr></tbody></table>\n\n\n\n<h5 class=\"table-notes-title\">Notes to Table 11.2.1.1.-M:</h5>\n\n\n<table class=\"obc-table\"><thead><tr><th>(1)</th><th>Building<br>Size (Maximum)(2)(3)</th><th></th></tr></thead><tbody><tr><td></td><td>–<br>600 m2<br>/ 2 storey</td><td>Small</td></tr><tr><td></td><td>–<br>800 m2<br>/ 4 storey</td><td>Medium</td></tr><tr><td></td><td>–<br>600 m2<br>/ 3 storey<br>(Public Heritage Building)</td><td>Medium</td></tr><tr><td></td><td>–<br>Any area / 6 storey<br>not exceeding 18 m high, measured between grade<br>and the floor level of the top<br>storey</td><td>Large</td></tr><tr><td></td><td>–<br>Over 18 m<br>high, measured between grade<br>and the floor level of the top<br>storey</td><td>H.I. = 7</td></tr></tbody></table>\n\n\n- (2) Sizes are based on building area and building height, unless noted.\n- (3) Building size is based on the existing building facing one street.\n- (4) For existing buildings facing multiple streets, see Sentence 11.2.1.1.(2) and Table 11.4.3.4.-A.\n- (5) When the size of a building falls into more than one category, the H.I. for the least restrictive is permitted to be used.\n- (6) All buildings 1 500 m<sup>2</sup> and over are to be sprinklered.\n\n### Table 11.2.1.1.-N(1)(4) Hazard Index Forming Part of Sentences 11.2.1.1.(1) and (2)\n\n\n<table class=\"obc-table\"><thead><tr><th>Group F</th><th></th><th>Occupancy<br>H.I.(5)</th><th></th><th></th></tr></thead><tbody><tr><td>Division 3</td><td></td><td>Medium</td><td>Large</td><td></td></tr><tr><td>Creameries</td><td>2</td><td>2</td><td>3</td><td></td></tr><tr><td>Factories (Low Fire Load)</td><td>2</td><td>3</td><td>4</td><td></td></tr><tr><td>Freight Depots (Low Fire Load)</td><td>2</td><td>3</td><td>4</td><td></td></tr><tr><td>Laboratories (Low Fire Load)</td><td>2</td><td>3</td><td>4</td><td></td></tr><tr><td>Manufacturers Sales (Low Fire Load)</td><td>2</td><td>3</td><td>4</td><td></td></tr><tr><td>Power Plants</td><td>3</td><td>4</td><td>5</td><td></td></tr><tr><td>Public Heritage Buildings</td><td>3</td><td>3</td><td>—</td><td></td></tr><tr><td>Sample Display Rooms (Low Fire Load)</td><td>2</td><td>3</td><td>4</td><td></td></tr><tr><td>Storage Garages</td><td>2</td><td>3</td><td>4</td><td></td></tr><tr><td>Storage Rooms (Low Fire Load)</td><td>2</td><td>3</td><td>4</td><td></td></tr><tr><td>Warehouses (Low Fire Load)</td><td>2</td><td>3</td><td>4</td><td></td></tr><tr><td>Wholesale Rooms (Low Fire Load)</td><td>2</td><td>3</td><td>4</td><td></td></tr><tr><td>Workshops (Low Fire Load)</td><td>2</td><td>3</td><td>4</td><td></td></tr></tbody></table>\n\n\n\n<h5 class=\"table-notes-title\">Notes to Table 11.2.1.1.-N:</h5>\n\n\n<table class=\"obc-table\"><thead><tr><th>(1)</th><th>Building<br>Size (Maximum)(2)(3)</th><th></th></tr></thead><tbody><tr><td></td><td>–<br>800 m2<br>/ 2 storey</td><td>Small</td></tr><tr><td></td><td>–<br>1 200 m2<br>/ 4 storey</td><td>Medium</td></tr><tr><td></td><td>/ 3 storey<br>(Public Heritage Building)<br>–<br>600 m2</td><td>Medium</td></tr><tr><td></td><td>–<br>Any area / 6 storey<br>not exceeding 18 m high, measured between grade<br>and the floor level of the top<br>storey</td><td>Large</td></tr><tr><td></td><td>–<br>Over 18 m, but not exceeding 36 m high, measured between grade<br>and the floor level of the top<br>storey</td><td>H.I. = 5</td></tr><tr><td></td><td>–<br>Over 36 m<br>high, measured between grade<br>and the floor level of the top storey</td><td>H.I. = 6</td></tr></tbody></table>\n\n\n- (2) Sizes are based on building area and building height, unless noted.\n- (3) Building size is based on the existing building facing one street.\n- (4) For existing buildings facing multiple streets, see Sentence 11.2.1.1.(2) and Table 11.4.3.4.-A.\n- (5) When the size of a building falls into more than one category, the H.I. for the least restrictive is permitted to be used.\n\n### Table 11.4.3.3. For Evaluation and Upgrading of Early Warning/Evacuation Forming Part of Sentences 11.4.3.3.(1) and 11.4.3.4.(3)\n\n\n<table class=\"obc-table\"><thead><tr><th>Notes</th><th>Early Warning and Evacuation,</th><th>Part 11</th></tr></thead><tbody><tr><td></td><td>Evaluation and Upgrading</td><td>Compliance Alternative(1)</td></tr><tr><td></td><td>Early warning and evacuation to be checked against</td><td></td></tr><tr><td>(2)</td><td>(a)<br>access to exit<br>widths based on occupant load<br>in Subsection 3.3.1. or 9.9.3.;<br>(b)<br>exit<br>widths based on occupant load<br>in Subsection 3.4.3. or 9.9.3.;<br>(c)<br>exit<br>signs in Subsection 3.4.5. or 9.9.11.;<br>(d)<br>lighting of exits, lighting of access to exits<br>and emergency lighting in<br>Subsection<br>3.2.7. or 9.9.12.;<br>(e)<br>fire alarm system in Subsection 3.2.4. or 9.10.18.;<br>(f)<br>smoke alarms<br>in Subsection 9.10.19.;<br>(g)<br>travel distance and number of exits<br>in other Parts; and<br>(h)<br>door release hardware requirements in Articles 3.3.1.13. and 3.4.6.16.,</td><td>EARLY WARNING<br>(a)<br>Compliance alternatives<br>as listed<br>may be used.<br>EVACUATION<br>(b)<br>Compliance alternatives<br>as listed<br>to access to exit<br>and exit<br>widths,<br>number of exits, door release<br>hardware, and travel distance<br>may be used.</td></tr><tr><td></td><td>and deficiencies shall be upgraded.</td><td></td></tr><tr><td>(3)</td><td>Early warning and evacuation to be checked against<br>(a)<br>access to exit<br>widths based on occupant load<br>in Subsection 3.3.1. or 9.9.3.;<br>(b)<br>exit<br>widths based on occupant load<br>in Subsection 3.4.3. or 9.9.3.;<br>(c)<br>exit<br>signs in Subsection 3.4.5. or 9.9.11.;<br>(d)<br>lighting of exits, lighting of access to exits<br>and emergency lighting in<br>Subsection<br>3.2.7. or 9.9.12.;<br>(e)<br>fire alarm system in Subsection 3.2.4. or 9.10.18.;<br>(f)<br>smoke alarms<br>in Subsection 9.10.19.;<br>(g)<br>travel distance and number of exits<br>in other Parts;<br>(h)<br>smoke control measures, and at least one elevator to permit transport of<br>firefighters to all floors in<br>hotels<br>whose floor level is more than 18 m high<br>measured between grade<br>and floor level of the top<br>storey<br>as per<br>Subsection<br>3.2.6., and<br>(i)<br>door release hardware requirements in Articles 3.3.1.13. and 3.4.6.16.,<br>and deficiencies shall be upgraded.</td><td>EARLY WARNING<br>(a)<br>Compliance alternatives<br>as listed<br>may be used.<br>EVACUATION<br>(b)<br>Compliance alternatives<br>as listed<br>to access to exit<br>and exit<br>widths,<br>number of exits, door release<br>hardware, and travel distance<br>may be used.</td></tr></tbody></table>\n\n\n\n<h5 class=\"table-notes-title\">Notes to Table 11.4.3.3.:</h5>\n\n- (1) See Tables 11.5.1.1.-A to 11.5.1.1.-F for compliance alternatives that may be used.\n- (2) Applies to change of major occupancy to one of equal or lesser hazard, and to increase in occupant load by 15% or less.\n- (3) Applies to change of major occupancy to one of greater hazard, and to increase in occupant load greater than 15%.\n\n\n<h4 class=\"table-title\">Table 11.4.3.4.-A Additional Upgrading</h4>\n\nForming Part of Sentences 11.2.1.1.(2) and 11.4.3.4.(1)\n\n\n<table class=\"obc-table\"><thead><tr><th>New Major<br>Occupancy<br>(H.I.) Number(3)</th><th>Increase of C.I.<br>to Equal<br>H.I.<br>to Support New<br>Major Occupancy</th><th>Additional Required<br>Upgrading</th><th>Part 11<br>Alternative<br>Compliance (A.C.)</th><th>Comments(1)(2)</th></tr></thead><tbody><tr><td>H.I.<br>2</td><td>C.I.<br>1 to 2</td><td>Comply with Table 11.2.1.1A<br>ratings for C.I.<br>of 2</td><td>(a)<br>Provide early warning<br>system, or<br>(b)<br>Comply with any A.C.'s in<br>Col. 4.</td><td></td></tr><tr><td>H.I. 3</td><td>C.I.<br>(1 or 2) to 3</td><td>Comply with Table 11.2.1.1A<br>ratings for C.I.<br>of 3</td><td>(a)<br>Provide early warning<br>system, or<br>(b)<br>Comply with any A.C.'s in<br>Col. 4.</td><td>Combustible<br>to<br>Combustible<br>only.</td></tr><tr><td>H.I.<br>4</td><td>C.I.<br>(1, 2 or 3) to 4</td><td>Comply with Table 11.2.1.1A<br>ratings for C.I.<br>of 4</td><td>Provide sprinklers in locations<br>where assemblies do not comply<br>with Table 11.2.1.1A</td><td>Combustible<br>to<br>Combustible.<br>Noncombustible<br>to<br>Noncombustible.</td></tr><tr><td>H.I.<br>5</td><td>C.I.<br>4 to 5</td><td>Comply with Table 11.2.1.1A<br>ratings for C.I.<br>of 5</td><td>Provide sprinklers in locations<br>where assemblies do not comply<br>with Table 11.2.1.1A</td><td></td></tr><tr><td>H.I.<br>5</td><td>C.I.<br>(1, 2 or 3) to 5</td><td>Comply with Table 11.2.1.1A<br>ratings for C.I.<br>of 5</td><td>Provide sprinklers in locations<br>where assemblies do not comply<br>with Table 11.2.1.1A</td><td>Combustible<br>to<br>Combustible.<br>Noncombustible<br>to<br>Noncombustible.</td></tr><tr><td>H.I.<br>6</td><td>C.I.<br>5 (Noncombustible)<br>to 6</td><td>Comply with Table 11.2.1.1A<br>ratings for C.I.<br>of 6</td><td>(a)<br>Provide sprinkler system,<br>plus 45 min roof rating.</td><td></td></tr><tr><td>H.I.<br>6</td><td>C.I.<br>5 (Heavy timber) to 6</td><td>Comply with A.C.</td><td>(b)<br>Provide sprinkler system.</td><td></td></tr><tr><td>H.I.<br>6</td><td>C.I.<br>5 (Combustible) to 6</td><td>Comply with A.C.</td><td>(c)<br>Provide 1 h rating plus<br>sprinkler system.</td><td></td></tr><tr><td>H.I.<br>6</td><td>C.I.<br>(3 or 4) to 6*</td><td>Comply with Table 11.2.1.1A<br>ratings for C.I.<br>of 6</td><td>(d)<br>Provide sprinkler system,<br>plus 45 min rating.</td><td>* For<br>Noncombustible<br>construction<br>only.</td></tr><tr><td>H.I.<br>6</td><td>C.I.<br>(1, 2, 3 or 4) to 6**</td><td>Comply with A.C.</td><td>(e)<br>Provide 1 h rating plus<br>sprinkler system.</td><td>** For Combustible<br>construction<br>only.</td></tr><tr><td>H.I.<br>7</td><td>C.I.<br>6 to 7</td><td>Comply with Table 11.2.1.1A<br>ratings for C.I.<br>of 7</td><td>(a)<br>Provide sprinkler system.</td><td></td></tr><tr><td>H.I.<br>7</td><td>C.I.<br>(3, 4 or 5) to 7*</td><td>Comply with Table 11.2.1.1A<br>ratings for C.I.<br>of 7</td><td>(b)<br>Provide 1 h rating plus<br>sprinkler system.</td><td>* For Noncombustible<br>construction<br>only.</td></tr></tbody></table>\n\n\n\n<h4 class=\"table-title\">Table 11.4.3.4.-A (Cont'd) Additional Upgrading</h4>\n\nForming Part of Sentences 11.2.1.1.(2) and 11.4.3.4.(1)\n\n\n<table class=\"obc-table\"><thead><tr><th>New Major<br>Occupancy<br>(H.I.) Number(3)</th><th>Increase of C.I.<br>to Equal<br>H.I.<br>to Support New<br>Major Occupancy</th><th>Additional Required<br>Upgrading</th><th>Part 11<br>Alternative<br>Compliance (A.C.)</th><th>Comments(1)(2)</th></tr></thead><tbody><tr><td>H.I.<br>8</td><td>C.I.<br>7 to 8</td><td>Comply with Table 11.2.1.1A<br>ratings for C.I.<br>of 8</td><td>(a)<br>Provide sprinkler system.</td><td></td></tr><tr><td>H.I.<br>8</td><td>C.I.<br>6 to 8</td><td>Comply with Table 11.2.1.1A<br>ratings for C.I.<br>of 8</td><td>(b)<br>Provide supervised sprinkler<br>system.</td><td></td></tr><tr><td>H.I.<br>8</td><td>C.I.<br>(3, 4 or 5) to 8*</td><td>Comply with Table 11.2.1.1A<br>ratings for C.I.<br>of 8</td><td>(d)<br>Provide sprinkler system,<br>plus 1 h rating.</td><td>*<br>For<br>Noncombustible<br>construction<br>only.</td></tr></tbody></table>\n\n\n\n<h5 class=\"table-notes-title\">Notes to Table 11.4.3.4.A.:</h5>\n\n- (1) One asterisk (\\) refers to noncombustible construction*.\n- (2) Two asterisks (\\\\) refers to combustible construction.\n- (3) Group B, occupancy with any H.I. shall be sprinklered.\n\n### Table 11.4.3.4.-B(1) Additional Upgrading for Multiple Major Occupancies Forming Part of Sentences 11.4.2.3.(4) and 11.4.3.4.(4)\n\n\n<table class=\"obc-table\"><thead><tr><th>New Major Occupancy</th><th>Code Requirements</th><th>Part 11 Compliance Alternative</th><th></th></tr></thead><tbody><tr><td></td><td>Table 3.1.3.1. and Subsection 9.10.9.<br>Where:</td><td>For Existing Building<br>Reduce to</td><td>If Sprinklered<br>Reduce to</td></tr><tr><td>All(2)</td><td>1 h rating required</td><td>45 min</td><td>30 min</td></tr><tr><td></td><td>2 h rating required</td><td>1.5 h</td><td>1 h</td></tr><tr><td></td><td>3 h rating required</td><td>2 h</td><td>1.5 h</td></tr></tbody></table>\n\n\n\n<h5 class=\"table-notes-title\">Notes to Table 11.4.3.4.B.:</h5>\n\n- (1) For buildings with multiple major occupancies only, where there is a change in major occupancy.\n- (2) See Section 11.4.\n\n### Table 11.5.1.1.-A Compliance Alternatives for Assembly Occupancies Forming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>A1</td><td>3.1.4.7.</td><td>Existing heavy timber construction acceptable where construction<br>is within 90% of<br>member sizes listed in Part 3.</td></tr><tr><td>A2</td><td>3.1.5.2. to 3.1.5.4.; 3.1.5.8.</td><td>Existing acceptable.</td></tr><tr><td>A3</td><td>3.1.5.9. to 3.1.5.12.</td><td>Except for exposed foamed plastics, existing acceptable. To match existing,<br>materials may be added from on or off site.</td></tr><tr><td>A4</td><td>3.1.5.18. to 3.1.5.20.; 3.1.5.25.</td><td>Existing acceptable.</td></tr><tr><td>A5</td><td>3.1.7.1.</td><td>Fire-resistance ratings<br>may also be used where they are based on:<br>1.<br>HUD Rehabilitation Guidelines, \"Guideline on Fire Ratings of Archaic Materials<br>and Assemblies\".<br>2.<br>DBR Technical Paper No. 194, \"Fire Endurance of Protected Steel Columns and<br>Beams\".<br>3.<br>DBR Technical Paper No. 207, \"Fire Endurance of Unit Masonry Walls\".<br>4.<br>DBR Techncial Paper No. 222, \"Fire Endurance of Light-Framed and<br>Miscellaneous Assemblies\".</td></tr><tr><td>A6</td><td>3.1.7.5.(3)</td><td>Existing assemblies required to be of noncombustible construction<br>may be supported<br>by combustible construction<br>having at least the same fire-resistance rating<br>as that<br>supported.</td></tr><tr><td>A7</td><td>3.1.8.5.(2)</td><td>(a)<br>Existing functional and sound doors in existing buildings<br>that are either hollow<br>metal or kalamein and containing wired glass at least 6 mm thick and conforming<br>to Sentence 3.1.8.16.(2) are permitted in lieu of doors not required to exceed 45<br>min,<br>(b)<br>all existing functional and sound hollow metal or<br>kalamein doors which carry<br>existing 1.5 h labels are acceptable in lieu of current 1.5 h labels and may contain<br>wired glass panels not exceeding 0.0645 m², at least 6 mm thick and conforming<br>to Sentence 3.1.8.16.(2), and<br>(c)<br>every fire door, window assembly or glass block used as a closure<br>in a required<br>fire separation<br>shall be installed in conformance with good engineering practice.</td></tr><tr><td>A8</td><td>3.1.8.7., 3.1.8.8. and 3.1.8.10.</td><td>Fire dampers<br>or fire stop flaps<br>are not required to be installed in existing ducts at<br>penetrations of existing fire separations.</td></tr><tr><td>A9</td><td>3.1.8.12.(1)</td><td>Existing 45 mm solid core wood doors acceptable.</td></tr><tr><td>A10</td><td>3.1.8.13.(1)</td><td>Existing functionally operable self-closing devices acceptable.</td></tr><tr><td>A11</td><td>3.1.8.15.</td><td>Existing functionally operable latching devices, excluding draw bolts, are acceptable.</td></tr><tr><td>A12</td><td>3.1.8.16.</td><td>Existing transoms or sidelights located in required fire separations<br>may be retained if<br>wired glass at least 6 mm thick is securely fixed to a steel frame with steel stops.<br>Operable transoms shall be fixed closed.</td></tr><tr><td>A13</td><td>3.1.8.17. to 3.1.8.19.</td><td>Existing acceptable.</td></tr><tr><td>A14</td><td>3.1.11.</td><td>Where the concealed space is being materially altered, smoke or heat detection in<br>that space in lieu of fire blocks<br>and tied<br>into fire alarm system is acceptable.</td></tr><tr><td>A15</td><td>3.1.13.10.</td><td>Existing acceptable.</td></tr><tr><td></td><td></td><td></td></tr></tbody></table>\n\n\n\n<h4 class=\"table-title\">Table 11.5.1.1.-A (Cont'd) Compliance Alternatives for Assembly Occupancies</h4>\n\nForming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>A16</td><td>3.2.3.</td><td>Existing windows.<br>(a)<br>Existing windows in walls may be relocated to another part of the wall, provided<br>the existing opening is blocked up to provide the same fire rating for the wall, and<br>the projection of the new opening, at a right angle to the property line onto<br>another building, lies not closer than 300 mm from a window in such other<br>building, where the \"opposite\" window is less than 2 400 mm from the opposite<br>new opening, and<br>(b)<br>except relocation of units, shall be restricted to the same fire compartment<br>and<br>shall conform to the requirements of Article 3.2.3.14. or 9.10.12.3. where<br>applicable, or<br>(c)<br>where a<br>building<br>does not satisfy the requirements of Subsection 3.2.3. for the<br>amount of openings facing a yard or space that does not have sufficient limiting<br>distance, such existing openings are allowed to be relocated provided:<br>(i)<br>such openings are not increased in size and they are protected with wired<br>glass in steel frames conforming to Sentence 3.1.8.16.(2), or<br>(ii)<br>the building<br>is sprinklered.</td></tr><tr><td>A17</td><td>3.2.3.6.(3)</td><td>Existing roof soffit projections acceptable.</td></tr><tr><td>A18</td><td>3.2.4.</td><td>(a)<br>Existing fire alarm system may remain except that Article 3.2.4.5. does not apply<br>where the fire safety plan (as described in the Fire Code made under the Fire<br>Protection and Prevention Act, 1997) for the building<br>addresses the intent of<br>Subsection 3.2.4. (i.e. \"stage\" system, electrical supervision, detection as<br>required, Fire Department connection and emergency power supply), and<br>(b)<br>extension of an existing system must ensure continuity and compatibility, and<br>integrity of the system.</td></tr><tr><td>A19</td><td>3.2.4.9.(2)(e)</td><td>Does not apply to existing installations in buildings.</td></tr><tr><td>A20</td><td>3.2.4.10.(5)(c)</td><td>Does not apply to existing installations in buildings.</td></tr><tr><td>A21</td><td>3.2.5.3.(1) and (2)</td><td>Existing acceptable.</td></tr><tr><td>A22</td><td>3.2.5.4. to 3.2.5.6.</td><td>Existing acceptable provided the building is<br>sprinklered.</td></tr><tr><td>A23</td><td>3.2.5.7.</td><td>Does not apply, except where a change in major occupancy<br>occurs from a lesser<br>hazard index.</td></tr><tr><td>A24</td><td>3.2.5.8. to 3.2.5.11.</td><td>Does not apply to buildings<br>6 storeys<br>and less. Does not apply to sprinklered<br>buildings.</td></tr><tr><td>A25</td><td>3.2.5.12.</td><td>Existing sprinkler systems in existing buildings<br>that do not conform to NFPA 13 may<br>be altered, added to, or extended from the existing system without complying with<br>NFPA 13, provided the system is operational and adequate with respect to coverage,<br>water supply and controls, and provided the system is evaluated by a qualified<br>designer.</td></tr><tr><td>A26</td><td>3.3.1.5.</td><td>One egress door is allowed where the occupant load is not greater than 100 persons,<br>provided floor area is sprinklered and travel distance does not exceed 25 m.</td></tr><tr><td>A27</td><td>3.3.1.9.</td><td>Existing width of public corridors<br>of not less than 914 mm is acceptable.</td></tr><tr><td>A28</td><td>3.3.1.9.(6)</td><td>An existing dead-end corridor is permitted where the occupant load<br>is not greater<br>than 20 persons, provided travel distance is not greater than 6 m plus corridor width<br>to \"exit<br>choice\" point.</td></tr></tbody></table>\n\n\n### Table 11.5.1.1.-A (Cont'd) Compliance Alternatives for Assembly Occupancies Forming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>A29</td><td>3.3.1.11.; 3.3.1.12.</td><td>Existing door swings may remain in heritage<br>buildings, existing or being restored,<br>with no change in major occupancy<br>and with occupant load<br>no greater than 100.</td></tr><tr><td>A30</td><td>3.3.1.13.</td><td>Existing doors may remain in a heritage<br>building, existing or being restored, with no<br>change in major occupancy.</td></tr><tr><td>A31</td><td>3.3.1.20.</td><td>Existing stained, etched, bevelled, leaded or figured glass acceptable.</td></tr><tr><td>A32</td><td>3.3.5.4.(1); 3.3.5.7.(1), (3) and<br>(4)</td><td>Need not comply where a gasketed door and self closer are provided in the existing<br>fire separation.</td></tr><tr><td>A33</td><td>3.4.1.5.(1)</td><td>Existing acceptable.</td></tr><tr><td>A34</td><td>3.4.1.5.(2)</td><td>Existing acceptable provided the existing guard<br>is not less than 914 mm.</td></tr><tr><td>A35</td><td>3.4.1.8.</td><td>Existing stained, etched, bevelled, leaded or figured glass acceptable.</td></tr><tr><td>A36</td><td>3.4.2.5.(1)</td><td>Existing travel distance acceptable where floor area<br>is sprinklered<br>and where there is<br>no change in major occupancy.</td></tr><tr><td>A37</td><td>3.4.3.2.(5)</td><td>Need not comply where there is no<br>increase in occupant load.</td></tr><tr><td>A38</td><td>3.4.3.2.(8)</td><td>Existing width of exits<br>acceptable provided the occupant load<br>is not more than 15%<br>above the exit capacity.</td></tr><tr><td>A39</td><td>3.4.3.3.</td><td>Existing acceptable.</td></tr><tr><td>A40</td><td>3.4.3.4.</td><td>Existing headroom clearance of not less than 1 980 mm is acceptable.</td></tr><tr><td>A41</td><td>3.4.4.4.(8)</td><td>Existing washrooms opening directly into an exit<br>stairwell shall be separated from the<br>exit<br>stairwell by a 45 min closure.</td></tr><tr><td>A42</td><td>3.4.5.1.(2) and (9)</td><td>Existing illuminated legible exit<br>signs are acceptable.</td></tr><tr><td>A43</td><td>3.4.6.2.</td><td>Existing acceptable, if visually apparent.</td></tr><tr><td>A44</td><td>3.4.6.3.</td><td>Existing acceptable.</td></tr><tr><td>A45</td><td>3.4.6.4.</td><td>Existing acceptable.</td></tr><tr><td>A46</td><td>3.4.6.5.(3) to (13)</td><td>Existing acceptable.</td></tr><tr><td>A47</td><td>3.4.6.6.(2) to (5)</td><td>Existing acceptable.</td></tr><tr><td>A48</td><td>3.4.6.7.(1)</td><td>Existing acceptable.</td></tr><tr><td>A49</td><td>3.4.6.8.</td><td>Existing acceptable.</td></tr><tr><td>A50</td><td>3.4.6.9.</td><td>Existing acceptable.</td></tr><tr><td>A51</td><td>3.4.6.11.(1) to (4) and (6)</td><td>Existing acceptable.</td></tr><tr><td>A52</td><td>3.4.6.12.</td><td>Existing acceptable in<br>public heritage<br>buildings<br>or a change in occupancy<br>with no<br>increase in occupant load.</td></tr><tr><td>A53</td><td>3.4.6.16.(2) to (4)</td><td>Existing functionally operable panic hardware acceptable.</td></tr></tbody></table>\n\n\n### Table 11.5.1.1.-A (Cont'd) Compliance Alternatives for Assembly Occupancies Forming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>A54</td><td>3.4.7.2.</td><td>Combustible<br>fire escapes which are protected from fire in accordance with Sentence<br>3.2.3.14.(2) are permitted or may be reconstructed or recreated (as in the case of a<br>heritage building).</td></tr><tr><td>A55</td><td>3.5.1.</td><td>Existing acceptable.</td></tr><tr><td>A56</td><td>3.6.2.1.(7)</td><td>Existing fire separation<br>of not less than 30 min is acceptable.</td></tr><tr><td>A57</td><td>3.6.2.2.</td><td>Existing acceptable where explosion-resistant construction<br>or venting is provided.</td></tr><tr><td>A58</td><td>3.6.2.6.</td><td>Existing acceptable.</td></tr><tr><td>A59</td><td>3.6.2.7.(1)</td><td>2 h fire separation<br>acceptable.</td></tr><tr><td>A60</td><td>3.6.3.1.(1) to (5)</td><td>45 min fire separation<br>acceptable.</td></tr><tr><td>A61</td><td>3.6.3.3.(1) to (5) and (8)</td><td>Existing acceptable.</td></tr><tr><td>A62</td><td>3.6.3.3.(9)</td><td>1 h acceptable if sprinklered.</td></tr><tr><td>A63</td><td>3.6.3.3.(10)</td><td>Existing acceptable.</td></tr><tr><td>A64</td><td>3.6.3.4.</td><td>Existing acceptable.</td></tr><tr><td>A65</td><td>3.6.4.</td><td>Existing acceptable.</td></tr><tr><td>A66</td><td>3.7.1.3.(3)</td><td>2.1 m is acceptable.</td></tr><tr><td>A67</td><td>3.7.2.1.(3)</td><td>The minimum glass areas may be reduced by 50%.</td></tr><tr><td>A68</td><td>3.7.4.</td><td>Where the occupant load<br>is increased by more than 15% above the capacity of the<br>existing facilities, facilities to be added to accommodate the increase.</td></tr><tr><td>A69</td><td>3.8.1.2.</td><td>Existing accessible entrance acceptable. (See C.A.<br>A75)<br>Existing curb ramp<br>conforming to Sentence 3.8.3.2.(3) is acceptable.<br>Existing principal entrance acceptable, provided at least one<br>barrier-free<br>entrance is<br>available.</td></tr><tr><td>A70</td><td>3.8.1.3.(1)</td><td>Existing unobstructed width of 920 mm minimum is acceptable.</td></tr><tr><td>A71</td><td>3.8.1.3.(4)</td><td>Existing unobstructed space not less than 1 500 mm in width and 1 500 mm in length<br>located not more than 30 m apart is acceptable.</td></tr><tr><td>A72</td><td>3.8.3.2.(3)(b)</td><td>Existing curb ramp<br>acceptable, provided width not less than 1 200 mm.</td></tr><tr><td>A73</td><td>3.8.3.3.(1)</td><td>Existing doorway acceptable, provided not less than 800 mm wide.</td></tr><tr><td>A74</td><td>3.8.3.3.(11)(a)</td><td>Existing distance acceptable, provided not less than 1 200 mm plus the width of any<br>door that swings into the space in the path of travel.</td></tr><tr><td>A75</td><td>3.8.3.4.(1)(a)</td><td>Existing ramp<br>acceptable, provided not less than 870 mm between handrails.</td></tr><tr><td>A76</td><td>3.8.3.8.(5)</td><td>Existing grab bar is acceptable.</td></tr><tr><td>A77</td><td>3.8.3.12.</td><td>Existing universal washroom acceptable.</td></tr><tr><td>A78</td><td>3.8.3.13.(2)(g)</td><td>Existing grab bar is acceptable.</td></tr></tbody></table>\n\n\n### Table 11.5.1.1.-A (Cont'd) Compliance Alternatives for Assembly Occupancies Forming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>A79</td><td>3.8.3.16.</td><td>Existing drinking fountain conforming to Clauses 3.8.3.16.(2)(a) and (b) acceptable.</td></tr><tr><td>A80</td><td>3.6.3.16A.</td><td>Existing water bottle filling stations are acceptable.</td></tr><tr><td>A81</td><td>3.11.3.1.(9)</td><td>Existing clear width acceptable, provided not less than 900 mm.</td></tr><tr><td>A82</td><td>3.11.3.1.(14)</td><td>Existing painted line acceptable.</td></tr><tr><td>A83</td><td>4.1.8.</td><td>The requirements under this Subsection do not apply.</td></tr><tr><td>A84</td><td>6.3.1.1.(2)</td><td>Required outdoor air rates may be provided by mechanical, natural or combination of<br>natural and mechanical means.</td></tr><tr><td>A85</td><td>8.2.1.4.</td><td>Existing clearances acceptable where a sewage system<br>is replaced with another<br>sewage system<br>within the same class and the capacity of the replacement sewage<br>system<br>does not exceed the capacity of the existing sewage system.</td></tr><tr><td>A86</td><td>8.2.1.4.</td><td>Existing clearances are acceptable where a replacement sewage system<br>requires<br>lesser clearances than those required in Part 8 for the existing sewage system.</td></tr></tbody></table>\n\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>B1</td><td>3.1.5.2. to 3.1.5.4.; 3.1.5.8.</td><td>Existing acceptable.</td></tr><tr><td>B2</td><td>3.1.5.9. to 3.1.5.12.</td><td>Except for exposed foamed plastics, existing acceptable.</td></tr><tr><td>B3</td><td>3.1.5.18. to 3.1.5.20.; 3.1.5.25.</td><td>Existing acceptable.</td></tr><tr><td>B4</td><td>3.1.7.1.</td><td>Fire-resistance ratings<br>may also be used where they are based on:<br>1.<br>HUD Rehabilitation Guidelines, \"Guideline on Fire Ratings of Archaic Materials<br>and Assemblies\".<br>2.<br>DBR Technical Paper No. 194, \"Fire Endurance of Protected Steel Columns and<br>Beams\".<br>3.<br>DBR Technical Paper No. 207, \"Fire Endurance of Unit Masonry Walls\".<br>4.<br>DBR Technical Paper No. 222, \"Fire Endurance of Light-Framed and<br>Miscellaneous Assemblies\".</td></tr><tr><td>B5</td><td>3.1.7.5.(3)</td><td>Existing assemblies required to be of noncombustible construction<br>may be supported<br>by combustible construction<br>having at least the same fire-resistance rating<br>as that<br>supported.</td></tr><tr><td>B6</td><td>3.1.8.5.(2)</td><td>(a)<br>Existing functional and sound doors in existing buildings<br>that are either hollow<br>metal or kalamein<br>and containing wired glass at least 6 mm thick and conforming<br>to Sentence 3.1.8.16.(2) are permitted in lieu of doors not required to exceed 45<br>min,<br>(b)<br>all existing functional and sound hollow metal or kalamein doors which carry<br>existing 1.5 h labels are<br>acceptable in lieu of current 1.5 h labels and may contain<br>wired glass panels not exceeding 0.0645 m², at least 6 mm thick and conforming<br>to Sentence 3.1.8.16.(2), and<br>(c)<br>every fire door, window assembly or glass block used as a closure<br>in a required<br>fire separation<br>shall be installed in conformance with good engineering practice.</td></tr><tr><td>B7</td><td>3.1.8.7., 3.1.8.8. and 3.1.8.10.</td><td>Fire dampers<br>or fire stop flaps<br>are not required to be installed in existing ducts at<br>penetrations of existing fire separations.</td></tr><tr><td>B8</td><td>3.1.8.12.(1)</td><td>For existing unlabelled doors in existing buildings, at least 45 mm solid core wood or<br>metal clad are acceptable.</td></tr><tr><td>B9</td><td>3.1.8.13.(1)</td><td>Existing functionally operable self-closing devices acceptable, including devices with<br>\"pause\" hardware.</td></tr><tr><td>B10</td><td>3.1.8.14.(1) and (2)</td><td>Between patient or inmate rooms, and corridors, existing \"pause\" type self-closing<br>devices may be used as hold-open devices where functionally operable.</td></tr><tr><td>B11</td><td>3.1.8.15.</td><td>Existing functionally operable latching devices, excluding draw bolts, are acceptable.</td></tr><tr><td>B12</td><td>3.1.8.16.(1) and (2)</td><td>Except in zone or exit<br>fire separations<br>not required to be greater than 1 h, existing<br>wired glass installations are acceptable provided they are set in steel or metal clad<br>frames.</td></tr><tr><td>B13</td><td>3.1.8.16.(3)</td><td>Existing glass block acceptable.</td></tr><tr><td>B14</td><td>3.1.8.17. to 3.1.8.19.</td><td>Existing acceptable.</td></tr><tr><td>B15</td><td>3.1.9.5.(1) and (2)</td><td>Existing openings in existing ceiling membranes to remain. Existing openings may be<br>moved to another location in the same ceiling provided the aggregate area of<br>openings does not increase and are not cumulative, and the existing opening is<br>blocked up to provide the same rating<br>as the ceiling assembly.</td></tr></tbody></table>\n\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>B16</td><td>3.1.11.</td><td>Where the concealed space is being materially altered, provide smoke or heat<br>detection in that space in lieu of fire blocks<br>and tie into fire alarm system.</td></tr><tr><td>B17</td><td>3.1.14.; 3.1.15.</td><td>Existing roof assemblies and roof coverings acceptable.</td></tr><tr><td>B18</td><td>3.2.3.</td><td>Existing windows.<br>(a)<br>Existing windows in walls may be relocated to another part of the wall, provided<br>the existing opening is blocked up to provide the same fire rating for the wall, and<br>the projection of the new opening, at a right angle to the property line onto<br>another building, lies no closer than 300 mm from a window in such other<br>building, where the \"opposite\" window is less than 2 400 mm from the opposite<br>new opening, and<br>(b)<br>except relocation of units, to be restricted to the same fire compartment and shall<br>conform to the requirements of Article 3.2.3.14. or 9.10.12.3. where applicable, or<br>where a building<br>(c)<br>does not satisfy the requirements of Subsection 3.2.3. for the<br>amount of openings facing a yard or space that does not have sufficient limiting<br>distance, such existing openings are allowed to be relocated provided:<br>(i)<br>such openings are not increased in size and they are protected with wired<br>glass in steel frames conforming to Sentence 3.1.8.16.(2), or<br>(ii)<br>the building is sprinklered.</td></tr><tr><td>B19</td><td>3.2.3.6.(3)</td><td>Existing roof soffit projections acceptable.</td></tr><tr><td>B20</td><td>3.2.4.</td><td>(a)<br>Existing fire alarm system may remain except that Article 3.2.4.5. does not apply<br>where the fire safety plan (as described in the Fire Code made under the Fire<br>Protection and Prevention Act, 1997) for the building<br>addresses the intent of<br>Subsection 3.2.4. (i.e. \"stage\" system, electrical supervision, detection as<br>required, Fire Department connection and emergency power supply), and<br>(b)<br>extension of an existing system must ensure continuity and compatibility, and<br>integrity of the system.</td></tr><tr><td>B21</td><td>3.2.4.8.(2)(e)</td><td>Does not apply to existing installations in buildings.</td></tr><tr><td>B22</td><td>3.2.4.9.(5)(c)</td><td>Does not apply to existing installations in buildings.</td></tr><tr><td>B23</td><td>3.2.5.1.; 3.2.5.2.</td><td>Existing access to an existing occupancy<br>acceptable.<br>Where the existing building<br>is changed to a \"B\" occupancy, existing access are<br>acceptable.</td></tr><tr><td>B24</td><td>3.2.5.3.(1)</td><td>Existing acceptable, except where a change in occupancy<br>occurs to a \"B1\" or \"B2\"<br>occupancy.</td></tr><tr><td>B25</td><td>3.2.5.3.(2)</td><td>Existing acceptable.</td></tr><tr><td>B26</td><td>3.2.5.4. to 3.2.5.6.</td><td>Existing access route to existing occupancy<br>is acceptable if the building<br>is<br>sprinklered.<br>Where existing building<br>is changed to a \"B\" occupancy, access route shall be<br>provided.</td></tr><tr><td>B27</td><td>3.2.5.7.; 3.2.5.18.</td><td>Does not apply except where a change in occupancy<br>occurs to a \"B1\" or \"B2\"<br>occupancy, where occupants are not normally evacuated from the building.</td></tr></tbody></table>\n\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>B28</td><td>3.2.5.13.</td><td>Existing sprinkler systems in existing buildings<br>that do not conform to NFPA 13 may<br>be altered, added to, or extended from the existing system without complying with<br>NFPA 13, provided the system is operational and adequate with respect to coverage,<br>water supply and controls, and provided the system is evaluated by a qualified<br>designer.</td></tr><tr><td>B29</td><td>3.2.5.8. to 3.2.5.11.</td><td>Does not apply except where a change in occupancy<br>occurs to a Group B<br>occupancy, where occupants are not normally evacuated from the building.</td></tr><tr><td>B30</td><td>3.3.1.9.</td><td>Existing width of public corridors<br>of not less than 914 mm is acceptable, except as<br>provided in Sentence 3.3.3.3.(2).</td></tr><tr><td>B31</td><td>3.3.1.11.; 3.3.1.12.</td><td>Existing door swings may remain in heritage<br>buildings, existing or being restored,<br>with no change in major occupancy<br>and with occupant load<br>no greater than 100.</td></tr><tr><td>B32</td><td>3.3.1.12.</td><td>Existing doors acceptable.</td></tr><tr><td>B33</td><td>3.3.1.16.</td><td>Existing acceptable.</td></tr><tr><td>B34</td><td>3.3.1.17.</td><td>Existing non-conforming capacities of access to exits<br>are acceptable, provided that<br>the excessive capacity is no greater than 15% and,<br>(a)<br>corridor fire separations<br>are rated to Code plus early warning system provided, or<br>(b)<br>there are sprinklers, plus smoke alarms<br>in suites.</td></tr><tr><td>B35</td><td>3.3.1.18.</td><td>Existing acceptable.</td></tr><tr><td>B36</td><td>3.3.1.20.</td><td>Existing stained, etched, bevelled, leaded or figured glass acceptable.</td></tr><tr><td>B37</td><td>3.3.3.3.(1)</td><td>Existing dead-end corridors acceptable with 30 min fire separation<br>of corridor plus<br>sprinklering of floor area, provided the occupant load<br>is not greater than 10 persons<br>and travel distance not greater than 6 m plus corridor width to \"exit<br>choice\" point.</td></tr><tr><td>B38</td><td>3.3.3.7.</td><td>45 min fire separation<br>acceptable.</td></tr><tr><td>B39</td><td>3.3.5.4.(1); 3.3.5.7.(4)</td><td>Need not comply where a gasketed door and self closer are provided in the existing<br>fire separation.</td></tr><tr><td>B40</td><td>3.4.1.8.</td><td>Existing stained, etched, bevelled, leaded or figured glass acceptable.</td></tr><tr><td>B41</td><td>3.4.2.5.(1)</td><td>Existing travel distance acceptable where floor area<br>is sprinklered<br>and provided fire<br>separations<br>comply with Part 3.</td></tr><tr><td>B42</td><td>3.4.3.2.(8)</td><td>Existing acceptable provided there is no change in occupancy<br>to a \"B2\" or \"B3\".</td></tr><tr><td>B43</td><td>3.4.3.3.</td><td>Existing acceptable.</td></tr><tr><td>B44</td><td>3.4.3.4.</td><td>Existing headroom clearance of not less than 1 980 mm is acceptable.</td></tr><tr><td>B45</td><td>3.4.5.1.(2) and (9)</td><td>Existing illuminated legible exit<br>signs are acceptable.</td></tr><tr><td>B46</td><td>3.4.6.2.</td><td>Existing acceptable, if visually apparent.</td></tr><tr><td>B47</td><td>3.4.6.3.(1)</td><td>Existing acceptable with rise no greater than 3.7 m.</td></tr><tr><td>B48</td><td>3.4.6.4.(1)</td><td>Existing acceptable provided there is no change in occupancy<br>to a \"B2\" or \"B3\".</td></tr><tr><td>B49</td><td>3.4.6.4.(2) to (4)</td><td>Existing acceptable.</td></tr><tr><td>B50</td><td>3.4.6.5.(3) to (13)</td><td>Existing acceptable.</td></tr></tbody></table>\n\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>B51</td><td>3.4.6.6.(2) to (5)</td><td>Existing acceptable.</td></tr><tr><td>B52</td><td>3.4.6.7.(1)</td><td>Existing acceptable.</td></tr><tr><td>B53</td><td>3.4.6.8.</td><td>Existing acceptable.</td></tr><tr><td>B54</td><td>3.4.6.9.</td><td>Existing acceptable where there is no change in major occupancy<br>or increase in<br>occupant load<br>greater than 15%.</td></tr><tr><td>B55</td><td>3.4.6.11.(1) to (4) and (6)</td><td>Existing acceptable.</td></tr><tr><td>B56</td><td>3.4.6.12.</td><td>Existing acceptable in public heritage<br>buildings.</td></tr><tr><td>B57</td><td>3.4.6.16.(2) to (4)</td><td>Existing functionally operable panic hardware acceptable.</td></tr><tr><td>B58</td><td>3.4.6.18.(4)(b)</td><td>Existing access to existing occupancy<br>is acceptable<br>Where the existing building<br>is changed to a \"B\" occupancy, existing access is<br>acceptable.</td></tr><tr><td>B59</td><td>3.4.7.2.</td><td>Combustible<br>fire escapes which are protected from fire in accordance with Sentence<br>3.2.3.14.(2) are permitted or may be reconstructed or recreated (as in the case of a<br>heritage building). Where serving non-ambulatory persons, minimum width shall be<br>1 100 mm.</td></tr><tr><td>B60</td><td>3.5.1.</td><td>Existing acceptable, except where building<br>is classified under Subsection 3.2.6.</td></tr><tr><td>B61</td><td>3.6.2.1.(7)</td><td>45 min fire separation<br>acceptable.</td></tr><tr><td>B62</td><td>3.6.2.6.</td><td>Existing acceptable.</td></tr><tr><td>B63</td><td>3.6.2.7.(1)</td><td>2 h fire separation<br>acceptable.</td></tr><tr><td>B64</td><td>3.6.3.1.(1) to (5)</td><td>45 min fire separation<br>acceptable.</td></tr><tr><td>B65</td><td>3.6.3.3.(1), (3), (4)(a), (5) and<br>(10)</td><td>Existing acceptable.</td></tr><tr><td>B66</td><td>3.6.3.3.(2)(a)</td><td>45 min fire separation<br>acceptable.</td></tr><tr><td>B67</td><td>3.6.4.</td><td>Existing acceptable, except where a change in occupancy<br>occurs to a Group B<br>occupancy.</td></tr><tr><td>B68</td><td>3.7.1.3.(1)</td><td>Existing acceptable.</td></tr><tr><td>B69</td><td>3.7.2.1.(2)</td><td>The minimum glass areas may be reduced by 50%.</td></tr><tr><td>B70</td><td>3.7.4.</td><td>Where the occupant load<br>is increased by more than 15% above the capacity of the<br>existing facilities, facilities to be added to accommodate the increase.</td></tr><tr><td>B71</td><td>3.8.1.2.</td><td>Existing accessible entrance acceptable. (See C.A.<br>B77)<br>Existing curb ramp<br>conforming to Sentence 3.8.3.2.(3) is acceptable.<br>Existing principal entrance acceptable, provided at least one<br>barrier-free<br>entrance is<br>available.</td></tr><tr><td>B72</td><td>3.8.1.3.(1)</td><td>Existing unobstructed width of 920 mm minimum is acceptable.</td></tr></tbody></table>\n\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>B73</td><td>3.8.1.3.(4)</td><td>Existing unobstructed space not less than 1 500 mm in width and 1 500 mm in length<br>located not more than 30 m apart is acceptable.</td></tr><tr><td>B74</td><td>3.8.3.2.(3)(b)</td><td>Existing curb ramp acceptable, provided width not less than 1 200 mm.</td></tr><tr><td>B75</td><td>3.8.3.3.(1)</td><td>Existing doorway acceptable, provided not less than 800 mm wide.</td></tr><tr><td>B76</td><td>3.8.3.3.(11)(a)</td><td>Existing distance acceptable, provided not less than 1 200 mm plus the width of any<br>door that swings into the space in the path of travel.</td></tr><tr><td>B77</td><td>3.8.3.4.(1)(a)</td><td>Existing ramp acceptable, provided not less than 870 mm between handrails.</td></tr><tr><td>B78</td><td>3.8.3.8.(5)</td><td>Existing grab bar is acceptable.</td></tr><tr><td>B79</td><td>3.8.3.12.</td><td>Existing universal washroom acceptable.</td></tr><tr><td>B80</td><td>3.8.3.13.(2) (g)</td><td>Existing grab bar is acceptable.</td></tr><tr><td>B81</td><td>3.8.3.16.</td><td>Existing drinking fountain conforming to Clauses 3.8.3.16.(2)(a) and (b) acceptable.</td></tr><tr><td>B82</td><td>3.8.3.16A.</td><td>Existing water bottle filling stations are acceptable.</td></tr><tr><td>B83</td><td>3.11.3.1.(9)</td><td>Existing clear width acceptable, provided not less than 900 mm.</td></tr><tr><td>B84</td><td>3.11.3.1.(14)</td><td>Existing painted line acceptable.</td></tr><tr><td>B85</td><td>4.1.8.</td><td>The requirements under this Subsection do not apply.</td></tr><tr><td>B86</td><td>8.2.1.4.</td><td>Existing clearances acceptable where a sewage system<br>is replaced with another<br>sewage system<br>within the same class and the capacity of the replacement sewage<br>system<br>does not exceed the capacity of the existing sewage system.</td></tr><tr><td>B87</td><td>8.2.1.4.</td><td>Existing clearances are acceptable where a replacement sewage system<br>requires<br>lesser clearances than those required in Part 8 for the existing sewage system.</td></tr></tbody></table>\n\n\n### Table 11.5.1.1.-C Compliance Alternatives for Residential Occupancies Forming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>C1</td><td>3.1.4.7.</td><td>Existing heavy timber construction<br>acceptable where construction<br>is within 90% of<br>member sizes listed in Part 3.</td></tr><tr><td>C2</td><td>3.1.5.2. to 3.1.5.4.; 3.1.5.8.</td><td>Existing acceptable.</td></tr><tr><td>C3</td><td>3.1.5.9. to 3.1.5.12.</td><td>Except for exposed foamed plastics, existing acceptable. To match existing,<br>materials may be added from on or off site.</td></tr><tr><td>C4</td><td>3.1.5.18. to 3.1.5.20.; 3.1.5.21.</td><td>Existing acceptable.</td></tr><tr><td>C5</td><td>3.1.7.1.</td><td>Fire-resistance ratings<br>may also be used where they are based on:<br>1.<br>HUD Rehabilitation Guidelines, \"Guideline on Fire Ratings of Archaic Materials<br>and Assemblies\".<br>2.<br>DBR Technical Paper No. 194, \"Fire Endurance of Protected Steel Columns and<br>Beams\".<br>3.<br>DBR Technical Paper No. 207, \"Fire Endurance of Unit Masonry Walls\".<br>4.<br>DBR Technical Paper No. 222, \"Fire Endurance of Light-Framed and<br>Miscellaneous Assemblies\".</td></tr><tr><td>C6</td><td>3.1.7.5.(3)</td><td>Existing assemblies required to be of noncombustible construction<br>may be supported<br>by combustible construction<br>having at least the same fire-resistance rating<br>as that<br>supported.</td></tr><tr><td>C7</td><td>3.1.8.1.(2); 3.1.8.6.(1) and (2)</td><td>Existing functional closures<br>are acceptable and may be relocated within the same<br>existing fire separation.</td></tr><tr><td>C8</td><td>3.1.8.5.(2)</td><td>(a)<br>Existing functional and sound doors in existing buildings<br>that are either hollow<br>metal or kalamein<br>and containing wired glass at least 6 mm thick and conforming<br>to Sentence<br>3.1.8.16.(2) are permitted in lieu of doors not required to exceed<br>45<br>min,<br>(b)<br>all existing functional and sound hollow metal or kalamein doors which carry<br>existing 1.5<br>h labels are acceptable in lieu of current 1.5 h labels and may contain<br>wired glass panels not exceeding 0.0645 m², at least 6 mm thick and conforming<br>to Sentence<br>3.1.8.16.(2), and<br>(c)<br>every fire door, window assembly or glass block used as a closure<br>in a required<br>fire separation<br>shall be installed in conformance with good engineering practice.</td></tr><tr><td>C9</td><td>3.1.8.7. to 3.1.8.10.</td><td>Except for hotels, fire dampers<br>or fire stop<br>flaps<br>are not required to be installed in<br>existing ducts at penetrations of existing fire separations.</td></tr><tr><td>C10</td><td>3.1.8.12.(1)</td><td>For existing unlabeled doors in existing buildings, at least 45 mm solid core wood or<br>metal clad are acceptable. Except for residential occupancies, existing closure rating<br>of 20 min will not be required where the entire floor area<br>is sprinklered.</td></tr><tr><td>C11</td><td>3.1.8.14.(1) and (2)</td><td>In retirement homes, between a suite<br>and a public corridor, existing 'pause' type self<br>closing devices may be used as hold-open devices where functionally operable.</td></tr><tr><td>C12</td><td>3.1.8.15.</td><td>Existing functionally operable latching devices, excluding draw bolts, are acceptable.</td></tr><tr><td>C13</td><td>3.1.8.16.</td><td>Existing transoms or sidelights located in fire separations<br>not required to be greater<br>than 1 h may be retained if wired glass, at least 6 mm thick, is securely fixed to a<br>wood frame of at least 50 mm thickness with steel stops. Operable transoms shall<br>be<br>fixed closed.</td></tr><tr><td>C14</td><td>3.1.8.17. to 3.1.8.19.</td><td>Existing acceptable.</td></tr></tbody></table>\n\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>C15</td><td>3.1.11.</td><td>Where the concealed space is being materially altered, provide smoke or heat<br>detection in that space in lieu of fire blocks<br>and tie into fire alarm system.</td></tr><tr><td>C16</td><td>3.2.3.</td><td>Existing windows.<br>(a)<br>Existing windows in walls may be relocated to another part of the wall, provided<br>the existing opening is blocked up to provide the same fire rating for the wall, and<br>the projection of the new opening, at a right angle to the property line onto<br>another building, lies not closer than 300 mm from a window in such other<br>building, where the \"opposite\" window is less than 2 400 mm from the opposite<br>new opening, and<br>(b)<br>except relocation of units, shall be restricted to the same fire compartment<br>and<br>shall conform to the requirements of Article 3.2.3.14. or 9.10.12.3. where<br>applicable, or<br>(c)<br>where a<br>building<br>does not satisfy the requirements of Subsection 3.2.3. for the<br>amount of openings facing a yard or space that does not have sufficient limiting<br>distance, such existing openings are allowed to be relocated provided:<br>(i)<br>such openings are not increased in size and they are protected with wired<br>glass in steel frames conforming to Sentence 3.1.8.16.(2), or<br>(ii)<br>the building<br>is sprinklered.</td></tr><tr><td>C17</td><td>3.2.3.6.(3)</td><td>Existing roof soffit projections acceptable.</td></tr><tr><td>C18</td><td>3.2.4.</td><td>(a)<br>Existing fire alarm system may remain except that Article 3.2.4.5. does not apply<br>where the fire safety plan (as described in the Fire Code made under the Fire<br>Protection and Prevention Act, 1997) for the building<br>addresses the intent of<br>Subsection 3.2.4. (i.e. \"stage\" system, electrical supervision, detection as<br>required, Fire Department connection, and emergency power supply), and<br>(b)<br>extension of an existing system must ensure continuity and compatibility, and<br>integrity of the system.</td></tr><tr><td>C19</td><td>3.2.4.8.(2)(e)</td><td>Does not apply to existing installations in buildings.</td></tr><tr><td>C20</td><td>3.2.4.9.(5)(c)</td><td>Does not apply to existing installations in buildings.</td></tr><tr><td>C21</td><td>3.2.4.20.</td><td>Except for retirement homes, such smoke alarms<br>may be battery operated.</td></tr><tr><td>C22</td><td>3.2.5.1.; 3.2.5.2.</td><td>Existing acceptable.</td></tr><tr><td>C23</td><td>3.2.5.3.(1)</td><td>Existing access acceptable.</td></tr><tr><td>C24</td><td>3.2.5.3.(2)</td><td>Existing acceptable.</td></tr><tr><td>C25</td><td>3.2.5.4. to 3.2.5.6.</td><td>(a)<br>For buildings<br>6 storeys<br>and less, existing access to existing occupancy<br>is<br>acceptable, and<br>(b)<br>where existing building<br>is changed to a \"C\" occupancy,<br>an access route shall be<br>provided, or the existing access is acceptable provided the building<br>is<br>sprinklered.</td></tr><tr><td>C26</td><td>3.2.5.7.</td><td>Existing water supply and hydrants are acceptable in buildings<br>up to 6 storeys<br>in<br>building height.</td></tr></tbody></table>\n\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>C27</td><td>3.2.5.8. to 3.2.5.11.</td><td>Does not apply to buildings<br>4 storeys<br>and less. For existing buildings<br>over 4 storeys<br>in building height, existing standpipe and hose systems water supply is acceptable<br>provided it can deliver a minimum flow rate of 265 L/min for 30 min at 345 kPa<br>(gauge) at the two highest and most remote hose valves, with not less than 132<br>L/min from each of the two simultaneously.</td></tr><tr><td>C28</td><td>3.2.5.12.</td><td>Existing sprinkler systems in existing buildings<br>that do not conform to NFPA 13 may<br>be altered, added to, or extended from the existing system without complying with<br>NFPA 13, provided the system is operational and adequate with respect to coverage,<br>water supply and controls, and provided the system is evaluated by a qualified<br>designer.</td></tr><tr><td>C29</td><td>3.3.1.4.(1); 3.3.4.2.(1)</td><td>30 min is acceptable to separate corridors or exits<br>in buildings<br>not exceeding 6<br>storeys<br>in building height, except that 45 min is required for exits<br>in buildings<br>exceeding 3 storeys<br>in building height. For buildings<br>exceeding 6<br>storeys<br>in building<br>height, 30 min is acceptable where smoke detectors<br>are installed in corridors, except<br>1 h is required in exits. 30 min is acceptable to separate public corridors, exits<br>or<br>suites<br>in hotels, provided fire detectors<br>are installed in every room in a suite<br>and in<br>every room not located in a suite, other than<br>corridors, washrooms, closets in suites,<br>saunas, refrigerated areas and swimming pools.</td></tr><tr><td>C30</td><td>3.3.1.5.(1)(c); Tables 3.3.1.5A<br>and 3.3.1.5B</td><td>In Column 2, maximum area of room or suite<br>to be unlimited.</td></tr><tr><td>C31</td><td>3.3.1.9.</td><td>Existing width of public corridors<br>of not less than 914 mm is acceptable.</td></tr><tr><td>C32</td><td>3.3.1.11.; 3.3.1.12.</td><td>Existing door swings may remain in heritage buildings, existing or being restored,<br>with no change in major occupancy<br>and with occupant load<br>no greater than 100.</td></tr><tr><td>C33</td><td>3.3.1.13.</td><td>Existing doors acceptable, provided not less than 600 mm wide.</td></tr><tr><td>C34</td><td>3.3.1.14.</td><td>Existing curved or spiral stairs acceptable.</td></tr><tr><td>C35</td><td>3.3.1.17.</td><td>Existing non-conforming capacities of access to exits<br>are acceptable, provided that<br>the excessive capacity is no greater than 15% and,<br>(a)<br>corridor fire separations<br>are rated to Code plus early warning system provided, or<br>(b)<br>there are sprinklers, plus smoke alarms<br>in suites.</td></tr><tr><td>C36</td><td>3.3.1.18.</td><td>Does not apply to heritage buildings.</td></tr><tr><td>C37</td><td>3.3.1.20.</td><td>Existing stained, etched, bevelled, leaded or figured glass acceptable.</td></tr><tr><td>C38</td><td>3.3.4.2.(3)(b)(i)<br>3.3.4.2.(3)(b)(ii), (iii)</td><td>30 min fire separation<br>acceptable.<br>45 min fire separation<br>acceptable.</td></tr><tr><td>C39</td><td>3.3.4.4.(4) and (5)</td><td>For buildings<br>6 storeys<br>and less, doorway from dwelling unit<br>will be permitted to open<br>directly into exit<br>stairway or interior corridor served by a single exit<br>if a fire alarm<br>system complying with Subsection 3.2.4. is installed and the<br>dwelling unit<br>has a<br>second and separate means of egress.</td></tr><tr><td>C40</td><td>3.3.5.4.(1) and 3.3.5.7.(4)</td><td>Need not comply where a gasketed door and self closer are provided in the existing<br>fire separation.</td></tr></tbody></table>\n\n\n\n<h4 class=\"table-title\">Table 11.5.1.1.-C (Cont'd) Compliance Alternatives for Residential Occupancies</h4>\n\nForming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>C41</td><td>3.4.1.4.</td><td>Except for hotels<br>and retirement homes, the following types of exits<br>may also be<br>used for buildings<br>not over 6 storeys<br>in building height:<br>(a)<br>connected balconies, which connect across firewalls, or connect to another exit,<br>or with access to ground level,<br>(b)<br>areas of refuge where fire service rescue is possible and that comply with<br>Measure L of Sentences (4) to (10), (18) and Clauses (20)(a), (b) and (d) in<br>MMAH Supplementary Standard SB-4, \"Measures for Fire Safety in High<br>Buildings\".</td></tr><tr><td>C42</td><td>3.4.1.8.</td><td>Existing stained, etched, bevelled, leaded or figured glass acceptable.</td></tr><tr><td>C43</td><td>3.4.2.5.(1)</td><td>Existing travel distance acceptable where floor area<br>is sprinklered<br>and provided fire<br>separations<br>comply with Part 3.</td></tr><tr><td>C44</td><td>3.4.3.2.(7)</td><td>Existing width of exits<br>acceptable provided the occupant load<br>is not more than 15%<br>above the exit<br>capacity.</td></tr><tr><td>C45</td><td>3.4.3.3.</td><td>Except for heritage buildings, existing acceptable, provided not less than 800 mm.</td></tr><tr><td>C46</td><td>3.4.3.4.</td><td>Existing headroom clearance of not less than 1 980 mm is acceptable.</td></tr><tr><td>C47</td><td>3.4.4.1.(1)</td><td>Except for exits, no rating required where floor areas<br>are spinklered.</td></tr><tr><td>C48</td><td>3.4.4.1.</td><td>Fire separations<br>of exits<br>permitted in buildings:<br>(a) 30 min, up to 3 storeys<br>in building height,<br>(b) 45 min, in hotels<br>up to 3 storeys<br>in building height,<br>(c) 45 min, up to 6 storeys<br>in building height,<br>(d) 1 h, over 6 storeys<br>in building height.</td></tr><tr><td>C49</td><td>3.4.4.4.(8)</td><td>Existing washrooms opening directly into an exit<br>stairwell shall be separated from the<br>exit<br>stairwell by a 45 min closure.</td></tr><tr><td>C50</td><td>3.4.5.1.(2) and (9)</td><td>Existing illuminated legible exit<br>signs are acceptable.</td></tr><tr><td>C51</td><td>3.4.6.1.</td><td>Existing acceptable.</td></tr><tr><td>C52</td><td>3.4.6.2.</td><td>Existing acceptable, if visually apparent.</td></tr><tr><td>C53</td><td>3.4.6.3.(1)</td><td>Existing acceptable with rise no greater than 3.7 m.</td></tr><tr><td>C54</td><td>3.4.6.4.(1)<br>to (3)</td><td>Existing acceptable.</td></tr><tr><td>C55</td><td>3.4.6.4.(4) and (5)</td><td>Existing acceptable.</td></tr><tr><td>C56</td><td>3.4.6.5.(3) to<br>(13)</td><td>Existing acceptable.</td></tr><tr><td>C57</td><td>3.4.6.6.(2) to<br>(4)</td><td>Existing acceptable.</td></tr><tr><td>C58</td><td>3.4.6.7.(1)</td><td>Existing acceptable.</td></tr><tr><td>C59</td><td>3.4.6.8.</td><td>Existing acceptable.</td></tr><tr><td>C60</td><td>3.4.6.9.</td><td>(a) Except for retirement homes, existing acceptable.<br>(b) For retirement homes, existing acceptable provided there is no change in major<br>occupancy<br>or increase in occupant load<br>greater than 15%.</td></tr></tbody></table>\n\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>C61</td><td>3.4.6.10.(2) to (6)</td><td>Existing acceptable.</td></tr><tr><td>C62</td><td>3.4.6.11.(1) to (3)</td><td>Existing acceptable.</td></tr><tr><td>C63</td><td>3.4.6.12.</td><td>Existing acceptable in heritage buildings<br>provided the occupant load<br>is not more than<br>60.</td></tr><tr><td>C64</td><td>3.4.6.16.(1) to (4)</td><td>Existing functionally operable panic hardware acceptable.</td></tr><tr><td>C65</td><td>3.4.7.2.</td><td>Except for retirement homes, combustible<br>fire escapes which are protected from fire<br>in accordance with Sentence 3.2.3.13.(2) are permitted or may be reconstructed or<br>recreated (as in the case of a heritage building).</td></tr><tr><td>C66</td><td>3.5.1.</td><td>Existing acceptable except where building<br>is classified under Subsection 3.2.6.</td></tr><tr><td>C67</td><td>3.6.2.1.(7)</td><td>45 min fire separation<br>acceptable.</td></tr><tr><td>C68</td><td>3.6.2.2.</td><td>Existing acceptable where explosion-resistant construction<br>or venting is provided.</td></tr><tr><td>C69</td><td>3.6.2.6.</td><td>Existing acceptable.</td></tr><tr><td>C70</td><td>3.6.2.7.(1)</td><td>2 h fire separation<br>acceptable.</td></tr><tr><td>C71</td><td>3.6.3.1.(1) to (5)</td><td>45 min fire separation<br>acceptable up to 6 storeys.</td></tr><tr><td>C72</td><td>3.6.3.3.(2)</td><td>Where 2 h fire separation<br>is required,1 h is acceptable.<br>Except for linen discharge rooms where 1 h fire separation<br>is required, 45 min is<br>acceptable.</td></tr><tr><td>C73</td><td>3.6.3.3.(4) and (5)</td><td>Existing sizes acceptable.</td></tr><tr><td>C74</td><td>3.6.3.3.(9)</td><td>Where 2 h fire separation<br>is required,1 h is acceptable.</td></tr><tr><td>C75</td><td>3.6.4.2.</td><td>Except for retirement homes, ceiling fire separation<br>need not have a fire-resistance<br>rating<br>where sprinklering, subject to C.A.<br>C27, of fire compartments<br>on both sides of<br>vertical fire separation<br>is provided and where such fire separation<br>is not required to<br>exceed 1 h.</td></tr><tr><td>C76</td><td>3.6.4.3.(1)</td><td>Existing to meet flame-spread rating<br>of 25 or to be sprinklered.</td></tr><tr><td>C77</td><td>3.6.4.4. to 3.6.4.6.</td><td>Existing access acceptable.</td></tr><tr><td>C78</td><td>3.7.1.1.(2)</td><td>Minimum room height shall be not less than 1 950 mm over the required floor area<br>and any location that would normally be used as a means of egress.</td></tr><tr><td>C79</td><td>3.7.2.1.</td><td>(a)<br>Where windows are not used as means of egress<br>and where they do not conflict<br>with ventilation requirements, the minimum glass areas as shown in Table<br>9.7.2.3. may be reduced by 50%, or<br>(b) an existing room converted to an interior room, created by an addition, shall not<br>require a window, provided there is an opening in a dividing wall occupying not<br>less than 30% of the separating plane to an adjoining room, where the adjoining<br>room has a minimum of 5% window area of the combined floor areas, and<br>provided the required ventilation for the combined room is maintained.</td></tr><tr><td>C80</td><td>3.7.4.</td><td>Where the occupant load<br>is increased by more than 15% above the capacity of the<br>existing facilities, facilities to be<br>added to accommodate the increase.</td></tr></tbody></table>\n\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>C81</td><td>3.8.1.2.</td><td>Existing accessible entrance acceptable. (see C.A.<br>C88)<br>Existing curb ramp<br>conforming to Sentence 3.8.3.2.(3) is acceptable.<br>Existing principal entrance acceptable, provided at least one<br>barrier-free<br>entrance is<br>available.</td></tr><tr><td>C82</td><td>3.8.1.3.(1)</td><td>Existing unobstructed width of 920 mm minimum is acceptable.</td></tr><tr><td>C83</td><td>3.8.1.3.(4)</td><td>Existing unobstructed space not less than 1 500 mm in width and 1 500 mm in length<br>located not more than 30 m apart is acceptable.</td></tr><tr><td>C84</td><td>3.8.3.2.(3)(b)</td><td>Existing curb ramp<br>acceptable, provided width not less than 1 200 mm.</td></tr><tr><td>C85</td><td>3.8.3.3.(1)</td><td>Existing doorway acceptable, provided not less than 800 mm wide.</td></tr><tr><td>C86</td><td>3.8.3.3.(11)(a)</td><td>Existing distance acceptable, provided not less than 1 200 mm plus the width of any<br>door that swings into the space in the path of travel.</td></tr><tr><td>C87</td><td>3.8.3.4.(1)(a)</td><td>Existing ramp acceptable, provided not less than 870 mm between handrails.</td></tr><tr><td>C88</td><td>3.8.3.8.(5)</td><td>Existing grab bar is acceptable.</td></tr><tr><td>C89</td><td>3.8.3.12.</td><td>Existing universal washroom acceptable.</td></tr><tr><td>C90</td><td>3.8.3.13.(2) (g)</td><td>Existing grab bar is acceptable.</td></tr><tr><td>C91</td><td>3.8.3.16.</td><td>Existing drinking fountain conforming to Clauses 3.8.3.16.(2)(a) and (b) acceptable.</td></tr><tr><td>C92</td><td>3.11.3.1.(9)</td><td>Existing clear width acceptable, provided not less than 900 mm.</td></tr><tr><td>C93</td><td>3.11.3.1.(14)</td><td>Existing painted line acceptable.</td></tr><tr><td>C94</td><td>4.1.8.</td><td>The requirements under this Subsection do not apply.</td></tr><tr><td>C95</td><td>6.3.1.1.(2)</td><td>Required outdoor air rates may be provided by mechanical, natural or combination of<br>natural and mechanical means.</td></tr><tr><td>C96</td><td>6.3.2.3.; 6.3.2.6.; 6.3.2.6A.;<br>6.3.2.10.</td><td>Existing acceptable.</td></tr><tr><td>C97</td><td>6.3.2.7.(1)</td><td>In a building<br>containing not more than four dwelling units<br>or residential suites, the<br>existing heating or air-conditioning<br>system may be altered to serve more than one<br>dwelling unit<br>or suite, provided smoke alarms<br>are installed in each dwelling unit<br>or<br>suite<br>and provided<br>a smoke detector<br>is<br>installed in the supply or return air duct<br>system serving the entire building<br>which would turn off the fuel supply and electrical<br>power to the heating system upon activation of such detector.</td></tr><tr><td>C98</td><td>6.3.2.9.</td><td>Existing openings, grilles and diffusers acceptable.</td></tr><tr><td>C99</td><td>6.3.3.</td><td>Existing acceptable, provided products of combustion are safely vented.</td></tr><tr><td>C100</td><td>6.5.1.1.</td><td>Existing acceptable.</td></tr></tbody></table>\n\n\n\n<h4 class=\"table-title\">Table 11.5.1.1.-C (Cont'd) Compliance Alternatives for Residential Occupancies</h4>\n\nForming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th></th><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td></td><td>C101</td><td>6.9.4.4.(1)</td><td>Carbon monoxide alarms<br>may be battery operated or plugged into an electrical<br>outlet.</td></tr><tr><td>r1</td><td>C102</td><td>8.2.1.4.</td><td>Existing clearances acceptable where a sewage system<br>is replaced with another<br>sewage system<br>within the same class and the capacity of the replacement sewage<br>system<br>does not exceed the capacity of the existing sewage system.</td></tr><tr><td></td><td>C103</td><td>8.2.1.4.</td><td>Existing clearances are acceptable where a replacement sewage system<br>requires<br>lesser clearances than those required in Part 8 for the existing sewage system.</td></tr><tr><td></td><td>C104</td><td>9.3.2.1.</td><td>Sound used lumber may be acceptable for reuse without a grade stamp provided<br>that:<br>(a)<br>visual examination shows no excessive weakening by holes, notches, nail splits<br>or other damage,<br>(b)<br>where the grade or species is unknown, the minimum grade shall apply for span<br>table use, and<br>(c)<br>lumber has not been subjected to termite infestation.</td></tr><tr><td></td><td>C105</td><td>9.5.3.1.</td><td>Except for secondary suites, in a dwelling unit,<br>(a)<br>minimum room height shall not be less than 1 950 mm over the required floor<br>area and in any location that would normally be used as a means of egress, or<br>(b)<br>minimum room height shall not be less than 2 030 mm over at least 50% of the<br>required floor area,<br>provided that any part of the floor having a clear height of<br>less than 1 400 mm shall not be considered in computing the required floor<br>area.</td></tr><tr><td></td><td>C106</td><td>9.5.11.1.</td><td>Doors may be lesser heights to suit ceiling heights.</td></tr><tr><td></td><td>C107</td><td>9.5.11.2.</td><td>Existing acceptable, provided not less than 600 mm.</td></tr><tr><td></td><td>C108</td><td>9.6.1.2.(2) and (3); 9.6.1.4.(1)<br>and (2)</td><td>Existing doors and sidelights being reused or relocated need not conform if identified<br>or protected.</td></tr><tr><td></td><td>C109</td><td>9.6.1.4.(3)</td><td>Existing acceptable, if marked to indicate their existence and position.</td></tr><tr><td></td><td>C110</td><td>9.7.2.3.</td><td>(a)<br>Where windows are not used as a means of egress<br>and where they do not<br>conflict with ventilation requirements, the minimum glass areas as shown in<br>Table 9.7.2.3. may be reduced by 50%, and<br>(b)<br>an existing room converted to an interior room, created by an addition, shall not<br>require a window, provided there is an opening in a dividing wall occupying not<br>less than 30% of the separating plane to an adjoining room, where the adjoining<br>room has a minimum of 5% window area of the combined floor areas, and<br>provided the required ventilation for the combined room is maintained.</td></tr></tbody></table>\n\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>C111</td><td>9.7.4.</td><td>Existing acceptable.</td></tr><tr><td>C112</td><td>9.8.1. to 9.8.4.</td><td>Replacement or extension of existing stair systems shall be exempt from the<br>provisions of these Subsections, except that they shall have:<br>(a)<br>a minimum width between wall faces of 700 mm, and<br>(b)<br>a minimum clear height over tread nosing or landing of 1 800 mm.</td></tr><tr><td>C113</td><td>9.8.4.3. and 9.8.4.7.</td><td>Existing curved or spiral stairs are acceptable.</td></tr><tr><td>C114</td><td>9.8.4.5.</td><td>Where a stair complies with Subsection 9.8.4., an extension to a stair may contain<br>two sets of winders provided that<br>they are separated by at least three treads or a<br>landing.</td></tr><tr><td>C115</td><td>9.8.5.1.(2)</td><td>Existing<br>ramps<br>acceptable, where practical.</td></tr><tr><td>C116</td><td>9.8.7.</td><td>Existing handrails acceptable, unless considered unsafe by chief building official.</td></tr><tr><td>C117</td><td>9.8.8.</td><td>Existing guards<br>acceptable, unless considered unsafe by chief building official.</td></tr><tr><td>C118</td><td>9.8.9.6.(4)</td><td>Existing acceptable.</td></tr><tr><td>C119</td><td>9.9.2.1.(1) to (2.1)</td><td>Except for hotels, the following types of exits<br>may also be used:<br>(a)<br>connected balconies, which connect across firewalls, or connect to another exit,<br>or with access to grade,<br>(b)<br>areas of refuge approved by the chief<br>building official, where fire service rescue<br>is possible, or<br>(c)<br>combustible<br>or noncombustible<br>exterior stairways or fire escapes which are<br>protected in accordance with Sentence 3.2.3.13.(2). These may be<br>reconstructed or recreated (as in the case of a heritage building).</td></tr><tr><td>C120</td><td>9.9.2.1.(4)</td><td>Except for hotels, existing acceptable.</td></tr><tr><td>C121</td><td>9.9.3.2.</td><td>In a building<br>containing not more than four dwelling units, the width of every exit<br>(a)<br>facility may be as the existing, but not less than 800 mm, or<br>(b)<br>in a building<br>containing more than four dwelling units, the width of every exit<br>facility may be as the existing, but not less than 900 mm.</td></tr><tr><td>C122</td><td>9.9.3.3.</td><td>(a)<br>In a building<br>containing not more than four dwelling units, the minimum width of a<br>public corridor<br>may be 800 mm, or<br>(b)<br>in a building<br>containing more than four dwelling units, the minimum width of a<br>public corridor<br>may be 900 mm.</td></tr><tr><td>C123</td><td>9.9.3.4.</td><td>Existing clear height of not less than 1 950 mm is acceptable.</td></tr><tr><td>C124</td><td>9.9.4.2.</td><td>Except as permitted in C.A.<br>C136, in a building<br>containing not more than four<br>dwelling units<br>or suites, one exit<br>need not be separated from the remainder of the<br>building<br>at the first storey<br>where there are one or more other exits<br>complying with<br>C.A.<br>C122.</td></tr><tr><td>C125</td><td>9.9.4.2.(1) and (2)</td><td>30 min fire separation<br>acceptable.</td></tr><tr><td>C126</td><td>9.9.5.4.</td><td>Existing acceptable.</td></tr><tr><td>C127</td><td>9.9.5.8.</td><td>Existing acceptable provided minimum 45 min fire separation<br>and where explosion<br>resistant construction<br>or venting is provided.</td></tr><tr><td>C128</td><td>9.9.5.9.</td><td>Existing acceptable, provided that the enclosure has a 45 min fire-resistance<br>rating.</td></tr></tbody></table>\n\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>C129</td><td>9.9.6.1.</td><td>Except for hotels, existing acceptable.</td></tr><tr><td>C130</td><td>9.9.6.2.</td><td>Existing clear opening height of not less than 1 950 mm is acceptable.</td></tr><tr><td>C131</td><td>9.9.6.3.</td><td>Existing door widths are acceptable, provided exit<br>widths conform to C.A.<br>C117.</td></tr><tr><td>C132</td><td>9.9.6.5.</td><td>Existing door swings acceptable.<br>Existing acceptable in public<br>heritage<br>buildings, where approved by chief building<br>official.</td></tr><tr><td>C133</td><td>9.9.6.6.(1)</td><td>Where<br>exit<br>doors open onto a landing, they shall not extend beyond the face of the<br>first riser.</td></tr><tr><td>C134</td><td>9.9.6.8.</td><td>Existing functionally operable passage or panic hardware acceptable.</td></tr><tr><td>C135</td><td>9.9.7.4.(1)(a)</td><td>Maximum area of existing room or suite<br>does not apply.</td></tr><tr><td>C136</td><td>9.9.7.5.</td><td>Except as provided in C.A.<br>C139, in a single dwelling unit<br>or a house with a<br>secondary suite, the Code requirement applies.</td></tr><tr><td>C137</td><td>9.9.8.2.(1)</td><td>Existing travel distance acceptable where floor area<br>is sprinklered<br>and provided fire<br>separations<br>comply with Part 9.</td></tr><tr><td>C138</td><td>9.9.8.5.</td><td>In a building<br>containing not more than four dwelling units<br>or suites, existing glazed<br>solid wood doors to lobby may remain in lieu of new 20 minute doors, provided the<br>fire separations<br>for the floor above or below are provided as per C.A.<br>C154, and a<br>second means of egress<br>from the dwelling<br>units<br>complies with the Code<br>requirements.</td></tr><tr><td>C139</td><td>9.9.9</td><td>In a single dwelling unit<br>or a house with a secondary suite, exit<br>requirements are<br>acceptable if at least one of the following conditions exists:<br>(a)<br>a door, including a sliding door, that opens directly to the exterior from a<br>dwelling unit, serves only that dwelling unit<br>and has reasonable access to<br>ground level, and the dwelling units<br>are equipped with smoke alarms<br>installed in<br>conformance with Subsection 9.10.19.,<br>(b)<br>an exit<br>that is accessible to more than one dwelling unit<br>and provides the only<br>means of egress<br>from each dwelling unit, provided that the means of egress<br>is<br>separated from the remainder of the building<br>and common areas by a fire<br>separation<br>having a 30 min fire-resistance rating<br>and provided further that the<br>required access to exit<br>from any dwelling unit<br>cannot be through another<br>dwelling unit, service room<br>or other occupancy, and both dwelling units<br>and<br>common areas are provided with smoke alarms<br>that are installed in<br>conformance with Subsection 9.10.19. and are interconnected, or<br>(c)<br>access to an exit<br>from one dwelling unit<br>which leads through another dwelling<br>unit<br>where,<br>(i)<br>an additional means of escape is provided through a window that conforms<br>to the following:<br>(A)<br>the sill height is not more than 1 000 mm above or below adjacent<br>ground level,<br>(B)<br>the window can be opened from the inside without the use of tools,<br>(C)<br>the window has an individual unobstructed open portion having a<br>minimum area of 0.38 m² with no dimension less than 460 mm,</td></tr></tbody></table>\n\n\n\n<h4 class=\"table-title\">Table 11.5.1.1.-C (Cont'd) Compliance Alternatives for Residential Occupancies</h4>\n\nForming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>C139<br>(Cont'd)</td><td>9.9.9.</td><td>(D)<br>the sill height does not exceed 900 mm above the floor or fixed steps,<br>(E)<br>where the window opens into a window well, a clearance of not less<br>than 1 000 mm shall be provided in front of the window, and<br>(F)<br>smoke alarms are installed in every dwelling unit<br>and in common areas<br>in conformance with Subsection 9.10.19. and are interconnected,<br>(ii)<br>an additional means of escape is provided through a window that conforms<br>to the following:<br>(A)<br>the window is a casement window not less than 1 060 mm high,<br>560<br>mm wide, with a sill height not more than 900 mm above the<br>inside floor,<br>(B)<br>the sill height of the window is not more than 5 m above adjacent<br>ground level, and<br>(C)<br>smoke alarms<br>are installed in every dwelling unit<br>and in common areas<br>in conformance with Subsection 9.10.19. and are interconnected, or<br>(iii)<br>the building<br>is sprinklered<br>and the dwelling units<br>are equipped with smoke<br>alarms<br>installed in conformance with Subsection 9.10.19.</td></tr><tr><td>C140</td><td>9.9.10.1.</td><td>In a single dwelling unit<br>or a house with a secondary suite, existing acceptable,<br>where there is direct access to the exterior.</td></tr><tr><td>C141</td><td>9.9.11.</td><td>In a single dwelling unit<br>or a house with a secondary suite, the requirements under<br>this Subsection do not apply.</td></tr><tr><td>C142</td><td>9.9.11.3.</td><td>Existing illuminated legible signs are acceptable for<br>exit<br>signs, if approved by chief<br>building official.</td></tr><tr><td>C143</td><td>9.9.12.</td><td>In a single dwelling unit<br>or a house with a secondary suite, the requirements under<br>this Subsection apply only where the condition described in (b) of C.A.<br>C139 exists.</td></tr><tr><td>C144</td><td>9.10.1.1.</td><td>Assemblies required to be of noncombustible<br>construction<br>may be supported by<br>combustible<br>construction<br>having at least the same fire-resistance rating<br>as that<br>supported.</td></tr><tr><td>C145</td><td>9.10.1.3.(8) to (10)</td><td>Existing installations acceptable subject to C.A.<br>C26, C27 and C28.</td></tr><tr><td>C146</td><td>9.10.3.</td><td>Fire-resistance ratings<br>may also be used where they are based on:<br>1.<br>HUD Rehabilitation Guidelines, \"Guideline on Fire Ratings of Archaic Materials<br>and Assemblies\".<br>2.<br>DBR Technical Paper No. 194, \"Fire Endurance of Protected Steel Columns and<br>Beams\".<br>3.<br>DBR Technical Paper No. 207, \"Fire Endurance of Unit Masonry Walls\".<br>4.<br>DBR Technical Paper No. 222, \"Fire Endurance of Light-Framed and<br>Miscellaneous Assemblies\".</td></tr><tr><td>C147</td><td>9.10.5.1.</td><td>(a)<br>Existing openings in existing wall or ceiling membranes to remain.<br>(b)<br>Existing openings may be moved to another location in the same wall or ceiling,<br>provided the aggregate area of openings does not increase and are not<br>cumulative, and the existing opening is blocked up to provide the same rating as<br>the existing wall or ceiling assembly.</td></tr><tr><td>C148</td><td>9.10.6.2.</td><td>Existing heavy timber construction<br>acceptable where construction<br>is within 90% of<br>member sizes listed in Part 3.</td></tr><tr><td>C149</td><td>9.10.7.</td><td>Existing acceptable for heritage buildings, subject to approval of chief building<br>official.</td></tr></tbody></table>\n\n\n\n<h4 class=\"table-title\">Table 11.5.1.1.-C (Cont'd) Compliance Alternatives for Residential Occupancies</h4>\n\nForming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th></th><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>e1</td><td>C150</td><td>9.10.8.1.; 9.10.8.3.; 9.10.8.8.</td><td>(a)<br>Except as provided in (b) and (c), 30 min rating is acceptable.<br>(b)<br>In a house with a secondary suite, 15 min horizontal fire separation<br>is<br>acceptable where,<br>(i)<br>smoke alarms<br>are installed in every dwelling unit<br>and in common areas in<br>conformance with Subsection 9.10.19., and<br>(ii)<br>smoke alarms<br>are interconnected.<br>(c)<br>In a house<br>with a secondary suite, the fire-resistance rating<br>of the fire<br>separation<br>is waived where the building<br>is sprinklered throughout.</td></tr><tr><td></td><td>C151</td><td>9.10.8.4.</td><td>Assemblies required to be of noncombustible construction<br>may be supported by<br>combustible construction<br>having at least the same fire-resistance rating<br>as that<br>supported.</td></tr><tr><td></td><td>C152</td><td>9.10.9.7.; 9.10.9.11.</td><td>Existing acceptable in existing fire separations.</td></tr><tr><td></td><td>C153</td><td>9.10.9.12.(1)</td><td>Ceiling fire separation<br>need not have a fire-resistance rating<br>where sprinklering,<br>subject to C.A.<br>C27, of fire compartments<br>on both sides of vertical fire separation<br>is<br>provided and where such fire separation<br>is not required to exceed 1 h.</td></tr><tr><td></td><td>C154</td><td>9.10.9.13.(1)</td><td>Except for hotels, 30 min fire separation<br>acceptable.</td></tr><tr><td></td><td>C155</td><td>9.10.9.13.(2)</td><td>In lieu of the 2 h fire separation, sprinklers may be used in the mercantile<br>occupancy<br>or medium-hazard industrial<br>occupancy, with a 1 h fire separation.</td></tr><tr><td>e1</td><td>C156</td><td>9.10.9.16.(1) and (3);<br>9.10.9.17.(1)</td><td>Except as provided in (b) and (c), 30 min fire separation<br>(a)<br>is acceptable.<br>(b)<br>In a house with a secondary suite, 15 min horizontal fire separation<br>is<br>acceptable where,<br>(i)<br>smoke alarms<br>are installed in every dwelling unit<br>and in common areas in<br>conformance with Subsection 9.10.19., and<br>(ii)<br>smoke alarms<br>are interconnected.<br>(c)<br>In a house with a secondary suite, the fire-resistance rating<br>of the fire separation<br>is waived where the building<br>is sprinklered<br>throughout.</td></tr><tr><td>e1</td><td>C157</td><td>9.10.10.3.</td><td>(a)<br>Except as provided in (b) and (c) and in Articles 9.10.10.5. and 9.10.10.6.,<br>30<br>min fire separation<br>is acceptable.<br>(b)<br>In a house with a secondary suite, the fire-resistance rating<br>of the vertical fire<br>separation<br>is waived where,<br>(i)<br>smoke alarms<br>are installed in every dwelling unit<br>and in common areas in<br>conformance with Subsection 9.10.19., and<br>(ii)<br>smoke alarms<br>are interconnected.<br>(c)<br>In a house with a secondary suite, the fire-resistance rating<br>of the vertical fire<br>separation<br>is waived where service rooms<br>are sprinklered.</td></tr><tr><td>e2</td><td>C158</td><td>9.10.11.2.(1)</td><td>In an individual dwelling unit<br>or a house with a secondary suite, a party wall<br>with 1 h<br>fire-resistance rating<br>is acceptable.</td></tr><tr><td>e2</td><td>C159</td><td>9.10.13.1</td><td>Existing functional<br>closures<br>are acceptable subject to C.A.C8 and C160.</td></tr><tr><td></td><td>C160</td><td>9.10.13.2.(1)</td><td>In an individual dwelling unit<br>or a house with a secondary suite, existing unlabelled<br>doors at least 45 mm solid core wood or metal clad are acceptable. For existing<br>closures, ratings of 20 min will not be required where the entire floor area<br>is<br>sprinklered.</td></tr></tbody></table>\n\n\nC.A. Number Division B Requirements Compliance Alternative C161 9.10.13.2.(1) In a building containing not more than four dwelling units or suites, existing glazed solid wood doors to corridors may remain in lieu of new 20 min doors, provided they are not located in a dead-end corridor. C162 9.10.13.3. Existing acceptable provided that wood door frames are secured with hinge screws going through frame into the stud. C163 9.10.13.5. Existing wired glass acceptable. Existing transoms or sidelights located in required fire separations may be retained if wired glass, at least 6 mm thick, is securely fixed to a wood frame of at least 50 mm thickness with steel stops. Operable transoms shall be fixed closed. C164 9.10.13.6. Existing steel door frames acceptable. C165 9.10.13.7. Existing glass block acceptable. C166 9.10.13.8. Existing sizes acceptable. C167 9.10.13.9. Existing operable latches acceptable. C168 9.10.13.10.(1) Existing functionally operable self-closing devices acceptable. C169 9.10.13.11. Existing operable self-releasing electromagnetic hold-open device acceptable, and except for hotels, fusible link hold-open devices acceptable. C170 9.10.13.12. Existing swings acceptable. C171 9.10.13.13.(1) Except as permitted in C.A. C172, in a building containing not more than four dwelling units, the existing heating or air-conditioning system may be altered to serve more than one dwelling unit, provided smoke alarms are installed in each dwelling unit and provided a smoke detector is installed in the supply or return air duct system serving the entire building which would turn off the fuel supply and electrical power to the heating system upon activation of such detector. C172 9.10.13.13.(1) In detached houses, semi-detached houses, townhouses and row houses containing not more than two dwelling units, or houses with a secondary suite, existing acceptable. C173 9.10.13.14.; 9.10.5.1. Except as permitted in C.A. C174, in a building containing not more than four dwelling units, the existing heating or air-conditioning system may be altered to serve more than one dwelling unit, provided smoke alarms are installed in each dwelling unit and provided a smoke detector is installed in the supply or return air duct system serving the entire building which would turn off the fuel supply and electrical power to the heating system upon activation of such detector. C174 9.10.13.14.; 9.10.5.1. In an individual dwelling unit or a house with a secondary suite, existing acceptable.\n\nr1\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>C175</td><td>9.10.14.2.(2) and (3);<br>9.10.14.4.(2);<br>9.10.15.2.(3) and (4);<br>9.10.15.4.(9)</td><td>Where an addition to an existing residential building<br>has its exposing building face<br>further distant from the line than the existing exposing building face<br>and the limiting<br>distance is at least 1 200 mm, the total area of allowable unprotected openings<br>may<br>be determined under Sentence 9.10.14.2.(2) or 9.10.15.2.(3) for the combined new<br>and existing exposing<br>building faces<br>and,<br>(a) where the existing exposing building face has no unprotected openings, or the<br>existing unprotected openings are to be filled in, the total allowable area of<br>unprotected openings may be installed in the new exposing building face, or<br>(b) where the existing unprotected openings are to remain,<br>(i) their area shall be deducted from the total allowable area of unprotected<br>openings, and the balance may be installed in the new exposing building<br>face, and<br>(ii) Sentences 9.10.14.2.(3) and 9.10.14.4.(2) or Sentences 9.10.15.2.(4) and<br>9.10.15.4.(9) apply only to the new exposing building face.</td></tr><tr><td>C176</td><td>9.10.14.4.; 9.10.15.4.</td><td>Existing windows.<br>(a)<br>Existing windows in walls may be relocated to another part of the wall,<br>provided<br>the existing opening is blocked up to provide the same fire rating for the wall, and<br>the projection of the new opening, at a right angle to the property line onto<br>another building, lies no closer than 300 mm from a window in such other<br>building, where the \"opposite\" window is less than 2 400 mm from the opposite<br>new opening, and<br>(b)<br>except relocation of units, to be restricted to the same fire compartment and shall<br>conform to the requirements of Article 3.2.3.14. or 9.10.12.3. where applicable, or<br>(c)<br>where a building<br>does not satisfy the requirements of Subsection 3.2.3. for the<br>amount of openings facing a yard or space that does not have sufficient limiting<br>distance, such existing openings are allowed to be relocated provided:<br>(i)<br>such openings are not increased in size and they are protected with wired<br>glass in steel frames conforming to Sentence 3.1.8.16.(2), or<br>(ii)<br>the building is sprinklered.</td></tr><tr><td>C177</td><td>9.10.16.2.(1)</td><td>Where balloon framing is exposed during renovation, fire blocks<br>shall be provided.</td></tr><tr><td>C178</td><td>9.10.18.</td><td>(a)<br>Subject to approval by the chief building<br>official, existing fire alarm system may<br>remain where the fire safety plan (as described in the Fire Code made under the<br>Fire Protection and Prevention Act, 1997) for the building<br>addresses the intent of<br>Subsection 3.2.4. (i.e. \"stage\" system, electrical supervision, detection as<br>required, Fire Department connection, and emergency power supply), and<br>(b)<br>extension of an existing system must ensure continuity and compatibility, and<br>integrity of the system.</td></tr><tr><td>C179</td><td>9.10.19.4.</td><td>Smoke alarms<br>may be battery operated.</td></tr><tr><td>C180</td><td>9.10.20.</td><td>Existing access acceptable.</td></tr></tbody></table>\n\n\n\n<h4 class=\"table-title\">Table 11.5.1.1.-C (Cont'd) Compliance Alternatives for Residential Occupancies</h4>\n\nForming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>C181</td><td>9.11.1.1.</td><td>Where a house contains a secondary suite, each dwelling unit<br>shall be separated<br>from every other space in the house in which noise may be transmitted by:<br>(a)<br>construction<br>(i)<br>whose joist spaces are filled with sound-absorbing material of not less than<br>150 mm nominal thickness,<br>(ii)<br>whose stud spaces are filled with sound-absorbing material,<br>(iii)<br>having a resilient channel on one side of the separation spaced 400 or 600<br>mm o.c., and,<br>(iv)<br>having not less than 12.7 mm thick gypsum board on ceilings and on both<br>sides of walls,<br>(b)<br>construction<br>providing an<br>STC<br>rating of not less than 43, or<br>(c) a separating assembly and adjoining constructions, which together provide an<br>ASTC<br>rating of not less than 40.</td></tr><tr><td>C182</td><td>9.14.2.1.(1.1)</td><td>Existing acceptable.</td></tr><tr><td>C183</td><td>9.18.2.</td><td>Existing access acceptable.</td></tr><tr><td>C184</td><td>9.18.3.</td><td>Existing vents and ventilation acceptable.</td></tr><tr><td>C185</td><td>9.19.</td><td>Existing acceptable.</td></tr><tr><td>C186</td><td>9.20.2.2.</td><td>Used masonry may be reused for patching and filling openings to match adjacent<br>work. Used interior brick may not be used for exterior applications.</td></tr><tr><td>C187</td><td>9.20.3.</td><td>Archaic mortars may be used to match existing jointing.</td></tr><tr><td>C188</td><td>9.20.4.1.</td><td>Sound jointing techniques may be employed to match existing archaic joints.</td></tr><tr><td>C189</td><td>9.20.12.1.</td><td>Corbelling may be constructed to match existing or original details, provided that it is<br>structurally adequate for the proposed use.</td></tr><tr><td>C190</td><td>9.21.</td><td>Existing acceptable, provided the products of combustion are safely vented and<br>provided no fire hazard is created.</td></tr><tr><td>C191</td><td>9.22.1. to 9.22.7.</td><td>Sound period materials, designs and techniques may be employed in recreated<br>fireplaces, provided no fire hazard is created. Existing need not comply with Article<br>9.22.1.4.</td></tr><tr><td>C192</td><td>9.23.</td><td>Existing acceptable.</td></tr><tr><td>C193</td><td>9.24.</td><td>Existing acceptable.</td></tr><tr><td>C194</td><td>9.25.</td><td>A vapour barrier<br>may consist of paint or other coating with specified perm rating such<br>as two coats of leafing aluminum pigmented paint.</td></tr><tr><td>C195</td><td>9.26.</td><td>Existing acceptable, except when removing and replacing shingles, comply with the<br>eave protection requirements of Subsection 9.26.5.</td></tr><tr><td>C196</td><td>9.27.</td><td>Existing acceptable.</td></tr><tr><td>C197</td><td>9.28.</td><td>All replacement or recreation of existing stucco may be compatible with the existing<br>materials and application.</td></tr></tbody></table>\n\n\n\n<h4 class=\"table-title\">Table 11.5.1.1.-C (Cont'd) Compliance Alternatives for Residential Occupancies</h4>\n\nForming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th></th><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td></td><td>C198</td><td>9.29.4.</td><td>Existing acceptable. All replacement or recreation of existing plaster may be<br>compatible with the existing materials and application.</td></tr><tr><td></td><td>C199</td><td>9.32.</td><td>In an individual dwelling unit<br>or a house with a secondary suite, rooms or spaces<br>shall be ventilated by natural means in accordance with Subsection 9.32.2. or by<br>providing adequate mechanical ventilation.</td></tr><tr><td>r1</td><td>C200</td><td>9.32.3.9C.</td><td>Carbon monoxide alarms<br>may be battery operated or plugged into an electrical<br>outlet.</td></tr><tr><td>r1</td><td>C201</td><td>9.33.1.1.</td><td>In a building<br>containing not more than four dwelling units, the existing heating or air<br>conditioning<br>system may be altered to serve more than one dwelling unit, provided<br>smoke alarms<br>are installed in each dwelling unit<br>and provided a smoke detector<br>is<br>installed in the supply or return air duct system serving the entire building which<br>would turn off the fuel supply and electrical power to the heating system upon<br>activation of such detector.</td></tr><tr><td></td><td>C202</td><td>9.33.5.3.</td><td>Sound, used or antique appliances<br>are acceptable, provided that:<br>(a)<br>visual examination shows no excessive weakening by corrosion or other<br>damage,<br>(b)<br>no structural parts are missing,<br>(c)<br>no cracks are present in the components intended to support the appliance<br>or<br>enclose the fire, and<br>(d)<br>loading and ash removal door latches and hinges hold the door closed.</td></tr><tr><td></td><td>C203</td><td>9.33.6.5.(1);<br>9.33.6.6.(1) to (3),<br>(5), (11) and (12)</td><td>Existing acceptable.</td></tr><tr><td></td><td>C204</td><td>9.33.6.6.(8)</td><td>Where the duct system is being altered, lesser amounts and extent of insulation will<br>be permitted.</td></tr><tr><td></td><td>C205</td><td>9.33.6.13.(7.1)</td><td>In a building<br>containing not more than four dwelling units<br>or residential suites, the<br>existing heating or air-conditioning<br>system may be altered to serve more than one<br>dwelling unit<br>or suite, provided smoke alarms<br>are installed in each dwelling unit<br>or<br>suite<br>and provided a smoke detector<br>is installed in the supply or return air duct<br>system serving the entire building<br>which would turn off the fuel supply and electrical<br>power to the heating system upon activation of such detector.</td></tr><tr><td></td><td>C206</td><td>9.38.</td><td>Sound used materials shall be<br>acceptable for reuse, subject to the following<br>limitations:<br>(a)<br>visual examination shows no excessive weakening by holes, notches, nail splits<br>or other damage, and<br>(b) logs have not been subjected to termite infestation.</td></tr><tr><td></td><td>C207</td><td>12.2.1.2.(3)</td><td>(a)<br>Where the framing systems are being altered to match the existing framing,<br>lesser amounts and extent of insulation and vapour barrier<br>is acceptable.<br>(b)<br>Existing acceptable for Article 2.1.1.9. of MMA Supplementary Standard SB-12,<br>\"Energy Efficiency for Housing\".<br>(c)<br>Existing previously occupied log houses that are dismantled and reconstructed<br>are exempt from Article 3.1.1.6. of MMA Supplementary Standard SB-12,<br>\"Energy Efficiency for Housing\".</td></tr></tbody></table>\n\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>DE1</td><td>3.1.4.7.</td><td>Existing heavy timber construction<br>acceptable where construction<br>is within 90% of<br>member sizes listed in Part 3.</td></tr><tr><td>DE2</td><td>3.1.5.2. to 3.1.5.4.; 3.1.5.8.</td><td>Existing acceptable.</td></tr><tr><td>DE3</td><td>3.1.5.9. to 3.1.5.12.</td><td>Except for exposed foamed plastics, existing acceptable. To match existing,<br>materials may be added from on or off site.</td></tr><tr><td>DE4</td><td>3.1.5.18. to 3.1.5.20.; 3.1.5.25.</td><td>Existing acceptable.</td></tr><tr><td>DE5</td><td>3.1.7.1.</td><td>Fire-resistance ratings<br>may also be used where they are based on:<br>1.<br>HUD Rehabilitation Guidelines, \"Guideline on Fire Ratings of Archaic Materials<br>and Assemblies\".<br>2.<br>DBR Technical Paper No. 194, \"Fire Endurance of Protected Steel Columns and<br>Beams\".<br>3.<br>DBR Technical Paper No. 207, \"Fire Endurance of Unit Masonry Walls\".<br>4.<br>DBR Technical Paper No. 222, \"Fire Endurance of Light-Framed and<br>Miscellaneous Assemblies\".</td></tr><tr><td>DE6</td><td>3.1.7.5.(3)</td><td>Existing assemblies required to be of noncombustible construction<br>may be supported<br>by combustible construction<br>having at least the same fire-resistance rating<br>as that<br>supported.</td></tr><tr><td>DE7</td><td>3.1.8.1.(2); 3.1.8.6.</td><td>Existing functional closures<br>are acceptable and may be relocated within the same<br>existing fire separation.</td></tr><tr><td>DE8</td><td>3.1.8.5.(2)</td><td>(a)<br>Existing functional and sound doors in existing buildings<br>that are either hollow<br>metal or kalamein<br>and containing wired glass at least 6 mm thick and conforming<br>to Sentence 3.1.8.16.(2) are permitted in lieu of doors not required to exceed<br>45<br>min,<br>(b)<br>all existing functional and sound hollow doors which carry existing 1.5 h labels<br>are acceptable in lieu of current 1.5 h labels and may contain wired glass panels<br>not exceeding 0.0645 m², at least 6 mm thick and conforming to Sentence<br>3.1.8.16.(2), and<br>(c)<br>every fire door, window assembly or glass block used as a closure<br>in a required<br>fire separation<br>shall<br>be installed in conformance with good engineering practice.</td></tr><tr><td>DE9</td><td>3.1.8.7., 3.1.8.8. and 3.1.8.10.</td><td>Fire dampers<br>or fire stop flaps<br>are not required to be installed in existing ducts at<br>penetrations of existing fire separations.</td></tr><tr><td>DE10</td><td>3.1.8.12.(1)</td><td>For existing unlabelled doors in existing buildings, at least 45 mm solid core wood or<br>metal clad are acceptable.</td></tr><tr><td>DE11</td><td>3.1.8.15.</td><td>Existing functionally operable latching devices, excluding draw bolts, are acceptable.</td></tr><tr><td>DE12</td><td>3.1.8.16.</td><td>Existing transoms or sidelights located in required fire separations<br>may be retained if<br>wired glass, at least 6 mm thick, is securely fixed to a wood frame of at least 50 mm<br>thickness with steel stops. Operable transoms shall be fixed closed.</td></tr><tr><td>DE13</td><td>3.1.8.17. to 3.1.8.19.</td><td>Existing acceptable.</td></tr><tr><td>DE14</td><td>3.1.11.</td><td>Where the concealed space is being materially altered, smoke or heat detection in<br>that space in lieu of fire blocks<br>and tied into fire alarm system is acceptable.</td></tr></tbody></table>\n\n\nExisting windows.\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>DE15</td><td>3.2.3.</td><td>Existing windows.<br>(a)<br>Existing windows in walls may be relocated to another part of the wall, provided<br>the existing opening is blocked up to provide the same fire rating for the wall, and<br>the projection of the new opening, at a right angle to the property line onto<br>another building, lies not closer than 300 mm from a window in such other<br>building, where the \"opposite\" window is less than 2<br>400<br>mm from the opposite<br>new opening, and<br>(b)<br>except relocation of units, shall be restricted to the same fire compartment<br>and<br>shall conform to the requirements of Article 3.2.3.14. or 9.10.12.3. where<br>applicable, or<br>(c)<br>where a<br>building<br>does not satisfy the requirements of Subsection 3.2.3. for the<br>amount of openings facing a yard or space that does not have sufficient limiting<br>distance, such existing openings are allowed to be relocated provided:<br>(i)<br>such openings are not increased in size and they are protected with wired<br>glass in steel frames conforming to Sentence 3.1.8.16.(2), or<br>(ii)<br>the building<br>is sprinklered.</td></tr><tr><td>DE16</td><td>3.2.3.6.(3)</td><td>Existing roof soffit projections acceptable.</td></tr><tr><td>DE17</td><td>3.2.3.17.</td><td>Need not comply for \"E\" occupancy.</td></tr><tr><td>DE18</td><td>3.2.4.</td><td>(a)<br>Existing fire alarm system may remain except that Article 3.2.4.5. does not apply<br>where the fire safety plan (as described in the Fire Code made under the Fire<br>Protection and Prevention Act, 1997) for the building<br>addresses the intent of<br>Subsection 3.2.4. (i.e. \"stage\" system, electrical supervision, detection as<br>required, Fire Department connection, and emergency power supply), and<br>(b)<br>extension of an existing system must ensure continuity and compatibility, and<br>integrity of the system.</td></tr><tr><td>DE19</td><td>3.2.4.8.(2)(e)</td><td>Does not apply to existing installations in buildings.</td></tr><tr><td>DE20</td><td>3.2.4.9.(5)(c)</td><td>Does not apply to existing installations in buildings.</td></tr><tr><td>DE21</td><td>3.2.5.1.; 3.2.5.2.</td><td>Existing acceptable.</td></tr><tr><td>DE22</td><td>3.2.5.3.</td><td>Existing access acceptable.</td></tr><tr><td>DE23</td><td>3.2.5.4. to 3.2.5.6.</td><td>Existing acceptable provided the building<br>is sprinklered throughout.</td></tr><tr><td>DE24</td><td>3.2.5.7.</td><td>Does not apply, except where a change in major occupancy<br>occurs from a lesser<br>hazard index.</td></tr><tr><td>DE25</td><td>3.2.5.8. to 3.2.5.11.</td><td>Does not apply to buildings<br>6 storeys<br>and less.<br>Does not apply to sprinklered<br>buildings.</td></tr><tr><td>DE26</td><td>3.2.5.13.</td><td>Existing sprinkler systems in existing buildings<br>that do not conform to NFPA 13 may<br>be altered, added to, or extended from the existing system without complying with<br>NFPA 13, provided the system is operational and adequate with respect to coverage,<br>water supply and controls, and provided the system is evaluated by a qualified<br>designer.</td></tr><tr><td>DE27</td><td>3.3.1.5.(1)(c);<br>Tables 3.3.1.5A and 3.3.1.5B</td><td>In Column 2, maximum area of room or suite<br>to be unlimited.</td></tr></tbody></table>\n\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>DE28</td><td>3.3.1.9.(1)</td><td>Existing width of public corridors<br>of not less than 914 mm is acceptable.</td></tr><tr><td>DE29</td><td>3.3.1.11.; 3.3.1.12.</td><td>Existing door swings may remain in heritage buildings, existing or being restored,<br>with no change in major occupancy<br>and with occupant load<br>no greater than 100.</td></tr><tr><td>DE30</td><td>3.3.1.13.</td><td>Existing doors acceptable, provided not less than 600 mm wide.</td></tr><tr><td>DE31</td><td>3.3.1.16.</td><td>Existing curved stairs acceptable.</td></tr><tr><td>DE32</td><td>3.3.1.17.</td><td>Existing non-conforming capacities of access to exits<br>are acceptable, provided that:<br>(a)<br>the increase in occupant load<br>is not greater than 15%,<br>(b)<br>the corridor fire separations<br>are rated to Code, and<br>(c)<br>early warning systems are provided, or<br>(d)<br>there are sprinklers, plus smoke alarms<br>in suites.</td></tr><tr><td>DE33</td><td>3.3.1.18.</td><td>Does not apply to heritage buildings.</td></tr><tr><td>DE34</td><td>3.3.1.20.</td><td>Existing stained, etched, bevelled, leaded or figured glass acceptable.</td></tr><tr><td>DE35</td><td>3.3.5.4.; 3.3.5.7.(4)</td><td>Need not comply where a gasketed door and self closer are provided in the existing<br>fire separation.</td></tr><tr><td>DE36</td><td>3.4.1.4.</td><td>The following types of exits<br>may also be used for buildings<br>not over 6 storeys<br>in<br>building height:<br>(a)<br>connected balconies, which connect across firewalls, or connect to another exit,<br>or with access to grade,<br>(b)<br>areas of refuge where fire service rescue is possible and that comply with<br>Measure L of Sentences (4) to (10), (18), and Clauses (20)(a), (b) and (d) in<br>MMAH Supplementary Standard SB-4, \"Measures for Fire Safety in High<br>Buildings\".</td></tr><tr><td>DE37</td><td>3.4.1.8.</td><td>Existing stained, etched, bevelled, leaded or figured glass acceptable.</td></tr><tr><td>DE38</td><td>3.4.2.5.(1)</td><td>Existing travel distance acceptable where floor area is sprinklered.</td></tr><tr><td>DE39</td><td>3.4.3.2.(8)</td><td>Existing width of exits acceptable provided the occupant load is not more than 15%<br>above the exit capacity.</td></tr><tr><td>DE40</td><td>3.4.3.3.</td><td>Existing acceptable.</td></tr><tr><td>DE41</td><td>3.4.3.4.</td><td>Existing headroom clearance of not less than 1 980 mm is acceptable.</td></tr><tr><td>DE42</td><td>3.4.4.1.</td><td>Fire separations<br>of exits<br>permitted in buildings:<br>(a) 30 min, up to 3 storeys<br>in building height,<br>(b) 45 min, up to 6 storeys<br>in building height,<br>(c) 1 h, over 6 storeys<br>in building height.</td></tr><tr><td>DE43</td><td>3.4.4.4.(8)</td><td>Existing washrooms opening directly into exit<br>stairwell shall be separated from exit<br>stairwell by a 45 min closure.</td></tr><tr><td>DE44</td><td>3.4.5.1.(2) and (9)</td><td>Existing illuminated legible exit<br>signs are acceptable.</td></tr><tr><td>DE45</td><td>3.4.6.1.</td><td>Existing acceptable.</td></tr><tr><td>DE46</td><td>3.4.6.2.</td><td>Existing acceptable, if visually apparent.</td></tr><tr><td>DE47</td><td>3.4.6.3.(1)</td><td>Existing acceptable with rise no greater than 3.7 m.</td></tr></tbody></table>\n\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>DE48</td><td>3.4.6.4.(1) to (3)</td><td>Existing acceptable.</td></tr><tr><td>DE49</td><td>3.4.6.4. (4) and (5)</td><td>Existing acceptable.</td></tr><tr><td>DE50</td><td>3.4.6.5.(3) to (13)</td><td>Existing acceptable.</td></tr><tr><td>DE51</td><td>3.4.6.6.(1) to (5)</td><td>Existing acceptable.</td></tr><tr><td>DE52</td><td>3.4.6.7.(1)</td><td>Existing acceptable.</td></tr><tr><td>DE53</td><td>3.4.6.8.</td><td>Existing acceptable.</td></tr><tr><td>DE54</td><td>3.4.6.9.</td><td>Existing acceptable.</td></tr><tr><td>DE55</td><td>3.4.6.10.(2) to (6)</td><td>Existing acceptable.</td></tr><tr><td>DE56</td><td>3.4.6.11.(1) to (3)</td><td>Existing acceptable.</td></tr><tr><td>DE57</td><td>3.4.6.12.</td><td>Existing acceptable in<br>public heritage<br>buildings<br>or a change in occupancy<br>with no<br>increase in occupant load.</td></tr><tr><td>DE58</td><td>3.4.6.13.</td><td>Existing acceptable.</td></tr><tr><td>DE59</td><td>3.4.6.14.</td><td>Existing acceptable.</td></tr><tr><td>DE60</td><td>3.4.6.16.</td><td>Existing functionally operable panic hardware acceptable.</td></tr><tr><td>DE61</td><td>3.4.7.2.</td><td>Combustible<br>fire escapes which are protected from fire in accordance with Sentence<br>3.2.3.13.(2) are permitted or may be reconstructed or recreated (as in the case of a<br>heritage building).</td></tr><tr><td>DE62</td><td>3.5.1.</td><td>Existing acceptable except where building<br>is classified under Subsection 3.2.6.</td></tr><tr><td>DE63</td><td>3.6.2.1.(7)</td><td>Existing fire separation<br>of not less than 30 min is acceptable.</td></tr><tr><td>DE64</td><td>3.6.2.2.</td><td>Existing acceptable where explosion-resistant construction<br>or venting is provided.</td></tr><tr><td>DE65</td><td>3.6.2.6.</td><td>Existing acceptable.</td></tr><tr><td>DE66</td><td>3.6.2.7.(1)</td><td>2 h fire separation<br>acceptable.</td></tr><tr><td>DE67</td><td>3.6.3.1.(1) to (5)</td><td>45 min fire separation<br>acceptable up to 6 storeys.</td></tr><tr><td>DE68</td><td>3.6.3.3.</td><td>(a)<br>Where 2 h fire separation<br>is required, 1 h is acceptable.<br>(b)<br>Where 1 h fire separation<br>is required, 45 min is acceptable.<br>(c)<br>Existing need not comply with Sentence 3.6.3.3.(5).</td></tr><tr><td>DE69</td><td>3.6.4.2.</td><td>Ceiling fire separation<br>need not have a fire-resistance rating<br>where sprinklering,<br>subject to C.A.<br>DE26, of fire compartments<br>on both sides of vertical fire separation<br>is<br>provided and where such fire separation<br>is not required to exceed 1 h.</td></tr><tr><td>DE70</td><td>3.6.4.3.(1)</td><td>Existing to meet flame-spread rating<br>of 25 or to be sprinklered.</td></tr><tr><td>DE71</td><td>3.6.4.4. to 3.6.4.6.</td><td>Existing access acceptable.</td></tr><tr><td>DE72</td><td>3.7.4.</td><td>Where the occupant load<br>is increased by more than 15% above the capacity of the<br>existing facilities, facilities to be added to accommodate the increase.</td></tr><tr><td>DE73</td><td>3.8.1.2.</td><td>Existing accessible entrance acceptable. (See C.A.<br>DE78)<br>Existing curb ramp conforming to Sentence 3.8.3.2.(3) is acceptable.<br>Existing principal entrance acceptable, provided at least one<br>barrier-free<br>entrance is<br>available.</td></tr></tbody></table>\n\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>DE74</td><td>3.8.1.3.(1)</td><td>Existing unobstructed width of 920 mm minimum is acceptable.</td></tr><tr><td>DE75</td><td>3.8.1.3.(4)</td><td>Existing unobstructed space not less than 1 500 mm in width and 1 500 mm in length<br>located not more than 30 m apart is acceptable.</td></tr><tr><td>DE76</td><td>3.8.3.2.(3)(b)</td><td>Existing curb ramp<br>acceptable, provided width not less than 1 200 mm.</td></tr><tr><td>DE77</td><td>3.8.3.3.(1)</td><td>Existing doorway acceptable, provided not less than 800 mm wide.</td></tr><tr><td>DE78</td><td>3.8.3.3.(11)(a)</td><td>Existing distance acceptable, provided not less than 1 200 mm plus the width of any<br>door that swings into the space in the path of travel.</td></tr><tr><td>DE79</td><td>3.8.3.4.(1)(a)</td><td>Existing ramp<br>acceptable, provided not less than 870 mm between handrails.</td></tr><tr><td>DE80</td><td>3.8.3.8.(5)</td><td>Existing grab bar is acceptable.</td></tr><tr><td>DE81</td><td>3.8.3.12.</td><td>Existing universal washroom acceptable.</td></tr><tr><td>DE82</td><td>3.8.3.13.(2)(g)</td><td>Existing grab bar is acceptable.</td></tr><tr><td>DE83</td><td>3.8.3.16.</td><td>Existing drinking fountain conforming to Clauses 3.8.3.16.(2)(a) and (b) acceptable.</td></tr><tr><td>DE84</td><td>4.1.8.</td><td>The requirements under this Subsection do not apply.</td></tr><tr><td>DE85</td><td>6.3.1.1.(2)</td><td>Required outdoor air rates may be provided by mechanical, natural or combination of<br>natural and mechanical means.</td></tr><tr><td>DE86</td><td>6.3.2.3.; 6.3.2.6; 6.3.2.6A.;<br>6.3.2.10.</td><td>Existing acceptable.</td></tr><tr><td>DE87</td><td>6.3.2.9.</td><td>Existing openings, grilles and diffusers acceptable, subject to approval of chief<br>building official.</td></tr><tr><td>DE88</td><td>8.2.1.4.</td><td>Existing clearances acceptable where a sewage system<br>is replaced with another<br>sewage system<br>within the same class and the capacity of the replacement sewage<br>system<br>does not exceed the capacity of the existing sewage system.</td></tr><tr><td>DE89</td><td>8.2.1.4.</td><td>Existing clearances are acceptable where a replacement sewage system<br>requires<br>lesser clearances than those required in Part 8 for the existing sewage system.</td></tr><tr><td>DE90</td><td>9.3.2.1.</td><td>Sound used lumber may be acceptable for reuse without a grade stamp provided<br>that:<br>(a)<br>visual examination shows no excessive weakening by holes, notches, nail splits<br>or other damage,<br>(b)<br>where the grade or species is unknown, the minimum grade shall apply for span<br>table use, and<br>(c)<br>lumber has not been subjected to termite infestation.</td></tr><tr><td>DE91</td><td>9.5.11.2.</td><td>Existing acceptable, provided not less than 600 mm.</td></tr><tr><td>DE92</td><td>9.6.1.2.(2) and (3);<br>9.6.1.4.(1) and (2)</td><td>Existing doors and sidelights being reused or relocated need not conform if identified<br>or protected.</td></tr><tr><td>DE93</td><td>9.6.1.4.(3) and (4);<br>9.8.8.1.(6) and (8)</td><td>Existing acceptable.</td></tr><tr><td>DE94</td><td>9.7.4.</td><td>Existing acceptable.</td></tr></tbody></table>\n\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>DE95</td><td>9.8.1. to 9.8.4.</td><td>Replacement or extension of existing stair systems shall be exempt from the<br>provisions of these Subsections, except that they shall have:<br>(a)<br>a minimum width between wall faces of 700 mm, and<br>(b)<br>a minimum clear height over tread nosing or landing of 1 800 mm.</td></tr><tr><td>DE96</td><td>9.8.3.2.</td><td>Existing acceptable.</td></tr><tr><td>DE97</td><td>9.8.4.3. and 9.8.4.7.</td><td>Existing tapered or spiral stairs acceptable.</td></tr><tr><td>DE98</td><td>9.8.5.1.(2)</td><td>Existing ramps acceptable, where practical.</td></tr><tr><td>DE99</td><td>9.8.7.</td><td>Existing handrails acceptable, unless considered unsafe by chief building official.</td></tr><tr><td>DE100</td><td>9.8.8.</td><td>Existing guards acceptable, unless considered unsafe by<br>chief building official.</td></tr><tr><td>DE101</td><td>9.9.1.1.</td><td>Existing acceptable.</td></tr><tr><td>DE102</td><td>9.9.2.1.(1) to (2.1)</td><td>The following types of exits<br>may also be used:<br>(a)<br>connected balconies, which connect across firewalls, or connect to another exit,<br>or with access to grade,<br>(b)<br>areas of refuge approved by the chief building official, where fire service rescue<br>is possible,<br>or<br>(c)<br>combustible<br>or noncombustible<br>exterior stairways or fire escapes which are<br>protected in accordance with Sentence 3.2.3.13.(2).<br>These may be<br>reconstructed or recreated (as in the case of a heritage building).</td></tr><tr><td>DE103</td><td>9.9.2.1.(3)</td><td>Existing acceptable.</td></tr><tr><td>DE104</td><td>9.9.3.2.</td><td>Existing width of<br>exits<br>acceptable.</td></tr><tr><td>DE105</td><td>9.9.3.3.</td><td>Existing width of public corridors<br>of not less than 965 mm is acceptable.</td></tr><tr><td>DE106</td><td>9.9.3.4.</td><td>Existing clear height of not less than 1 950 mm is acceptable.</td></tr><tr><td>DE107</td><td>9.9.4.2.</td><td>30 min fire separation<br>acceptable.</td></tr><tr><td>DE108</td><td>9.9.5.4.; 9.9.5.5.</td><td>Existing acceptable.</td></tr><tr><td>DE109</td><td>9.9.5.8.</td><td>Existing acceptable provided minimum 45 min fire separation<br>and where explosion<br>resistant construction or venting is provided.</td></tr><tr><td>DE110</td><td>9.9.5.9.</td><td>Existing acceptable, provided that the enclosure has a 45 min fire-resistance rating.</td></tr><tr><td>DE111</td><td>9.9.6.1.</td><td>Existing acceptable.</td></tr><tr><td>DE112</td><td>9.9.6.2.</td><td>Existing clear opening height of not less than 1 950 mm is acceptable.</td></tr><tr><td>DE113</td><td>9.9.6.3.</td><td>Existing door widths are acceptable, provided<br>exit widths comply with C.A.<br>DE99.</td></tr><tr><td>DE114</td><td>9.9.6.5.</td><td>Existing door swings are acceptable.<br>Existing acceptable in public heritage buildings, where approved by chief building<br>official.</td></tr><tr><td>DE115</td><td>9.9.6.6.(1)</td><td>Where<br>exit<br>doors open onto a landing, they shall not extend beyond the face of the<br>first riser.</td></tr><tr><td>DE116</td><td>9.9.6.8.</td><td>Existing functionally operable passage or panic hardware acceptable.</td></tr></tbody></table>\n\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>DE117</td><td>9.9.7.4.</td><td>Maximum area of existing room or suite<br>to be unlimited.</td></tr><tr><td>DE118</td><td>9.9.8.2.(1)</td><td>Existing travel distance acceptable where floor area<br>is sprinklered<br>and provided fire<br>separations<br>comply with Part 9.</td></tr><tr><td>DE119</td><td>9.9.11.3.</td><td>Existing illuminated legible signs are acceptable for<br>exit<br>signs, if approved by chief<br>building official.</td></tr><tr><td>DE120</td><td>9.10.1.3.(8) to (10)</td><td>Existing installations acceptable subject to C.A.<br>DE25 and DE26.</td></tr><tr><td>DE121</td><td>9.10.3.</td><td>Fire-resistance ratings<br>may also be used where they are based on:<br>1.<br>HUD Rehabilitation Guidelines, \"Guideline on Fire Ratings of Archaic Materials<br>and Assemblies\".<br>2.<br>DBR Technical Paper No. 194, \"Fire Endurance of Protected Steel Columns and<br>Beams\".<br>3.<br>DBR Technical Paper No. 207, \"Fire Endurance of Unit Masonry Walls\".<br>4.<br>DBR Technical Paper No. 222, \"Fire Endurance of Light-Framed and<br>Miscellaneous Assemblies\".</td></tr><tr><td>DE122</td><td>9.10.5.1.</td><td>(a)<br>Existing openings in existing wall or ceiling membranes to remain.<br>(b)<br>Existing openings may be<br>moved to another location in the same wall or ceiling,<br>provided the aggregate area of openings does not increase and are not<br>cumulative, and the existing opening is blocked up to provide the same rating as<br>the existing wall or ceiling assembly.</td></tr><tr><td>DE123</td><td>9.10.6.2.</td><td>Existing heavy timber construction<br>acceptable where construction<br>is within 90% of<br>the member sizes listed in Part 3.</td></tr><tr><td>DE124</td><td>9.10.7.</td><td>Existing acceptable for heritage buildings, subject to approval of chief building official.</td></tr><tr><td>DE125</td><td>9.10.8.1.</td><td>Existing 30 min rating acceptable.</td></tr><tr><td>DE126</td><td>9.10.8.2.</td><td>Existing sprinkler systems complying with C.A.<br>DE26 and Sentence 3.2.2.17.(1) are<br>acceptable.</td></tr><tr><td>DE127</td><td>9.10.8.3.</td><td>Existing acceptable, subject to approval of the chief building official.</td></tr><tr><td>DE128</td><td>9.10.8.4.</td><td>Assemblies required to be of noncombustible construction<br>may be supported by<br>combustible construction<br>having at least the same fire-resistance rating<br>as that<br>supported.</td></tr><tr><td>DE129</td><td>9.10.8.8.</td><td>30 min rating acceptable.</td></tr><tr><td>DE130</td><td>9.10.9.7. to 9.10.9.9.; 9.10.9.11.</td><td>Existing acceptable in existing fire separations.</td></tr><tr><td>DE131</td><td>9.10.9.12.(1)</td><td>Ceiling fire separation<br>need not be fire-resistance rated where sprinklering of fire<br>compartments<br>on both sides of vertical fire<br>separation<br>is provided and where such<br>fire separation<br>is not required to exceed 1 h.</td></tr><tr><td>DE132</td><td>9.10.9.13.(2)</td><td>In lieu of the 2 h fire separation, sprinklers may be used in the mercantile occupancy<br>with a 1 h fire separation.</td></tr><tr><td>DE133</td><td>9.10.9.15.</td><td>30 min fire separation<br>acceptable.</td></tr><tr><td>DE134</td><td>9.10.9.17.(1)</td><td>30 min fire separation<br>acceptable.</td></tr><tr><td>DE135</td><td>9.10.9.17.(3)</td><td>Need not comply for<br>mercantile occupancy.</td></tr></tbody></table>\n\n\n#### Table 11.5.1.1.-D/E (Cont'd) Compliance Alternatives for Business/Mercantile Occupancies Forming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>DE136</td><td>9.10.10.3.(1)</td><td>45 min fire separation<br>acceptable.</td></tr><tr><td>DE137</td><td>9.10.13.1.</td><td>Existing functional closures<br>are acceptable subject to C.A.<br>DE8.</td></tr><tr><td>DE138</td><td>9.10.13.2.</td><td>Existing acceptable.</td></tr><tr><td>DE139</td><td>9.10.13.3.</td><td>Existing acceptable, provided that wood door frames are secured with hinge screws<br>going through frame into the stud.</td></tr><tr><td>DE140</td><td>9.10.13.5.</td><td>Existing acceptable.<br>Existing transoms or sidelights located in required fire separations<br>may be retained if<br>wired glass, at least 6 mm thick, is securely fixed to a wood frame of at least 50 mm<br>thickness with steel stops. Operable transoms shall be fixed closed.</td></tr><tr><td>DE141</td><td>9.10.13.6.</td><td>Existing steel door frames acceptable.</td></tr><tr><td>DE142</td><td>9.10.13.7.</td><td>Existing glass block acceptable.</td></tr><tr><td>DE143</td><td>9.10.13.8.</td><td>Existing sizes acceptable.</td></tr><tr><td>DE144</td><td>9.10.13.9.</td><td>Existing operable latches acceptable.</td></tr><tr><td>DE145</td><td>9.10.13.10.(1)</td><td>Existing functionally operable self-closing devices acceptable.</td></tr><tr><td>DE146</td><td>9.10.13.10.(2)</td><td>Existing functionally operable self-closing devices acceptable in \"E\" occupancy.</td></tr><tr><td>DE147</td><td>9.10.13.11.</td><td>Existing operable self-releasing electromagnetic and fusible link hold-open devices<br>acceptable.</td></tr><tr><td>DE148</td><td>9.10.13.12.</td><td>Existing swings acceptable.</td></tr><tr><td>DE149</td><td>9.10.14.4.</td><td>Existing windows.<br>(a)<br>Existing windows in walls may be relocated to another part of the wall, provided<br>the existing opening is blocked up to provide the same fire rating for the wall, and<br>the projection of the new opening, at a right angle to the property line onto<br>another building, lies no closer than 300 mm from a window in such other<br>building, where the \"opposite\" window is less than 2<br>400<br>mm from the opposite<br>new opening, and<br>(b)<br>except relocation of units, to be restricted to the same fire compartment and shall<br>conform to the requirements of Article 3.2.3.14. or 9.10.12.3. where applicable, or<br>(c)<br>where a building<br>does not satisfy the requirements of Subsection 3.2.3. for the<br>amount of openings facing a yard or space that does not have sufficient limiting<br>distance, such existing openings are allowed to be relocated provided:<br>(i)<br>such openings are not increased in size and they are protected with wired<br>glass in steel frames conforming to Sentence 3.1.8.16.(2), or<br>(ii)<br>the building is sprinklered.</td></tr><tr><td>DE150</td><td>9.10.16.2.(1)</td><td>Where balloon framing is exposed during renovation, fire blocks shall be provided.</td></tr><tr><td>DE151</td><td>9.10.18.</td><td>(a)<br>Subject to approval by the chief building<br>official, existing fire alarm system may<br>remain where the fire safety plan (as described in the Fire Code made under the<br>Fire Protection and Prevention Act, 1997) for the building<br>addresses the intent of<br>3.2.4. (i.e. \"stage' system, electrical supervision, detection as required, Fire<br>Department connection, and emergency power supply), and<br>(b)<br>extension of an existing system must ensure continuity and compatibility, and<br>integrity of the system.</td></tr></tbody></table>\n\n\n#### Table 11.5.1.1.-D/E (Cont'd) Compliance Alternatives for Business/Mercantile Occupancies Forming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>DE152</td><td>9.10.20.</td><td>Existing access acceptable.</td></tr><tr><td>DE153</td><td>9.18.2.</td><td>Existing access acceptable.</td></tr><tr><td>DE154</td><td>9.18.3.</td><td>Existing vents and ventilation acceptable.</td></tr><tr><td>DE155</td><td>9.19.</td><td>Existing acceptable.</td></tr><tr><td>DE156</td><td>9.20.2.2.</td><td>Used masonry may be reused for patching and filling openings to match adjacent<br>work. Used interior brick may not be used for exterior applications.</td></tr><tr><td>DE157</td><td>9.20.3.</td><td>Archaic mortars may be used to match existing jointing.</td></tr><tr><td>DE158</td><td>9.20.4.1.</td><td>Sound jointing techniques may be employed to match existing archaic joints.</td></tr><tr><td>DE159</td><td>9.20.12.1.</td><td>Corbelling may be constructed to match existing or original details, provided that it is<br>structurally adequate for the proposed use.</td></tr><tr><td>DE160</td><td>9.21.</td><td>Existing acceptable, provided the products of combustion are safely vented and<br>provided no fire hazard is created.</td></tr><tr><td>DE161</td><td>9.22.1. to 9.22.7.</td><td>Sound period materials, designs and techniques may be employed in recreated<br>fireplaces, provided no fire hazard is created.<br>Existing need not comply with Article<br>9.22.1.4.</td></tr><tr><td>DE162</td><td>9.23.</td><td>Existing acceptable.</td></tr><tr><td>DE163</td><td>9.24.</td><td>Existing acceptable.</td></tr><tr><td>DE164</td><td>9.26.</td><td>Existing acceptable, except when removing and replacing shingles, comply with eave<br>protection requirements in Subsection 9.26.5.</td></tr><tr><td>DE165</td><td>9.27.</td><td>Existing acceptable.</td></tr><tr><td>DE166</td><td>9.28.</td><td>All replacement or recreation of existing stucco may be compatible with the existing<br>materials and application.</td></tr><tr><td>DE167</td><td>9.29.4.</td><td>Existing acceptable. All replacement or recreation of existing plaster may be<br>compatible with the existing materials and application.</td></tr><tr><td>DE168</td><td>9.33.5.3.</td><td>Sound, used or antique appliances<br>are acceptable, provided that:<br>(a)<br>visual examination shows no excessive weakening by corrosion or other<br>damage,<br>(b)<br>no structural parts are missing,<br>(c)<br>no cracks are present in the components intended to support the appliance<br>or<br>enclose the fire, and<br>(d)<br>loading and ash removal door latches and hinges hold the door closed.</td></tr><tr><td>DE169</td><td>9.38.</td><td>Sound used materials shall be acceptable for reuse, subject to the following<br>limitations:<br>(a)<br>visual examination shows no excessive weakening by holes, notches, nail splits<br>or other damage, and<br>(b)<br>logs have not been subjected to termite infestation.</td></tr></tbody></table>\n\n\n## Table 11.5.1.1.-F Compliance Alternatives for Industrial Occupancies Forming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>F1</td><td>3.1.4.7.</td><td>Existing heavy timber construction<br>acceptable where construction<br>is within 90% of<br>member sizes listed in Part 3.</td></tr><tr><td>F2</td><td>3.1.5.2. to 3.1.5.4.; 3.1.5.8.</td><td>Existing acceptable.</td></tr><tr><td>F3</td><td>3.1.5.9. to 3.1.5.12.</td><td>Except for exposed foamed plastics, existing acceptable for \"F2\" and \"F3\"<br>occupancies. To match existing, materials may be added from on or off site.</td></tr><tr><td>F4</td><td>3.1.5.18. to 3.1.5.20.; 3.1.5.25.</td><td>Existing acceptable.</td></tr><tr><td>F5</td><td>3.1.7.1.</td><td>Fire-resistance ratings<br>may also be used where they are based on:<br>1.<br>HUD Rehabilitation Guidelines, \"Guideline on Fire Ratings of Archaic Materials<br>and Assemblies\".<br>2.<br>DBR Technical Paper No. 194, \"Fire Endurance of Protected Steel Columns and<br>Beams\".<br>3.<br>DBR Technical Paper No. 207, \"Fire Endurance of Unit Masonry Walls\".<br>4.<br>DBR Technical Paper No. 222, \"Fire Endurance of Light-Framed and<br>Miscellaneous Assemblies\".</td></tr><tr><td>F6</td><td>3.1.7.5.(3)</td><td>Existing assemblies required to be of noncombustible construction<br>may be supported<br>by combustible construction<br>having at least the same fire-resistance rating<br>as that<br>supported.</td></tr><tr><td>F7</td><td>3.1.8.1.(2); 3.1.8.6.</td><td>Existing functional closures<br>are acceptable and may be relocated within the same<br>existing fire separation.</td></tr><tr><td>F8</td><td>3.1.8.5.(2)</td><td>(a)<br>Existing functional and sound doors in existing buildings<br>that are either hollow<br>metal or kalamein and containing wired glass at least 6 mm thick and conforming<br>to Sentence 3.1.8.16.(2) are permitted in lieu of doors not required to exceed<br>45<br>min,<br>(b)<br>all existing functional and sound hollow metal or kalamein doors which carry<br>existing 1.5 h labels are acceptable in lieu of current 1.5 h labels and may contain<br>wired glass panels not exceeding 0.0645 m², at least 6 mm thick and conforming<br>to Sentence 3.1.8.16.(2), and<br>(c)<br>every fire door, window assembly or glass block used as a closure<br>in a required<br>fire separation<br>shall be installed in conformance with good engineering practice.</td></tr><tr><td>F9</td><td>3.1.8.7., 3.1.8.8. and 3.1.8.10.</td><td>Fire dampers<br>or fire stop flaps<br>are not required to be installed in existing ducts at<br>penetrations of existing fire separations.</td></tr><tr><td>F10</td><td>3.1.8.12.(1)</td><td>For existing unlabelled<br>doors in existing buildings, at least 45 mm solid core wood or<br>metal clad are acceptable.</td></tr><tr><td>F11</td><td>3.1.8.13.(1)</td><td>Existing functionally operable devices acceptable for \"F2\" and \"F3\" occupancies.</td></tr><tr><td>F12</td><td>3.1.8.15.</td><td>Existing functionally operable latching devices, excluding draw bolts, are acceptable.</td></tr><tr><td>F13</td><td>3.1.8.16.</td><td>Existing transoms or sidelights located in required fire separations<br>may be retained if<br>wired glass, at least 6 mm thick, is securely fixed to a wood frame of at least 50 mm<br>thickness with steel stops. Operable transoms shall be fixed closed.</td></tr><tr><td>F14</td><td>3.1.8.17. to 3.1.8.19.</td><td>Existing acceptable.</td></tr></tbody></table>\n\n\n#### Table 11.5.1.1.-F (Cont'd) Compliance Alternatives for Industrial Occupancies Forming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>F15</td><td>3.1.11.</td><td>Where the concealed space is being materially altered, smoke or heat detection in<br>that space in lieu of fire blocks<br>and tied into fire alarm system is acceptable.</td></tr><tr><td>F16</td><td>3.2.3.</td><td>Existing need not comply with Article 3.2.3.18. for \"F2\" occupancy.<br>Existing windows.<br>(a)<br>Existing windows in walls may be relocated to another part of the wall, provided<br>the existing opening is blocked up to provide the same fire rating for the wall, and<br>the projection of the new opening, at a right angle to the property line onto<br>another building, lies not closer than 300 mm from a window in such other<br>building, where the \"opposite\" window is less than 2 400 mm from the opposite<br>new opening, and<br>(b)<br>except relocation of units, shall be restricted to the same fire compartment<br>and<br>shall conform to the requirements of Article 3.2.3.16. or 9.10.12.3. where<br>applicable, or<br>(c)<br>where a<br>building<br>does not satisfy the requirements of Subsection 3.2.3. for the<br>amount of openings facing a yard or space that does not have sufficient limiting<br>distance, such existing openings are allowed to be relocated provided:<br>(i)<br>such openings are not increased in size and they are protected with wired<br>glass in steel frames conforming to Sentence 3.1.8.16.(2), or<br>(ii)<br>the building<br>is sprinklered.</td></tr><tr><td>F17</td><td>3.2.3.6.(3)</td><td>Existing roof soffit projections acceptable.</td></tr><tr><td>F18</td><td>3.2.3.17.</td><td>Need not comply for \"F2\" occupancy.</td></tr><tr><td>F19</td><td>3.2.4.</td><td>(a)<br>Existing fire alarm system may remain except that Article 3.2.4.5. does not apply<br>where the fire safety plan (as described in the Fire Code made under the Fire<br>Protection and Prevention Act, 1997) for the building<br>addresses the intent of<br>Subsection 3.2.4. (i.e. \"stage\" system, electrical supervision, detection as<br>required, Fire Department connection, and emergency power supply), and<br>(b)<br>extension of an existing system must ensure continuity and compatibility, and<br>integrity of the system.</td></tr><tr><td>F20</td><td>3.2.4.8.(2)(e)</td><td>Does not apply to existing installations in buildings.</td></tr><tr><td>F21</td><td>3.2.4.9.(5)(c)</td><td>Does not apply to existing installations in buildings.</td></tr><tr><td>F22</td><td>3.2.5.1; 3.2.5.2.</td><td>Existing acceptable.</td></tr><tr><td>F23</td><td>3.2.5.3.</td><td>Existing access acceptable.</td></tr><tr><td>F24</td><td>3.2.5.4. to 3.2.5.6.</td><td>Existing acceptable provided the building<br>is sprinklered throughout.</td></tr><tr><td>F25</td><td>3.2.5.7.</td><td>Does not apply, except where a change in major occupancy<br>occurs from a lesser<br>hazard index.</td></tr><tr><td>F26</td><td>3.2.5.8. to 3.2.5.11.</td><td>Does not apply to buildings<br>6 storeys<br>and less of \"F2\" and \"F3\" occupancies. Does<br>not apply to sprinklered<br>buildings.</td></tr><tr><td>F27</td><td>3.2.5.12.</td><td>Existing sprinkler systems in existing buildings<br>that do not conform to NFPA 13 may<br>be altered, added to, or extended from the existing system without complying with<br>NFPA 13, provided the system is operational and adequate with respect to coverage,<br>water supply and controls, and provided the system is evaluated by a qualified<br>designer.</td></tr></tbody></table>\n\n\n\n<h4 class=\"table-title\">Table 11.5.1.1.-F (Cont'd) Compliance Alternatives for Industrial Occupancies</h4>\n\nForming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>F28</td><td>3.3.1.4.(1)</td><td>30 min is acceptable to separate public<br>corridors<br>or exits<br>in buildings<br>not exceeding 6<br>storeys<br>in building<br>height, except that 45 min is required for exits<br>in buildings<br>exceeding 3 storeys<br>in building<br>height.<br>Except for exits, no rating required where floor areas<br>are sprinklered.</td></tr><tr><td>F29</td><td>3.3.1.5.(1)(c); Tables 3.3.1.5A<br>and 3.3.1.5B</td><td>For \"F2\" and \"F3\" occupancies<br>in Column 2, maximum area of room or suite<br>to be<br>unlimited.</td></tr><tr><td>F30</td><td>3.3.1.9.</td><td>Existing width of public corridors<br>of not less than 914 mm is acceptable.</td></tr><tr><td>F31</td><td>3.3.1.9.(11) and (12)</td><td>Need not comply where connected balcony or area of refuge is provided in<br>compliance with C.A.<br>F38.</td></tr><tr><td>F32</td><td>3.3.1.11.; 3.3.1.12.</td><td>Existing door swings may remain in heritage buildings, existing or being restored,<br>with no change in major occupancy<br>and with occupant load<br>no greater than 100.</td></tr><tr><td>F33</td><td>3.3.1.13.</td><td>Existing doors acceptable, provided not less than 600 mm wide.</td></tr><tr><td>F34</td><td>3.3.1.16.</td><td>Existing curved or spiral stairs acceptable.</td></tr><tr><td>F35</td><td>3.3.1.20.</td><td>Existing stained, etched, bevelled, leaded or figured glass acceptable.</td></tr><tr><td>F36</td><td>3.3.5.4.(2), (3) and (5)</td><td>Existing acceptable.</td></tr><tr><td>F37</td><td>3.3.5.6.; 3.3.5.7.</td><td>Need not comply where a gasketed door and self closer are provided in the existing<br>fire separation.</td></tr><tr><td>F38</td><td>3.4.1.4.</td><td>For \"F2\" and \"F3\" occupancies, the following types of exits<br>may also be used for<br>buildings<br>not over 6 storeys<br>in building<br>height:<br>(a)<br>connected balconies, which connect across firewalls, or connect to another exit,<br>or with access to grade,<br>(b)<br>areas of refuge where fire service rescue is possible and that comply with<br>Measure<br>L in Sentences (4) to (10), (18) and Clauses (20)(a), (b) and (d) in<br>MMAH Supplementary Standard SB-4, \"Measures for Fire Safety in High<br>Buildings\".</td></tr><tr><td>F39</td><td>3.4.1.8.</td><td>Existing stained, etched, bevelled, leaded or figured glass acceptable.</td></tr><tr><td>F40</td><td>3.4.2.5.(1)</td><td>For \"F2\" and \"F3\" occupancies, existing travel distance acceptable where the floor<br>area<br>is sprinklered.</td></tr><tr><td>F41</td><td>3.4.3.2.(8)</td><td>For \"F2\" and \"F3\" occupancies, existing width of exits<br>acceptable provided the<br>occupant load<br>is not more than 15% above the exit<br>capacity.</td></tr><tr><td>F42</td><td>3.4.3.3.</td><td>Existing acceptable.</td></tr><tr><td>F43</td><td>3.4.3.4.</td><td>Existing headroom clearance of not less than 1 980 mm is acceptable.</td></tr><tr><td>F44</td><td>3.4.4.1.</td><td>Fire separations<br>of exits<br>permitted in buildings:<br>(a) 30 min, up to 3 storeys<br>in building height,<br>(b) 45 min, up to 6 storeys<br>in building height,<br>(c) 1 h, over 6 storeys<br>in building height.</td></tr><tr><td>F45</td><td>3.4.4.4.(8)</td><td>Existing washrooms opening directly into exit<br>stairwell shall be separated from exit<br>stairwell by 45 min closure.</td></tr><tr><td>F46</td><td>3.4.5.1.(2) and (9)</td><td>Existing illuminated legible exit<br>signs are acceptable.</td></tr><tr><td>F47</td><td>3.4.6.1.</td><td>Existing acceptable.</td></tr><tr><td></td><td></td><td></td></tr></tbody></table>\n\n\n#### Table 11.5.1.1.-F (Cont'd) Compliance Alternatives for Industrial Occupancies Forming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>F48</td><td>3.4.6.2.</td><td>Existing acceptable, if visually apparent.</td></tr><tr><td>F49</td><td>3.4.6.3.(1)</td><td>Existing acceptable with rise no greater than 3.7 m.</td></tr><tr><td>F50</td><td>3.4.6.4.(1) to (3)</td><td>Existing acceptable.</td></tr><tr><td>F51</td><td>3.4.6.4. (4) and (5)</td><td>Existing acceptable.</td></tr><tr><td>F52</td><td>3.4.6.5. (3) to (13)</td><td>Existing acceptable.</td></tr><tr><td>F53</td><td>3.4.6.6.(1) to (5)</td><td>Existing acceptable.</td></tr><tr><td>F54</td><td>3.4.6.7.(1)</td><td>Existing acceptable.</td></tr><tr><td>F55</td><td>3.4.6.8.</td><td>Existing acceptable.</td></tr><tr><td>F56</td><td>3.4.6.9.</td><td>Existing acceptable.</td></tr><tr><td>F57</td><td>3.4.6.10.(2) to (6)</td><td>Existing acceptable.</td></tr><tr><td>F58</td><td>3.4.6.11.(1) to (3)</td><td>Existing acceptable.</td></tr><tr><td>F59</td><td>3.4.6.12.</td><td>For \"F2\" and \"F3\" occupancies, existing acceptable in<br>public heritage<br>buildings<br>or a<br>change in occupancy<br>with no increase in occupant load.</td></tr><tr><td>F60</td><td>3.4.6.13.; 3.4.6.14.</td><td>Existing acceptable.</td></tr><tr><td>F61</td><td>3.4.6.16.</td><td>Existing functionally operable panic hardware acceptable.</td></tr><tr><td>F62</td><td>3.4.7.2.</td><td>Combustible<br>fire escapes which are protected from fire in accordance with Sentence<br>3.2.3.13.(2) are permitted or may be reconstructed or recreated (as in the case of a<br>heritage building).</td></tr><tr><td>F63</td><td>3.5.1.</td><td>Existing acceptable, except where building<br>classified under Subsection 3.2.6. and<br>except where existing elevators are \"open\" type.</td></tr><tr><td>F64</td><td>3.6.2.1.(7)</td><td>45 min fire separation<br>acceptable.</td></tr><tr><td>F65</td><td>3.6.2.2.</td><td>Existing acceptable where explosion-resistant construction<br>or venting is provided.</td></tr><tr><td>F66</td><td>3.6.2.6.</td><td>Existing acceptable.</td></tr><tr><td>F67</td><td>3.6.2.7.(1)</td><td>2 h fire separation<br>acceptable.</td></tr><tr><td>F68</td><td>3.6.3.1.(1) to (5)</td><td>45 min fire separation<br>acceptable up to 6 storeys.</td></tr><tr><td>F69</td><td>3.6.3.3.</td><td>(a)<br>Where 2 h fire separation<br>is required, 1 h is acceptable.<br>(b)<br>Where 1 h fire separation<br>is required, 45 min is acceptable.<br>(c)<br>Existing need not comply with Sentences 3.6.3.3.(4) and (5).</td></tr><tr><td>F70</td><td>3.6.4.2.</td><td>Ceiling fire separation<br>need not be fire-resistance rated where sprinklering, subject to<br>C.A.<br>F26, of fire compartments<br>on both sides of vertical fire separation<br>is provided<br>and where such fire separation<br>is not required to exceed 1 h.</td></tr><tr><td>F71</td><td>3.6.4.3.(1)</td><td>Existing to meet flame-spread rating<br>of 25 or to be sprinklered.</td></tr><tr><td>F72</td><td>3.6.4.4. to 3.6.4.6.</td><td>Existing access acceptable.</td></tr><tr><td></td><td></td><td></td></tr></tbody></table>\n\n\n\n<h4 class=\"table-title\">Table 11.5.1.1.-F (Cont'd) Compliance Alternatives for Industrial Occupancies</h4>\n\nForming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>F74</td><td>3.8.1.2.</td><td>Existing accessible entrance acceptable. (See C.A.<br>F780)<br>Existing curb ramp conforming to Sentence 3.8.3.2.(3) is acceptable.<br>Existing principal entrance acceptable, provided at least one<br>barrier-free<br>entrance is<br>available.</td></tr><tr><td>F75</td><td>3.8.1.3.(1)</td><td>Existing unobstructed width of 920 mm minimum is acceptable.</td></tr><tr><td>F76</td><td>3.8.1.3.(4)</td><td>Existing unobstructed space not less than 1 500 mm in width and 1 500 mm in length<br>located not more than 30 m apart is acceptable.</td></tr><tr><td>F77</td><td>3.8.3.2.(3)(b)</td><td>Existing curb ramp<br>acceptable, provided width not less than 1 200 mm.</td></tr><tr><td>F78</td><td>3.8.3.3.(1)</td><td>Existing doorway acceptable, provided not less than 800 mm wide.</td></tr><tr><td>F79</td><td>3.8.3.3.(11)(a)</td><td>Existing distance acceptable, provided not less than 1 200 mm plus the width of any<br>door that swings into the space in the path of travel.</td></tr><tr><td>F80</td><td>3.8.3.4.(1)(a)</td><td>Existing<br>ramp<br>acceptable, provided not less than 870 mm between handrails.</td></tr><tr><td>F81</td><td>3.8.3.8.(5)</td><td>Existing grab bar is acceptable.</td></tr><tr><td>F82</td><td>3.8.3.12.</td><td>Existing universal washroom acceptable.</td></tr><tr><td>F83</td><td>3.8.3.13.(2) (g)</td><td>Existing grab bar is acceptable.</td></tr><tr><td>F84</td><td>3.8.3.16.</td><td>Existing drinking fountain conforming to Clauses 3.8.3.16.(2)(a) and (b) acceptable.</td></tr><tr><td>F85</td><td>4.1.8.</td><td>The requirements under this Subsection do not apply.</td></tr><tr><td>F86</td><td>6.3.1.3.(1), (3) and (4)</td><td>Storage garages<br>with a total capacity of fewer than 20 motor vehicles need not have<br>mechanical ventilating systems if the downward slope of the floor to the outside door<br>is 1 in 120 and the garage floor is above outside ground level.</td></tr><tr><td>F87</td><td>6.3.2.3.; 6.3.2.6.; 6.3.2.6A.;<br>6.3.2.10</td><td>Existing acceptable for \"F2\" and \"F3\" occupancies.</td></tr><tr><td>F88</td><td>6.3.2.9.</td><td>Existing openings, grilles and diffusers acceptable.</td></tr><tr><td>F89</td><td>8.2.1.4.</td><td>Existing clearances acceptable where a sewage system<br>is replaced with another<br>sewage system<br>within the same class and the capacity of the replacement sewage<br>system<br>does not exceed the capacity of the existing sewage system.</td></tr><tr><td>F90</td><td>8.2.1.4.</td><td>Existing clearances are acceptable where a replacement sewage system<br>requires<br>lesser clearances than those required in Part 8 for the existing sewage system.</td></tr><tr><td>F91</td><td>9.3.2.1.</td><td>Sound used lumber is acceptable for reuse without a grade stamp provided that:<br>(a)<br>visual examination shows no excessive weakening by holes, notches, nail splits<br>or other damage,<br>(b)<br>where the grade or species is unknown, the minimum grade shall apply for span<br>table use, and<br>(c)<br>lumber has not been subjected to termite infestation.</td></tr><tr><td>F92</td><td>9.5.11.2.</td><td>Existing acceptable, provided not less than 600 mm.</td></tr><tr><td>F93</td><td>9.6.1.2.(2) and (3);<br>9.6.1.4.(1) and (2)</td><td>Existing doors and sidelights being reused or relocated need not conform if identified<br>or protected.</td></tr><tr><td>F94</td><td>9.6.1.4.(3) and (4);<br>9.8.8.1.(6) and (8)</td><td>Existing barriers acceptable.</td></tr></tbody></table>\n\n\n#### Table 11.5.1.1.-F (Cont'd) Compliance Alternatives for Industrial Occupancies Forming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>F95</td><td>9.7.4.</td><td>Existing acceptable.</td></tr><tr><td>F96</td><td>9.8.1. to 9.8.4.</td><td>Replacement or extension of existing stair systems shall be exempt from the<br>provisions of these Articles, except that they shall have:<br>(a)<br>a minimum width between wall faces of 700 mm, and<br>(b)<br>a minimum clear height over tread nosing or landing of 1 800 mm.</td></tr><tr><td>F97</td><td>9.8.4.3. and 9.8.4.7.</td><td>Existing tapered or spiral stairs acceptable.</td></tr><tr><td>F98</td><td>9.8.5.1.(2)</td><td>Existing ramps acceptable, where practical.</td></tr><tr><td>F99</td><td>9.8.7.</td><td>Existing handrails acceptable, unless considered unsafe by chief<br>building<br>official.</td></tr><tr><td>F100</td><td>9.8.8.</td><td>Existing guards<br>acceptable, unless considered unsafe by chief building official.</td></tr><tr><td>F101</td><td>9.8.9.6.(4)</td><td>Existing acceptable.</td></tr><tr><td>F102</td><td>9.9.1.1.</td><td>Existing acceptable.</td></tr><tr><td>F103</td><td>9.9.2.1.(1) to (3.1)</td><td>The following types of exits<br>may also be used:<br>(a)<br>connected balconies, which connect across firewalls, or connect to another exit,<br>or with access to grade,<br>(b)<br>areas of refuge approved by the chief<br>building official, where fire service rescue<br>is possible, or<br>(c)<br>combustible<br>or noncombustible<br>exterior stairways or fire escapes which are<br>protected in accordance with Sentence 3.2.3.13.(2).<br>These may be<br>reconstructed or recreated (as in the case of a heritage building).</td></tr><tr><td>F104</td><td>9.9.2.1.(3)</td><td>Existing acceptable.</td></tr><tr><td>F105</td><td>9.9.3.2.</td><td>Existing width of exits<br>acceptable.</td></tr><tr><td>F106</td><td>9.9.3.3.</td><td>Existing width of public corridors<br>of not less than 965 mm is acceptable.</td></tr><tr><td>F107</td><td>9.9.3.4.</td><td>Existing clear height of not less than 1 950 mm is acceptable.</td></tr><tr><td>F108</td><td>9.9.4.2.</td><td>30 min fire separation<br>acceptable.</td></tr><tr><td>F109</td><td>9.9.5.4.</td><td>Existing acceptable.</td></tr><tr><td>F110</td><td>9.9.5.8.</td><td>Existing acceptable provided minimum 45 min fire separation<br>and where explosion<br>resistant construction<br>or venting is provided.</td></tr><tr><td>F111</td><td>9.9.5.9.</td><td>Existing acceptable, provided that the enclosure has a 45 min fire-resistance<br>rating.</td></tr><tr><td>F112</td><td>9.9.6.3.</td><td>Existing door widths are acceptable, provided exit<br>widths comply with C.A.<br>F107.</td></tr><tr><td>F113</td><td>9.9.6.5.</td><td>Existing door swings acceptable.<br>Existing acceptable in public<br>heritage<br>buildings, where approved by chief building<br>official.</td></tr><tr><td>F114</td><td>9.9.6.6.(1)</td><td>Where exit<br>doors open onto a landing, such doors shall not extend beyond the face<br>of the first riser.</td></tr><tr><td>F115</td><td>9.9.6.8.</td><td>Existing functionally operable passage or panic hardware acceptable.</td></tr><tr><td>F116</td><td>9.9.7.4.</td><td>Maximum area of existing room or suite<br>does not apply.</td></tr><tr><td></td><td></td><td></td></tr></tbody></table>\n\n\n\n<h4 class=\"table-title\">Table 11.5.1.1.-F (Cont'd) Compliance Alternatives for Industrial Occupancies</h4>\n\nForming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>F117</td><td>9.9.8.2.(1)</td><td>Existing travel distance acceptable where floor area<br>is sprinklered<br>and provided fire<br>separations<br>comply with Part 9.</td></tr><tr><td>F118</td><td>9.9.11.3.</td><td>Existing illuminated legible signs are acceptable for exit<br>signs, if approved by chief<br>building official.</td></tr><tr><td>F119</td><td>9.10.1.3.(8) to (10)</td><td>Existing acceptable subject to C.A.<br>F26 and F27.</td></tr><tr><td>F120</td><td>9.10.3.</td><td>Fire-resistance ratings<br>may also be used where they are based on:<br>1.<br>HUD Rehabilitation Guidelines, \"Guideline on Fire Ratings of Archaic Materials<br>and Assemblies\".<br>2.<br>DBR Technical Paper No. 194, \"Fire Endurance of Protected Steel Columns and<br>Beams\".<br>3.<br>DBR Technical Paper No. 207, \"Fire Endurance of Unit Masonry Walls\".<br>4.<br>DBR Technical Paper No. 222. Fire Endurance of Light-Framed and<br>Miscellaneous Assemblies\".</td></tr><tr><td>F121</td><td>9.10.5.1.</td><td>Existing openings in existing wall or ceiling membranes to remain.<br>Existing openings may be moved to another location in the same wall or ceiling,<br>provided the aggregate area of openings does not increase and are not cumulative,<br>and the existing opening is blocked up to provide the same rating as the existing wall<br>or ceiling assembly.</td></tr><tr><td>F122</td><td>9.10.6.2.</td><td>Existing heavy timber construction<br>acceptable where construction<br>is within 90% of<br>the member sizes listed in Part 3.</td></tr><tr><td>F123</td><td>9.10.7.</td><td>Existing acceptable for heritage buildings, subject to approval of chief building<br>official.</td></tr><tr><td>F124</td><td>9.10.8.1.</td><td>Existing 30 min rating acceptable.</td></tr><tr><td>F125</td><td>9.10.8.2.</td><td>Existing sprinkler systems complying with C.A.<br>F26 and Sentence 3.2.2.17.(1) are<br>acceptable.</td></tr><tr><td>F126</td><td>9.10.8.3.</td><td>Existing acceptable, subject to approval of chief building official.</td></tr><tr><td>F127</td><td>9.10.8.4.</td><td>Assemblies required to be of noncombustible construction<br>may be supported by<br>combustible construction<br>having at least the same fire-resistance rating as<br>that<br>supported.</td></tr><tr><td>F128</td><td>9.10.8.8.</td><td>30 min rating acceptable.</td></tr><tr><td>F129</td><td>9.10.9.7. to 9.10.9.9.; 9.10.9.11.</td><td>Existing acceptable in existing fire separations.</td></tr><tr><td>F130</td><td>9.10.9.12.(1)</td><td>Ceiling fire separation<br>need not be fire-resistance rated<br>where sprinklering of fire<br>compartments<br>on both sides of vertical fire separation<br>is provided and where such<br>fire separation<br>is not required to exceed 1 h.</td></tr><tr><td>F131</td><td>9.10.9.13.(2)</td><td>In lieu of the 2 h fire separation, sprinklers may be used in the medium-hazard<br>industrial occupancy<br>with a 1 h fire<br>separation.</td></tr><tr><td>F132</td><td>9.10.9.15.; 9.10.9.17.(1)</td><td>30 min fire separation<br>acceptable.</td></tr><tr><td>F133</td><td>9.10.10.3.(1)</td><td>45 min fire separation<br>acceptable.</td></tr><tr><td>F134</td><td>9.10.13.1.</td><td>Existing functional closures<br>are acceptable subject to C.A.<br>F8.</td></tr><tr><td></td><td></td><td></td></tr></tbody></table>\n\n\n#### Table 11.5.1.1.-F (Cont'd) Compliance Alternatives for Industrial Occupancies Forming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>F135</td><td>9.10.13.2.</td><td>Existing acceptable.</td></tr><tr><td>F136</td><td>9.10.13.3.</td><td>Existing acceptable, provided that wood door frames are secured with hinge screws<br>going through frame into the stud.</td></tr><tr><td>F137</td><td>9.10.13.5.</td><td>Existing wired glass acceptable.<br>Existing transoms or sidelights located in required fire separations<br>may be retained if<br>wired glass, at least 6 mm thick, is securely fixed to a wood frame of at least 50 mm<br>thickness with steel stops. Operable transoms shall be fixed closed.</td></tr><tr><td>F138</td><td>9.10.13.6.</td><td>Existing steel door frames acceptable.</td></tr><tr><td>F139</td><td>9.10.13.7.</td><td>Existing glass block acceptable.</td></tr><tr><td>F140</td><td>9.10.13.8.</td><td>Existing sizes acceptable.</td></tr><tr><td>F141</td><td>9.10.13.9.</td><td>Existing operable latches acceptable.</td></tr><tr><td>F142</td><td>9.10.13.10.(1)</td><td>Existing functionally operable self-closing devices acceptable.</td></tr><tr><td>F143</td><td>9.10.13.11.</td><td>Existing operable self-releasing electromagnetic and fusible link hold-open devices<br>acceptable.</td></tr><tr><td>F144</td><td>9.10.13.12.</td><td>Existing swings acceptable.</td></tr><tr><td>F145</td><td>9.10.14.4.</td><td>Existing windows.<br>(a)<br>Existing windows in walls may be relocated to another part of the wall, provided<br>the existing opening is blocked up to provide the same fire rating for the wall, and<br>the projection of the new opening, at a right angle to the property line onto<br>another building, lies no closer than 300 mm from a window in such other<br>building, where the \"opposite\" window is less than 2 400 mm from the opposite<br>new opening, and<br>(b)<br>except relocation of units, to be restricted to the same fire compartment and shall<br>conform to the requirements of Article 3.2.3.14. or 9.10.12.3. where applicable, or<br>(c)<br>where a building<br>does not satisfy the requirements of Subsection 3.2.3. for the<br>amount of openings facing a yard or space that does not have sufficient limiting<br>distance, such existing openings are allowed to be relocated provided:<br>(i)<br>such openings are not increased in size and they are protected with wired<br>glass in steel frames conforming to Sentence 3.1.8.16.(2), or<br>(ii)<br>the building is sprinklered.</td></tr><tr><td>F146</td><td>9.10.16.2.(1)</td><td>Where balloon framing is exposed during renovation, fire blocks<br>shall be provided.</td></tr><tr><td>F147</td><td>9.10.18.</td><td>(a)<br>Subject to approval by the chief building<br>official, existing fire alarm system may<br>remain where the fire safety plan (as described in the Fire Code made under the<br>Fire Protection and Prevention Act, 1997) for the building<br>addresses the intent of<br>Subsection 3.2.4. (i.e. \"stage\" system, electrical supervision, detection as<br>required, Fire Department connection, and emergency power supply), and<br>(b)<br>extension of an existing system must ensure continuity and compatibility, and<br>integrity of the system.</td></tr></tbody></table>\n\n\n#### Table 11.5.1.1.-F (Cont'd) Compliance Alternatives for Industrial Occupancies Forming Part of Article 11.5.1.1.\n\n\n<table class=\"obc-table\"><thead><tr><th>C.A.<br>Number</th><th>Division B Requirements</th><th>Compliance Alternative</th></tr></thead><tbody><tr><td>F148</td><td>9.10.20.</td><td>Existing access acceptable.</td></tr><tr><td>F149</td><td>9.18.2.</td><td>Existing access acceptable.</td></tr><tr><td>F150</td><td>9.18.3.</td><td>Existing vents and ventilation acceptable.</td></tr><tr><td>F151</td><td>9.19.2.1.</td><td>Existing access acceptable.</td></tr><tr><td>F152</td><td>9.20.2.2.</td><td>Used masonry may be reused for patching and filling openings to match adjacent<br>work. Used interior brick may not be used for exterior applications.</td></tr><tr><td>F153</td><td>9.20.3.</td><td>Archaic mortars may be used to match existing jointing.</td></tr><tr><td>F154</td><td>9.20.4.1.</td><td>Sound jointing techniques may be employed to match existing archaic joints.</td></tr><tr><td>F155</td><td>9.20.12.1.</td><td>Corbelling may be constructed to match existing or original details, provided that it is<br>structurally adequate for the proposed use.</td></tr><tr><td>F156</td><td>9.21.</td><td>Existing acceptable, provided the products of combustion are safely vented and<br>provided no fire hazard is created.</td></tr><tr><td>F157</td><td>9.22.1. to 9.22.7.</td><td>Sound period materials, designs and techniques may be employed in recreated<br>fireplaces provided no fire hazard is created.</td></tr><tr><td></td><td></td><td>Existing need not comply with Article 9.22.1.4.</td></tr><tr><td>F158</td><td>9.23.</td><td>Existing acceptable.</td></tr><tr><td>F159</td><td>9.24.</td><td>Existing acceptable.</td></tr><tr><td>F160</td><td>9.26.</td><td>Existing acceptable.</td></tr><tr><td>F161</td><td>9.27.</td><td>Existing acceptable.</td></tr><tr><td>F162</td><td>9.28.</td><td>All replacement or recreation of existing stucco may be compatible with the existing<br>materials and application.</td></tr><tr><td>F163</td><td>9.29.4.</td><td>Existing acceptable. All replacement or recreation of existing plaster may be<br>compatible with the existing materials and application.</td></tr><tr><td>F164</td><td>9.33.5.3.</td><td>Sound, used or antique appliances<br>are acceptable, provided that:<br>(a)<br>visual examination shows no excessive weakening by corrosion or other<br>damage,<br>(b)<br>no structural parts are missing,<br>(c)<br>no cracks are present in the components intended to support the appliance<br>or<br>enclose the fire, and<br>(d)<br>loading and ash removal door latches and hinges hold the door closed.</td></tr><tr><td>F165</td><td>9.38.</td><td>Sound used materials shall be acceptable for reuse, subject to the following<br>limitations:<br>(a)<br>visual examination shows no excessive weakening by holes, notches, nail splits<br>or other damage, and<br>(b)<br>logs have not been subjected to termite infestation.</td></tr></tbody></table>\n"
        }
      ]
    }
  ]
}